{"track":[{"idTrack":"32736467","idAlbum":"2110839","idArtist":"111319","idLyric":"363845","idIMVDB":"0","strTrack":"Smells Like Teen Spirit","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"301000","strGenre":"Grunge","strMood":"Sad","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Smells Like Teen Spirit\" is a song by the American rock band Nirvana. It is the opening track and lead single from the band's second album, Nevermind (1991), released on DGC Records. Written by Kurt Cobain, Krist Novoselic, and Dave Grohl and produced by Butch Vig, the song uses a verse-chorus form where the main four-chord riff is used during the intro and chorus to create an alternating loud and quiet dynamic.\nThe unexpected success of \"Smells Like Teen Spirit\" in late 1991 propelled Nevermind to the top of the charts at the start of 1992, an event often marked as the point where alternative rock entered the mainstream. \"Smells Like Teen Spirit\" was Nirvana's biggest hit, reaching number six on the Billboard Hot 100 and placing high on music industry charts all around the world in 1991 and 1992.\n\"Smells Like Teen Spirit\" received many critical plaudits, including topping the Village Voice Pazz & Jop critics' poll and winning two MTV Video Music Awards for its music video, which was in heavy rotation on music television. The song was dubbed an \"anthem for apathetic kids\" of Generation X, but the band grew uncomfortable with the success and attention it received as a result. In the years since Cobain's death, listeners and critics have continued to praise \"Smells Like Teen Spirit\" as one of the greatest rock songs of all time.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/urspuv1342344844.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=hTWKbfoikeg","strMusicVidDirector":"Samuel Bayer","strMusicVidCompany":"","strMusicVidScreen1":"https://www.theaudiodb.com/images/media/track/mvidscreen/rsrurr1577461847.jpg","strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"1032630231","intMusicVidLikes":"6112050","intMusicVidDislikes":"184919","intMusicVidFavorites":"0","intMusicVidComments":"365475","intTrackNumber":"1","intLoved":"5","intScore":"9.9","intScoreVotes":"10","intTotalListeners":"2127491","intTotalPlays":"16752430","strMusicBrainzID":"78b67cb1-da39-4954-b6e6-342835f6436b","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736468","idAlbum":"2110839","idArtist":"111319","idLyric":"363872","idIMVDB":"0","strTrack":"In Bloom","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"254000","strGenre":"Grunge","strMood":"Sad","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"In Bloom\" is a song by American rock band Nirvana. Written by frontman Kurt Cobain, the song addresses people outside of the underground music community who did not understand the band's message.\n\nNirvana made its first music video for an early version of \"In Bloom\" in 1990; however the song did not appear on a commercial release until the release of the group's second album, Nevermind, in 1991. \"In Bloom\" became the fourth and final single from the album in late 1992. It was accompanied by a new music video which parodied musical performances of 1960s variety shows. The music video for \"In Bloom\" won Best Alternative Video at the MTV Video Music Awards in 1993.\n\nNirvana first played the song the night before it was demoed. Bassist Krist Novoselic recalled that it \"originally sounded like a Bad Brains song. Then Kurt turned it into a pop song\". Cobain went home and reworked the song, playing the revised version of it over the phone to Novoselic. The band recorded \"In Bloom\" with producer Butch Vig at Smart Studios in Madison, Wisconsin during April 1990. The material recorded at Smart Studios was intended for the group's second album for the independent record label Sub Pop. The song originally had a bridge section that Vig removed. Novoselic said that after the band recorded the song, Vig cut out the bridge from the 16-track master tape with a razor blade and threw it in the garbage. The songs from these sessions were placed on a demo tape that circulated amongst the music industry, generating interest in the group among major record labels.\n\nAfter signing to DGC Records, Nirvana began recording its second album Nevermind in May 1991. \"In Bloom\" was one of the first songs the band recorded during the album sessions at Sound City Studios in Van Nuys, California; Vig thought it would be good to start recording a song previously recorded at Smart Studios. The arrangements for \"In Bloom\" and the other songs previously recorded with Vig in 1990 were largely unchanged; the recently hired drummer Dave Grohl stayed mostly with what his predecessor Chad Channing had recorded, but added more power and precision to the recording. Cobain sang progressively \"harder\" during the recording of the song, which made it difficult for Vig to balance the volume levels between the verses and choruses. Vig recalled that he had to change the input level \"on the fly\" and hoped that Cobain would not \"change the phrasing or do something different\" while recording.\n\nCobain chose not to overdub a harmony vocal part during the Smart Studios sessions, possibly due to time constraints. During the Nevermind sessions, Vig had Grohl sing harmonies on the song. Grohl had difficulty hitting the proper notes, but ultimately was able to sing what Vig wanted. Vig often had to trick Cobain, who was averse to performing multiple takes, into recording additional takes for overdubs on the record. The producer convinced Cobain to double-track his vocals on \"In Bloom\" by telling him, \"John Lennon did it.\" After doubling Cobain's vocals, Vig decided he might as well double Grohl's and had the drummer record an additional track of backing harmonies.\n\nLike many Nirvana songs, \"In Bloom\" shifts back and forth between quiet verses and loud choruses. Cobain uses a Mesa Boogie guitar amplifier for the verses, and during the chorus he switches to a Fender Bassman amp (suggested by Vig) for a heavier, double-tracked fuzztone sound. The rhythm section of Novoselic and Grohl kept its parts simple; Grohl stated it was \"an unspoken rule\" to avoid unnecessary drum fills, while Novoselic said he felt his role was about \"serving the song\". During the choruses, vocalist Cobain and drummer Grohl harmonize while singing \"He's the one/Who likes all our pretty songs/And he likes to sing along/And he likes to shoot his gun/But he knows not what it means\". The song's intro reappears at the end of each chorus.\n\nCobain's lyrics address the people outside of the underground music scene that began showing up at Nirvana shows after the release of the group's debut album Bleach. Nirvana biographer Michael Azerrad wrote, \"But remarkably,  translated even better to the mass popularity the band enjoyed.\" Regarding the song's chorus, Azerrad commented, \"The brilliant irony is that the tune is so catchy that millions of people actually do sing along to it.\" In his biography of Cobain, Heavier Than Heaven, Charles R. Cross asserted that the song was a \"thinly disguised portrait\" of Cobain's friend Dylan Carlson.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/xxuwvy1488312022.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=PbgKEjNBHqM","strMusicVidDirector":"Kevin Kerslake","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"76658964","intMusicVidLikes":"329005","intMusicVidDislikes":"6156","intMusicVidFavorites":"0","intMusicVidComments":"35223","intTrackNumber":"2","intLoved":"1","intScore":"9.625","intScoreVotes":"8","intTotalListeners":"1173310","intTotalPlays":"7009302","strMusicBrainzID":"b8862c6e-b1d4-4cb5-8ecc-19dedf8224f3","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736469","idAlbum":"2110839","idArtist":"111319","idLyric":"363870","idIMVDB":null,"strTrack":"Come as You Are","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"219000","strGenre":"Grunge","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Come as You Are\" is a song by the American grunge band Nirvana, written by frontman Kurt Cobain and released as the second single from the band's second studio album Nevermind in 1992. It was the band's second American Top 40 hit, and second UK top 10 hit, reaching number thirty-two on the Billboard Hot 100, and number nine on the UK Singles Chart. The music video for \"Come as You Are\" was directed by Kevin Kerslake, who drew inspiration for it from the cover artwork of Nevermind. In 2004, Rolling Stone named it at #445 on its \"The 500 Greatest Songs of All Time\" list and placed it at #452 in the 2010 reissue.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/tprtrv1342344965.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=vabnZ9-ex7o","strMusicVidDirector":"Kevin Kerslake","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"78765284","intMusicVidLikes":"271593","intMusicVidDislikes":"5004","intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"3","intLoved":"3","intScore":"9.5","intScoreVotes":"8","intTotalListeners":"1876514","intTotalPlays":"14078529","strMusicBrainzID":"2032dda9-4bc5-4f77-abbb-8568c154f70a","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736470","idAlbum":"2110839","idArtist":"111319","idLyric":"363835","idIMVDB":null,"strTrack":"Breed","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"183000","strGenre":"Grunge","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/uvyspx1342345392.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=Ee6xkwVucIE","strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"6948695","intMusicVidLikes":"27268","intMusicVidDislikes":"415","intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"4","intLoved":"0","intScore":"6.5","intScoreVotes":"4","intTotalListeners":"874281","intTotalPlays":"5046221","strMusicBrainzID":"def1142d-e64b-4d91-8f25-0b5e41e67ccb","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736471","idAlbum":"2110839","idArtist":"111319","idLyric":"363839","idIMVDB":"0","strTrack":"Lithium","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"256000","strGenre":"Grunge","strMood":"Sad","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Lithium\" is a song by American rock band Nirvana. Written by frontman Kurt Cobain, the song is about a man who turns to religion amid thoughts of suicide. Nirvana first recorded \"Lithium\" in 1990 but then re-recorded the song the following year for the group's second album Nevermind (1991).\n\nReleased as the third single from Nevermind in July 1992, \"Lithium\" peaked at number 64 on the US Billboard Hot 100 and number 11 on the UK Singles Chart. The accompanying music video, directed by Kevin Kerslake, is a montage of concert footage.\n\nNirvana singer/guitarist Kurt Cobain described \"Lithium\" as \"one of those songs I actually did finish while trying to write it instead of taking pieces of my poetry and other things.\" Nirvana recorded \"Lithium\" with producer Butch Vig at Smart Studios in Madison, Wisconsin during April 1990. The material recorded at Smart Studios was intended for the group's second album for the independent record label Sub Pop. The book Classic Rock Albums: Nevermind (1998) stated that observers considered the session for \"Lithium\" as a key event in the developing rift between Cobain and drummer Chad Channing. Cobain was dissatisfied with Channing's drumming as their musical styles were inconsistent. Cobain told Channing to perform the drum arrangement he had devised for the song. According to Vig, Cobain overexerted his voice while recording vocals for \"Lithium,\" which forced the band to halt recording. The songs from these sessions were placed on a demo tape and circulated within the music industry, generating interest in the group among major record labels.\n\nAfter signing to DGC Records, Nirvana reconvened with Vig in May 1991 to work on its major label debut, Nevermind, at Sound City Studios in Van Nuys, California. Between the sessions, bassist Krist Novoselic simplified the bassline; he said, \"I enriched the bass-playing a little more but that was about all that we changed.\" The recording session for \"Lithium\" was one of the most arduous for Vig and the group at Sound City. The band repeatedly sped up while recording the song, so Vig resorted to using a click track to maintain a consistent tempo. The producer suggested that new drummer Dave Grohl use simpler fills and patterns for the song, which resulted in a satisfactory instrumental take. Cobain's guitar track was more difficult to record. \"Kurt wanted to be able to play the guitar very . . . not methodical—it needed to have this space,\" Vig recalled. \"It had to be relaxed.\" Every time Cobain sped up, Vig called for another take. During the first day of recording the song, Cobain became so frustrated at the slow progress that the band instead began playing an instrumental jam it had been working on. Vig recorded the jam, later titled \"Endless, Nameless,\" and it was inserted as a hidden track at the end of Nevermind.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/wsstwq1486137235.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=pkcJEvMcnEg","strMusicVidDirector":"Kevin Kerslake","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"106588109","intMusicVidLikes":"444827","intMusicVidDislikes":"10100","intMusicVidFavorites":"0","intMusicVidComments":"35880","intTrackNumber":"5","intLoved":"2","intScore":"9.9","intScoreVotes":"9","intTotalListeners":"1487580","intTotalPlays":"10022396","strMusicBrainzID":"9043622b-6838-4761-9a36-866bcfc13abc","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736472","idAlbum":"2110839","idArtist":"111319","idLyric":"363883","idIMVDB":"0","strTrack":"Polly","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"176000","strGenre":"Grunge","strMood":"Sad","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Polly\" is a song by American grunge band Nirvana. It is the sixth song on their 1991 album, Nevermind.\n\nDating back to at least 1988, \"Polly\" stands alongside \"About a Girl\" as one of singer/guitarist Kurt Cobain's earliest forays into unfiltered pop songwriting. It was originally titled \"Hitchhiker\", and later \"Cracker\", but was renamed \"Polly\" sometime in 1989. It was left off Nirvana's 1989 debut album, Bleach, because Cobain believed it was not consistent with the band's heavy grunge sound of the time. However, it found its way onto the band's second album, Nevermind, two years later, and remained a part of the band's regular setlist until Cobain's death (and Nirvana's dissolution) in April 1994.\n\nIt also stands as drummer Chad Channing's only contribution to Nevermind, having been asked to leave the band before the recording of the album in Los Angeles. Channing's cymbal crashes remained on the final Nevermind version of the song as it was recorded at producer Butch Vig's Wisconsin studios before Channing was replaced by Dave Grohl. The tracks from those Wisconsin sessions, which included soon to be Nirvana classics \"In Bloom\" and \"Lithium\", would be used by the band as a demo in effort to attract major label attention. Those sessions also served to make the band comfortable enough with Vig's production style that they would select him to produce Nevermind. \"Polly\" is a distinct song in that it is entirely acoustic (as originally recorded for Nevermind), which contrasts the more \"clean-guitar-for-verses, distorted-guitar-for-choruses, quiet-loud-quiet\" pattern Nirvana is famous for employing. The song has the least significant drum part of all of Nirvana's catalogue of songs; only cymbals at the start of each chorus section.\n\n\"Polly\" was recorded in the key of E minor with the chords E5-G5-D5-C5 for all verses and then the chords D5-C5-G5-B♭5 for all choruses. The song starts with Cobain playing the verse progression on an acoustic guitar and singing the vocals until the first chorus when bass enters and a cymbal crash is played. This is done for all verses and choruses. After the second chorus the guitar stops playing and a bass break starts. According to Nevermind producer Butch Vig on Classic Albums: Nevermind, Cobain sang the line \"Polly said\" too early, but they decided to leave it in. However, that statement is erroneous, considering there are demos and performances of the song dating back to 1989 with the premature interjection included. The song ends with a final cymbal crash after the third chorus.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/swyqpw1486137264.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"6","intLoved":"1","intScore":"8.25","intScoreVotes":"4","intTotalListeners":"1123457","intTotalPlays":"6985082","strMusicBrainzID":"de9db175-aea1-4996-a8fb-569a2d478c57","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736473","idAlbum":"2110839","idArtist":"111319","idLyric":"363949","idIMVDB":null,"strTrack":"Territorial Pissings","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"143000","strGenre":"Grunge","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"7","intLoved":"0","intScore":"7.3","intScoreVotes":"3","intTotalListeners":"712960","intTotalPlays":"3540389","strMusicBrainzID":"044a99bf-bc64-4ce8-95bb-f4fa340e6a67","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736474","idAlbum":"2110839","idArtist":"111319","idLyric":"363836","idIMVDB":null,"strTrack":"Drain You","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"223000","strGenre":"Grunge","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"8","intLoved":"0","intScore":"7.7","intScoreVotes":"3","intTotalListeners":"888237","intTotalPlays":"5190418","strMusicBrainzID":"bf7dd78c-ee8a-4ea6-b36e-286e5e3f6ee2","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736475","idAlbum":"2110839","idArtist":"111319","idLyric":"363947","idIMVDB":null,"strTrack":"Lounge Act","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"156000","strGenre":"Grunge","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"9","intLoved":"0","intScore":"6","intScoreVotes":"2","intTotalListeners":"707066","intTotalPlays":"3868266","strMusicBrainzID":"004ec1b7-9f29-415e-8861-4ecb08b7215b","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736476","idAlbum":"2110839","idArtist":"111319","idLyric":"363948","idIMVDB":null,"strTrack":"Stay Away","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"212000","strGenre":"Grunge","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"10","intLoved":"0","intScore":"8","intScoreVotes":"3","intTotalListeners":"684651","intTotalPlays":"3264934","strMusicBrainzID":"e9fe5c28-cf5f-4b73-855c-3c48a1a4d077","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736477","idAlbum":"2110839","idArtist":"111319","idLyric":"363881","idIMVDB":null,"strTrack":"On a Plain","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"196000","strGenre":"Grunge","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"11","intLoved":"0","intScore":"8.5","intScoreVotes":"2","intTotalListeners":"878034","intTotalPlays":"4887492","strMusicBrainzID":"262b5f58-7e9e-474c-9dbf-6ebd454c50d4","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736478","idAlbum":"2110839","idArtist":"111319","idLyric":"363884","idIMVDB":null,"strTrack":"Something in the Way","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"228000","strGenre":"Grunge","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"12","intLoved":"0","intScore":"8.5","intScoreVotes":"2","intTotalListeners":"848387","intTotalPlays":"4976299","strMusicBrainzID":"9d91b2a8-a4f3-4144-9a87-d2e2e3ff94b0","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"},{"idTrack":"32736479","idAlbum":"2110839","idArtist":"111319","idLyric":"363946","idIMVDB":null,"strTrack":"Endless, Nameless","strAlbum":"Nevermind","strArtist":"Nirvana","strArtistAlternate":null,"intCD":null,"intDuration":"404000","strGenre":"Grunge","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"13","intLoved":"0","intScore":"4","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"ed7400a4-05b3-40ac-9cea-21635c573787","strMusicBrainzAlbumID":"1b022e01-4da6-387b-8658-8678046e4cef","strMusicBrainzArtistID":"5b11f4ce-a62d-471e-81fc-a69a8278c7da","strLocked":"unlocked"}]}