{"track":[{"idTrack":"32749470","idAlbum":"2112023","idArtist":"111418","idLyric":"404242","idIMVDB":null,"strTrack":"Airbag","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"284400","strGenre":"Alternative Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"1","intLoved":"0","intScore":"6.5","intScoreVotes":"2","intTotalListeners":"975289","intTotalPlays":"6434217","strMusicBrainzID":"4a7fea2e-545b-4c63-bc9a-9943cc3a29d7","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749471","idAlbum":"2112023","idArtist":"111418","idLyric":"404256","idIMVDB":"0","strTrack":"Paranoid Android","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"383493","strGenre":"Alternative Rock","strMood":"Sad","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Paranoid Android\" is a song by the English alternative rock band Radiohead, released as the lead single from their third studio album OK Computer (1997) on 26 May 1997. The darkly humorous lyrics were written primarily by singer Thom Yorke following an unpleasant experience in a Los Angeles bar. The song is more than six minutes long and contains four distinct sections. \"Paranoid Android\" takes its name from Marvin the Paranoid Android of Douglas Adams' The Hitchhiker's Guide to the Galaxy series.\n\nReleased as the lead single from OK Computer, \"Paranoid Android\" charted at number three on the UK Singles Chart. It was well received by music critics. The track has appeared regularly on lists of the best songs of all time, including Rolling Stone's 500 Greatest Songs of All Time. Its animated music video, directed by Magnus Carlsson, was placed on heavy rotation on MTV, although the network censored portions containing nudity in the US. At the 1998 Brit Awards, the song was nominated for Best British Single. Since its release, the track has been covered by numerous artists working in a variety of musical genres. The song was included in the 2008 Radiohead: The Best Of collection.\n\nRadiohead fused together parts from three different songs, each written by a different member of the band. The idea to combine the pieces into a single track was inspired in part by the through-composed structure of The Beatles' \"Happiness Is a Warm Gun\".\n\n\"Basically an excuse to weld loads of half-finished songs together, Abbey Road-style. It's Radiohead, pissed and having a party. I wasn't there when it was all stuck together – I'd been sent to sleep it off. What's it all about? The fall of the Roman Empire.\" – Thom Yorke\n\nColin Greenwood admitted that the band, in attempting it to make the disparate elements work together, \"felt like irresponsible schoolboys who were doing this ... naughty thing, 'cause nobody does a six-and-a-half-minute song with all these changes. It's ridiculous\". The song was at first intended to be humorous, and took its title from Marvin the Paranoid Android in Douglas Adams' The Hitchhiker's Guide to the Galaxy series of books. Yorke said the title \"was chosen as a joke. It was like, 'Oh, I'm so depressed.' And I just thought, that's great. That's how people would like me to be. And that was the end of writing about anything personal in the song. The rest of the song is not personal at all.\" In an early interview, Colin Greenwood described it \"just a joke, a laugh, getting wasted together over a couple of evenings and putting some different pieces together\". The band used Queen's \"Bohemian Rhapsody\" and the work of the Pixies as reference points while writing; yet Ed O'Brien denies they wrote \"a 'Bohemian Rhapsody' for the nineties\", and Jonny Greenwood considers it too tense and simple to rival Queen's song.\n\n\"Paranoid Android\" was recorded in actress Jane Seymour's 15th century mansion near the village of St Catherine, near Bath, Somerset. The first edit was over 14 minutes long and included a long organ interlude performed by Jonny Greenwood. Radiohead played this extended version during a tour with Alanis Morissette in September 1996. \"When we started playing it live, it was completely hilarious,\" recalled O'Brien. \"There was a rave down section and a Hammond organ outro, and we'd be pissing ourselves while we played. We'd bring out the glockenspiel and it would be really, really funny.\" Before the song's first live performance, Yorke told audiences that \"f you can have sex to this one, you're fucking weird.\" He also sarcastically referred to the version of the song played during the tour as \"a Pink Floyd cover\".\n\nInspired by the editing of The Beatles' Magical Mystery Tour (described by Colin Greenwood as \"brutal\"), Radiohead shortened the song to a final six and a half minutes, a process that led to Jonny Greenwood's organ section being replaced by a substantially shorter guitar fade out. However, it took the band a year and a half to learn how to play the final version in live performance.\n\n\"Paranoid Android\" is a song described as alternative rock, art rock and progressive rock. It has four distinct sections, each played in standard tuning, and a 4/4 time signature, although several three-bar segments in the second section are played in 7/8 timing. The opening segment is played in the key of G minor with a tempo of 84 beats per minute (BPM), and begins with a mid-tempo acoustic guitar backed by shaken percussion before layered with electric guitar and Yorke's vocals. The melody of the opening vocal lines span an octave and a third. The second section is written in the key of A minor and begins about two minutes into the song. Although the second section retains the tempo of the first, it differs rhythmically. Ending the second section is a distorted guitar solo played by Jonny Greenwood, which lasts from 2:43 to 3:33. The third section was written by Jonny Greenwood, and reduces the tempo to 63 BPM. The harmonies form a looped chord progression resembling a Baroque passacaglia, with the tonality split between C minor and D minor. This section uses multi-tracked, choral vocal arrangement and according to Dai Griffiths, a \"chord sequence  would sound seedy, rather like something by the band Portishead\".\n\nThe fourth and final section, which begins at 5:35, is a brief instrumental reprise of the second movement that serves as a coda. After a second solo, a brief guitar riff is introduced, which Jonny Greenwood says \"was something I had floating around for a while and the song needed a certain burn. It happened to be the right key and the right speed and it fit right in.\" The song ends, as does the second section, with a short chromatically descending guitar motif.\n\n\"Paranoid Android\" is categorised by three distinct moods written in what Yorke referred to as three different states of mind. The song's lyrics tie in with a number of themes common in OK Computer, including insanity, violence, slogans, and political objection to capitalism. Yorke's lyrics were based on an unpleasant experience at a Los Angeles bar during which he was surrounded by strangers high on cocaine. In particular, Yorke was frightened by a woman who became violent after someone spilled a drink on her. Yorke characterised the woman as \"inhuman\", and said \"There was a look in this woman's eyes that I'd never seen before anywhere. ... Couldn't sleep that night because of it.\" The woman inspired the line \"kicking squealing Gucci little piggy\" in the song's second section. Yorke, referring to the line \"With your opinions, which are of no consequence at all\", said that \"Again, that's just a joke. It's actually the other way around – it's actually my opinion that is of no consequence at all.\"\n\nRemarking on the band's goals for the \"Paranoid Android\" music video, Yorke said that, \"When it came time to make the video for that song, we had lots of people saying, 'Yeah, great, we can have another video like \"Street Spirit\", all moody and black and dark. Well, no. We had really good fun doing this song, so the video should make you laugh. I mean, it should be sick, too.\" Magnus Carlsson, Swedish creator of the animated series Robin, was commissioned by the band to make the video. Radiohead were fans of the show, and connected with the Robin character; Jonny Greenwood described him as \"affectionate\" and \"vulnerable\", while Yorke admitted that he found Robin \"quite the vulnerable character, but he's also violently cynical and quite tough and would always get up again.\" At first Carlsson sought to work on a video for \"No Surprises\" and was uncertain as to how to approach \"Paranoid Android\". Eventually he devised a scenario to the band's liking after he locked himself in his office for over 12 hours to stare out of the window, while listening to the song on repeat while jotting down visual ideas. As Carlsson did not have access to the lyrics at the time, the concept for the video was based entirely on the song's sound. According to Yorke, the band \"deliberately didn't send Magnus the lyrics\" because they \"didn't want  to be too literal.\"\n\n\nThe members of Radiohead, as depicted in the \"Paranoid Android\" video. The video's protagonist, Robin, is shown at far right.\nLike Robin, the \"Paranoid Android\" video is drawn in a simplistic style that emphasises bold colours and clear, strong lines. It features Robin and his friend Benjamin venturing into the world, running into miserable EU representatives, bullying pub patrons, a prostitute, two kissing leathermen, a drug addict, deranged businessmen, mermaids and an angel who plays table tennis with Robin. The band appears in cameo at a bar, where they are shown drinking while watching a man with a head coming out of his belly dancing on their table. However, in this cameo only the versions of Yorke and Jonny Greenwood resemble themselves; O'Brien said \"If you freeze-frame it on the video, the guy with the five strands of hair slicked back, that's Colin. It looks nothing like him.\" Colin Greenwood said \"there was no way that we could appear in it to perform in it because that would be so Spinal Tap\" and that having animations that did not resemble the band members allowed the video to be \"twisted and colorful which is how the song is anyway\". Yorke was ultimately pleased with the video, saying that it \"is really about the violence around , which is exactly like the song. Not the same specific violence as in the lyrics, but everything going on around him is deeply troubling and violent, but he's just drinking himself into oblivion. He's there, but he's not there. That's why it works. And that's why it does my head in every time I see it.\"\n\nWhile the single did not receive significant radio play in the US, MTV placed its video on high rotation. The version most often shown was edited to remove the mermaids' bare breasts. Greenwood said, \"we would've understood if they had a problem with some guy chopping his arms and legs off, but I mean, a woman's breasts! And mermaids as well! It's fucked up.\" MTV Europe played the video uncut for two weeks because the channel's official censor was ill and unable to work; after that time the channel ran the cut version of the video. A later US version of the video saw the mermaids wear bathing suits, while the uncut version was later compiled along with other Radiohead videos on the DVD and home video release 7 Television Commercials and The Best Of DVD.\n\nEvan Sawdey of PopMatters described the video as \"bizarre-yet-fitting\", and Melody Maker said it represented a stunning \"psycho-cartoon\". Adrian Glover of Circus called the animation incredible and the video \"really cool\". MTV vice president of music Lewis Largent told Spin \"You can watch 'Paranoid Android' a hundred times and not figure it all out.\"","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/ruutry1487239085.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=fHiGbolFFGw","strMusicVidDirector":"Magnus Carlsson","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"22884484","intMusicVidLikes":"108545","intMusicVidDislikes":"4490","intMusicVidFavorites":"0","intMusicVidComments":"6416","intTrackNumber":"2","intLoved":"2","intScore":"9.25","intScoreVotes":"8","intTotalListeners":"1359868","intTotalPlays":"10938322","strMusicBrainzID":"9f9cf187-d6f9-437f-9d98-d59cdbd52757","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749472","idAlbum":"2112023","idArtist":"111418","idLyric":"404269","idIMVDB":null,"strTrack":"Subterranean Homesick Alien","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"267706","strGenre":"Alternative Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"3","intLoved":"0","intScore":null,"intScoreVotes":null,"intTotalListeners":"867541","intTotalPlays":"5484751","strMusicBrainzID":"bd82738d-163c-4b1a-bfaf-7acffe30e68a","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749473","idAlbum":"2112023","idArtist":"111418","idLyric":"404246","idIMVDB":null,"strTrack":"Exit Music (for a Film)","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"264800","strGenre":"Alternative Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"4","intLoved":"0","intScore":null,"intScoreVotes":null,"intTotalListeners":"927975","intTotalPlays":"6916709","strMusicBrainzID":"23c3c36b-9449-4484-9040-6ef2125999aa","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749474","idAlbum":"2112023","idArtist":"111418","idLyric":"404252","idIMVDB":null,"strTrack":"Let Down","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"299266","strGenre":"Alternative Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":"Simon Hilton","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"5","intLoved":"0","intScore":"6","intScoreVotes":"1","intTotalListeners":"935069","intTotalPlays":"6850906","strMusicBrainzID":"47b02a82-c3bf-4647-b894-dd1c8f608e7f","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749475","idAlbum":"2112023","idArtist":"111418","idLyric":"404250","idIMVDB":"0","strTrack":"Karma Police","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"261626","strGenre":"Alternative Rock","strMood":"Sad","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Karma Police\" is a song by English alternative rock band Radiohead from their 1997 third studio album OK Computer. The song's title and lyrics derive from an in-joke among the band, referring to the Hindu theory of cause and effect, known as karma.\n\n\"Karma Police\" was released as the second single from OK Computer, and became a commercial success, charting at number eight on the UK Singles Chart and number fourteen on the US Hot Modern Rock Tracks. Critical reception to the single was also favourable.\n\nIn 2008 the song was featured on the Radiohead: The Best Of collection.\n\n\"Karma Police\", like several other songs that would make up OK Computer, was debuted live in 1996, when the band briefly supported Alanis Morissette on tour. A live version of \"Karma Police\", performed with a Rhodes piano on the Late Show with David Letterman, is captured in the Radiohead documentary Meeting People Is Easy.\n\n\"Karma Police\" is in a 4/4 time signature and played in standard tuning. The first half of the song is in the key of E minor, and would feature a Neapolitan chord (F). The second half (starting with the line \"For a minute there\") is in B minor. Acoustic guitar and piano are the most prominent instruments in the song, and the chord progression owes an audible debt to The Beatles song \"Sexy Sadie\".\n\nThe structure of the song is unconventional in that it has nothing resembling a typical chorus. Instead, the song progresses from the intro into a mid-tempo section which alternates between two verses. The first verse begins with the line \"Karma police\", and the other begins with the line \"This is what you'll get\". During the second section the drums drop out and an analog synthesizer imitating a choir is featured. After this section cycles through twice, the song switches into a second section which is based around the line \"For a minute there, I lost myself\". During this section of the song, Yorke's voice is put through an echo effect and a sliding melodic figure serves as a counterpoint to Yorke's vocals. In the outro, Ed O'Brien plays a few notes on his guitar, which are distorted by overloading an AMS rackmount digital delay unit and turning the delay rate knob down.\n\nRadiohead members used to tell one another that they would call \"the karma police\" on them if they did something bad. The joke was incorporated into the lyrics and title of the song. Yorke explained that the song was about stress and \"having people looking at you in that certain  way, I can't handle it anymore\". Thom Yorke explained the idea of the lyrics to The Independent in 2006, saying, \"It's for someone who has to work for a large company. This is a song against bosses. Fuck the middle management!\" Yorke and Jonny Greenwood emphasised in interviews that the song had a humorous bent; Yorke said, \" not entirely serious, I hope people will realize that.\" The song includes the line \"He buzzes like a fridge/He's like a detuned radio\", a reference to the distracting, metaphorical background noise Yorke calls \"fridge buzz\". Yorke has said that the idea of fridge buzz is one of the primary themes of OK Computer. \"Karma Police\" also shares themes of insanity and dissatisfaction with capitalism.\n\nThe music video for the song was directed by Jonathan Glazer, previously responsible for Radiohead's \"Street Spirit (Fade Out)\" clip. The video premiered in August 1997 and featured Radiohead frontman Thom Yorke as well as Hungarian actor Lajos Kovács. Glazer won MTV's Director of the Year award in 1997 for his work on this, as well as Jamiroquai's \"Virtual Insanity\". Glazer however revealed in an interview that he considers this video to be a failed attempt. According to MTV.com, Glazer had pitched the concept of the \"Karma Police\" video months earlier to Marilyn Manson, who disliked it.\n\nThe video starts with the camera, an unseen driver, looking at the empty back seat of a 1976 Chrysler New Yorker at night. The 'driver' then faces the windscreen and begins driving. For 35 seconds, it shows nothing but a road through grass illuminated by headlights, with insects visible around the windscreen. A figure is then seen running from the car. In time for the chorus the view shifts back to the back seat, where Thom Yorke now sits, almost mumbling his lyrics. The view yet again moves to the figure, who is close to being mown down, as the view again switches to Yorke, now slouching drowsily against the back of the front seat, barely lipsyncing any longer. The camera swivels again and the figure appears again, close this time. For the first time another perspective reveals the outside of the car. The pursued figure sharpens and is revealed to be a large man with a frightened look. The car comes to a stop before him, then reverses slightly, as if for a 'run up', and this reveals it to be leaking fuel. The man realises the car has a petrol leak and puts his hands behind his back as if in resignation, then takes matches from his pocket, lights one, and throws it down. The perspective shifts to the car's interior. The car suddenly reverses, away from the man, a path of fire now blazes back towards the car. The car slowly catches fire, and the camera/driver finally turns frantically to the back seat and robotically swivels back and forth, only to find that Yorke is no longer there.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/qrvxpv1447964960.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=1uYWYWPc9HU","strMusicVidDirector":"Jonathan Glazer","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"55350873","intMusicVidLikes":"300701","intMusicVidDislikes":"9619","intMusicVidFavorites":"0","intMusicVidComments":"11482","intTrackNumber":"6","intLoved":"5","intScore":"9.5","intScoreVotes":"8","intTotalListeners":"1654614","intTotalPlays":"14610151","strMusicBrainzID":"9e2ad5bc-c6f9-40d2-a36f-3122ee2072a3","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749476","idAlbum":"2112023","idArtist":"111418","idLyric":"404268","idIMVDB":null,"strTrack":"Fitter Happier","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"117333","strGenre":"Alternative Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"7","intLoved":"0","intScore":null,"intScoreVotes":null,"intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"5838f978-0822-4e28-874f-e1511324ec3a","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749477","idAlbum":"2112023","idArtist":"111418","idLyric":"404267","idIMVDB":null,"strTrack":"Electioneering","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"230640","strGenre":"Alternative Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"8","intLoved":"0","intScore":null,"intScoreVotes":null,"intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"ba0a796c-bd1f-4d4b-85a8-918f217a204a","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749478","idAlbum":"2112023","idArtist":"111418","idLyric":"404266","idIMVDB":null,"strTrack":"Climbing Up the Walls","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"285200","strGenre":"Alternative Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"9","intLoved":"0","intScore":"7","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"c7225576-001e-423c-adc1-58f0985dcb27","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749479","idAlbum":"2112023","idArtist":"111418","idLyric":"404254","idIMVDB":"0","strTrack":"No Surprises","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"228533","strGenre":"Alternative Rock","strMood":"Sad","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"No Surprises\" is a song by the English alternative rock band Radiohead, released as the third and final single from their third studio album OK Computer (1997) on 12 January 1998. The song was accompanied by a music video that featured a single shot of lead singer Thom Yorke's head singing karaoke lyrics of the song displayed inside a helmet that briefly fills up with water. The single peaked at number 4 on the UK Singles Chart.\n\nRadiohead wrote \"No Surprises\" while touring with R.E.M. in 1995. It was the first song recorded on the first day of sessions for OK Computer. \"That childlike guitar sound set the mood for the whole album\", said Thom Yorke. \"We were going for that Pet Sounds vibe.\"\n\nThe version on the album is the first take recorded. \"We did endless versions afterwards  and they were all just covers of the first version\", Yorke recalled. \"So we gave up and went back to .\"\n\nThe music video for \"No Surprises\" was directed by Grant Gee. The video consists solely of a single close-up shot of Thom Yorke's head inside an astronaut-style dome helmet. The lyrics are shown throughout the entire song slowly scrolling upwards but mirrored, as they are being reflected off of the dome. After the first verse, the helmet begins to fill with water. Yorke continues singing as he attempts to lift his head above the rising water. Once the bubble completely fills, Yorke is motionless for over a minute, after which the water is released and he resumes singing. For Yorke's safety, the video was filmed at high speed and played back in slow-motion.\n\n\nYorke, in the music video (left) and filming the music video (right)\nOne of the scenes in Gee's documentary about Radiohead, Meeting People Is Easy, cuts from the British news channel Sky News showing and (unfavourably) discussing the video to several takes of its filming. The song speeds up during filming when his face is fully submerged, until he pulls the rubber bottom out to release the water and members of the film crew help him out. Despite the safety measures, Yorke is shown getting more visibly uncomfortable and agitated with each take.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/wtssuy1487239145.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://vimeo.com/22918371","strMusicVidDirector":"Grant Gee","strMusicVidCompany":"Kudos Productions","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"10","intLoved":"1","intScore":"9.28571","intScoreVotes":"7","intTotalListeners":"1327069","intTotalPlays":"10960490","strMusicBrainzID":"980a426e-623e-4ea5-98c7-008d037a0508","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749480","idAlbum":"2112023","idArtist":"111418","idLyric":"404253","idIMVDB":null,"strTrack":"Lucky","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"259626","strGenre":"Alternative Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"11","intLoved":"0","intScore":"5","intScoreVotes":"1","intTotalListeners":"896476","intTotalPlays":"6262922","strMusicBrainzID":"79047824-f821-4b1a-9893-e0cea1c947dd","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"},{"idTrack":"32749481","idAlbum":"2112023","idArtist":"111418","idLyric":"404270","idIMVDB":null,"strTrack":"The Tourist","strAlbum":"OK Computer","strArtist":"Radiohead","strArtistAlternate":null,"intCD":null,"intDuration":"324533","strGenre":"Alternative Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"12","intLoved":"0","intScore":null,"intScoreVotes":null,"intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"610c0012-6eb4-42a0-b759-3a2532ce0f15","strMusicBrainzAlbumID":"b1392450-e666-3926-a536-22c65f834433","strMusicBrainzArtistID":"a74b1b7f-71a5-4011-9441-d0b5e4122711","strLocked":"unlocked"}]}