{"track":[{"idTrack":"32823004","idAlbum":"2118224","idArtist":"112424","idLyric":"333115","idIMVDB":null,"strTrack":"Bad","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"247093","strGenre":"Pop","strMood":"Quirky","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Bad\" is a song by American song writer and recording artist Michael Jackson. \"Bad\" was released by Epic Records in September 1987, as the second single from Jackson's seventh studio album of the same name. The song was written, composed, and co-produced by Jackson, and produced by Quincy Jones. Jackson stated that the song was influenced by a real life story he'd read about.\n\"Bad\" was generally well received by contemporary music critics, with some critics noting that \"Bad\" helped Jackson's image become edgier during the Bad-era. The song peaked at number one on the Billboard Hot 100, and remained at the top position of the chart for two weeks, becoming Jackson's Bad album's second number one single, and Jackson's seventh number one entry on the chart. Internationally, the song was also commercially successful, charting within the top ten in eleven countries as well as charting within the top five in the United Kingdom, France, Italy, Norwegian, Switzerland and Swedish charts. The song peaked at number one on the Netherlands and European charts.\nA music video for \"Bad\", directed by Martin Scorsese and co-starring one of the first appearances of yet-undiscovered Wesley Snipes, was released in late 1987. In the video, Jackson and a group of background dancers are shown doing dance routines throughout a subway station. The music video's choreographer stated that the plot and video of the background was strongly influenced by the \"Cool\" scene in West Side Story. The music video received one nomination at the Video Music Awards in 1988. \"Bad\" has been covered and parodied by multiple artists since its release as well as becoming a frequent song used during tributes to Jackson after his death in June 2009.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/ytrqpr1368784967.jpg","strTrack3DCase":null,"strTrackLyrics":"Your butt is mine\nGonna tell you right\nJust show your face\nIn broad daylight\nI'm telling you\nGonna go after you\nGonna hurt your mind\nDon't shoot to kill\nCome on\nCome on\nLay it on me\nAll right\n\nI'm giving you\nOn the count of three\nTo show your stuff\nOr let it be\nI'm telling you\nJust watch your mouth\nI know your game\nWhat you're about\n\nWell they say the sky's the limit\nAnd to me that's really true\nBut my friend you have seen nothin'\nJust wait 'till I get through\n\nBecause I'm bad, I'm bad - come on\n(Bad bad - really, really bad)\nYou know I'm bad, I'm bad - you know it\n(Bad bad - really, really bad)\nYou know I'm bad, I'm bad - come on, you know\n(Bad bad - really, really bad)\nAnd the whole world has to\nAnswer right now\nJust to tell you once again,\nWho's bad\n\nThe word is out\nYou're doin' wrong\nGonna lock you up\nBefore too long\nYour lyin' eyes\nGonna tell you right\nSo listen up\nDon't make a fight\nYour talk is cheap\nYou're not a man\nYou're throwin' stones\nTo hide your hands\n\nWell they say the sky's the limit\nAnd to me that's really true\nBut my friend you have seen nothin'\nJust wait 'till I get through\n\nBecause I'm bad, I'm bad - come on\n(Bad bad - really, really bad)\nYou know I'm bad, I'm bad - you know it\n(Bad bad - really, really bad)\nYou know I'm bad, I'm bad - come on, you know\n(Bad bad - really, really bad)\nAnd the whole world has to\nAnswer right now\nJust to tell you once again\nWho's bad\n\nWe can change the world tomorrow\nThis could be a better place\nIf you don't like what I'm saying'\nThen won't you slap my face\n\nBecause I'm bad, I'm bad - come on\n(Bad bad - really, really bad)\nYou know I'm bad, I'm bad - you know it\n(Bad bad - really, really bad)\nYou know I'm bad, I'm bad - come on, you know\n(Bad bad - really, really bad)\nAnd the whole world has to\nAnswer right now\nJust to tell you once again,\nWho's bad\n\nWoo! Woo! Woo!\n(And the whole world has to answer right now\nJust to tell you once again...)\n\nYou know I'm bad, I'm bad - come on\n(Bad, bad - really, really bad)\nYou know I'm bad, I'm bad - you know it - you know it\n(Bad bad - really, really bad)\nYou know, you know, you know - come on\n(Bad bad - really, really bad)\nAnd the whole world has to answer right now\n(And the whole world has to answer right now)\nJust to tell you\n(Just to tell you once again)\n\nYou know I'm smooth - I'm bad - you know it\n(Bad bad - really, really bad)\nYou know I'm bad - I'm bad baby\n(Bad bad - really, really bad)\nYou know, you know, you know it - come on\n(Bad bad, really, really bad)\nAnd the whole world has to answer right now\n(And the whole world has to answer right now)\nWoo!\n(Just to tell you once again)\n\nYou know I'm bad, I'm bad - you know it\n(Bad bad - really, really bad)\nYou know I'm bad - you know - hoo!\n(Bad bad - really, really bad)\nYou know I'm bad - I'm bad - you know it, you know\n(Bad bad - really, really bad)\nAnd the whole world has to answer right now\n(And the whole world has to answer right now)\nJust to tell you once again...\n(Just to tell you once again...)\nWho's bad?\n","strMusicVid":"http://www.youtube.com/watch?v=dsUXAEzaC3Q","strMusicVidDirector":"Martin Scorsese","strMusicVidCompany":"Optimum Productions","strMusicVidScreen1":"https://www.theaudiodb.com/images/media/track/mvidscreen/uttvyy1368784355.jpg","strMusicVidScreen2":"https://www.theaudiodb.com/images/media/track/mvidscreen/wsvxrr1368784836.jpg","strMusicVidScreen3":"https://www.theaudiodb.com/images/media/track/mvidscreen/stqruy1368784842.jpg","intMusicVidViews":"331071516","intMusicVidLikes":"1740799","intMusicVidDislikes":"56783","intMusicVidFavorites":"0","intMusicVidComments":"100017","intTrackNumber":"1","intLoved":"2","intScore":"9.8","intScoreVotes":"5","intTotalListeners":"612307","intTotalPlays":"3167827","strMusicBrainzID":"47eaab1a-667b-490d-8094-168e7d0d9ad1","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823005","idAlbum":"2118224","idArtist":"112424","idLyric":"333138","idIMVDB":"0","strTrack":"The Way You Make Me Feel","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"299573","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"The Way You Make Me Feel\" is a song by American recording artist Michael Jackson. Released by Epic Records in November 1987, it was the third single from Jackson's seventh studio album Bad. Written and composed by Jackson, and produced by Quincy Jones (and co-produced by Jackson), the song is credited as being a rhythm and blues song.\n\nAside from appearing on Jackson's Bad album, the song has also been featured on the first disc of Jackson's compilation album HIStory: Past, Present and Future, Book I in 1995, Number Ones in 2003, The Ultimate Collection in 2004, The Essential Michael Jackson in 2005, Visionary: The Video Singles in 2006 and This Is It in 2009. \"The Way You Make Me Feel\" has been covered by multiple recording artists since its release.\n\nThe song received positive reviews from some contemporary critics. \"The Way You Make Me Feel\" became Bad's third consecutive single to peak at number one on the Billboard Hot 100, and charted mainly within the top ten and twenty internationally. A music video for \"The Way You Make Me Feel\" was released at the time showing Jackson pursuing and dancing with a woman. Since the music video's release, it has become influential on other artists' material. The song has been performed on all of Jackson's world concert tours as a solo artist, and was planned to have been performed during the This Is It concerts from 2009 to 2010. Notable live performances of the song by Jackson include a performance at the 1988 Grammy Awards ceremony.\n\"The Way You Make Me Feel\" was recorded by Michael Jackson in 1987 for his seventh studio album Bad, which was released the same year it was recorded. Epic Records released the song as the third single from the album in November that year. \"The Way You Make Me Feel\" was written and co-produced by Jackson, and produced by Quincy Jones. Before the recording of Bad, Jackson had written over sixty songs for the album, with plans of releasing a three disc album, but after Jones convinced Jackson to make Bad a one disc LP, \"The Way You Make Me Feel\", as well as ten other songs were selected for the album. According to Bad 25, a documentary about the 25th anniversary of Bad's release, the song and subsequent video was intended to show another aspect to public's perception of Michael Jackson in addition to his reputation as a lover (I Just Can't Stop Loving You) and being streetwise (Bad) they wanted to show him as a flirt or able to pick up girls.\n\n\"The Way You Make Me Feel\" has been featured on multiple greatest hits and compilation albums by Jackson since the song's release, including the first disc of Jackson's two disc compilation album HIStory: Past, Present and Future, Book I in 1995, Jackson's greatest hits album, Number Ones in 2003 and the This Is It compilation album in 2009.\n\nMusically, \"The Way You Make Me Feel\" is a rhythm and blues song composed of blues harmonies. The song's opening lyrics are \"Hey, pretty baby with the high heels on\". \"The Way You Make Me Feel\"'s lyrics pertain to being in love, as well as the feeling of loving someone. Throughout the song Jackson's vocal range spans from B3 to A5. The song is played in the key of E major. \"The Way You Make Me Feel\" has a mid-tempo of medium rock and has a metronome of 120 beats per minute. The song follows in the chord progression of C—E♭/C—C—C/E♭ in the first line, when Jackson sings \"Hee-hee! Ooh Go on!\" and continues on the same progression in the second line, when Jackson sings \"Girl! Aaow!\".\nThe music video for \"The Way You Make Me Feel\" was directed by Joe Pytka and produced by Michael Nesmith. It was choreographed by Vincent Paterson. The short version of the video is seven minutes and fifty-four seconds long and the full version is nine minutes and thirty-three seconds long. The video begins with a group of males trying to pick up women, but they don't get any luck. One of the males (Michael Jackson) is told to go home and don't hang around with the other guys anymore. When the male walks home, an elderly man (played by Joe Seneca), who is sitting on the steps of his house, tells him to just be himself. The male notices a female, played by model/dancer Tatiana Thumbtzen, walking down the streets alone.\n\nShortly after the male walks out of an alley and stands in front of the female while she's walking down the street, although she ignores him and keeps walking. He gets her attention by shouting, and then begins singing \"The Way You Make Me Feel\" to her while also dancing. Uninterested, she walks away. He follows her, having been cheered on by his friends to pursue her. Another dance routine begins, involving the males friends, which leads to the male pursuing the female throughout the neighborhood. The video ends with the male eventually winning the female over, and embraces her, while a fire hydrant is spraying out water. The videoclip also features an appearance by his sister La Toya as one of Thumbtzen's friends.\n\nThe music video was released on October 31, 1987, and received one nomination at the 1988 MTV Video Music Awards Ceremony. The video, alongside Jackson's '\"Bad\" video, was nominated for Best Choreography, but lost to Jackson's younger sister Janet's video \"The Pleasure Principle\".\n\nThe music video was included on the video albums: Video Greatest Hits – HIStory (long version on DVD and short version on VHS), Number Ones (short version), Michael Jackson's Vision (long version) and the Target version DVD of Bad 25 (long version).\n\nThe introduction of the full version of the video also samples the Roy Ayers 1985 song \"Hot\" from his You Might Be Surprised album.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/wxuxrq1374954646.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=HzZ_urpj4As","strMusicVidDirector":"Joe Pytka","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"125917898","intMusicVidLikes":"376556","intMusicVidDislikes":"12734","intMusicVidFavorites":"0","intMusicVidComments":"40105","intTrackNumber":"2","intLoved":"2","intScore":"8","intScoreVotes":"4","intTotalListeners":"557476","intTotalPlays":"2827932","strMusicBrainzID":"9cec664e-bfad-49b6-9945-2a9e6ccb51c0","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823006","idAlbum":"2118224","idArtist":"112424","idLyric":"333182","idIMVDB":"0","strTrack":"Speed Demon","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"241226","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Speed Demon\" is a song by American recording artist Michael Jackson from his seventh studio album, Bad. The song was written, composed, and co-produced by Jackson, and produced by Quincy Jones. \"Speed Demon\" is a pop song whose lyrics pertain to driving fast. The song was released on October 12, 1989, as a promotional single for both the album and the 1988 film Moonwalker. The song received mixed reviews from contemporary critics.\n\n\"Speed Demon\" was originally supposed to be released as a commercial single, but those plans were subsequently canceled. \"Speed Demon\" was the tenth, and last, single to be released from Bad. The song achieved minor commercial success, having only received minor airplay in the United States. Despite being featured on Bad, the song was not performed during either leg of the album's world tour.\n\"Speed Demon\" was written and co-produced by Michael Jackson, and produced by Quincy Jones. It appears on Jackson's album, Bad. Reportedly the song was originally planned to be released as an official single, but it was instead released as a promotion single. The song's lyrics are about driving fast. According to Jones, Jackson wrote the song after he received a traffic ticket, which caused him to arrive late to the recording studio. Jones told him to write about how he felt, which he did, thereby turning it into a song. Although \"Speed Demon\" was part of Jackson's Bad album, Jackson did not perform the song during his Bad World Tour, nor any of his other tours.\n\nThe song was remixed by electronic group Nero for the 25th anniversary of Bad.\nJackson filmed a promotional video for the song, which appeared in his 1988 film Moonwalker. The video was directed by Will Vinton. In the video, Jackson, in an attempt to avoid overzealous fans (even The Noid), disguises himself as a rabbit named Spike, but ends up taunting the fans into chasing him. During the chase, he morphs into other celebrities, including Sylvester Stallone, Tina Turner and Pee-Wee Herman. After finally losing the fans, he removes the costume, which comes to life and challenges him to a dance-off.\n\nIn the end, Clancy Brown tells Michael Jackson he is in a \"No Moonwalking Zone\", and Jackson turns to point to Spike, and the rabbit has already left. The policeman then sarcastically asks for his autograph (as opposed to \"signature\") on the ticket. Just as Jackson is preparing to leave, the rocky crag in front of him morphs into Spike's head, who then nods to him, leaving Jackson one-upped by his own alter-ego. Nonetheless, he seems happy enough as he leaves. Dennis Hunt of The Los Angeles Times commented that the clips for Bad (which were featured in the film as \"Badder\", with children recreating the original clip), \"Speed Demon\" and \"Leave Me Alone\", are \"slick, well-crafted and expensive-looking,\" but \"they're still just  music videos\". He felt that the videos were \"not even strung together in any particularly imaginative fashion\".\n\nIn 2010, the long version of the music video was released in the box set Michael Jackson's Vision and again in 2012 in the Target exclusive version DVD of Bad 25, along with eight other music videos, from the Bad era.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/uvpryy1374953749.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=l039y9FaIjc","strMusicVidDirector":"Will Vinton","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"2385030","intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"3","intLoved":"0","intScore":"6.5","intScoreVotes":"2","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"a74b328a-dff5-471b-95e0-805a4f14713e","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823007","idAlbum":"2118224","idArtist":"112424","idLyric":"333177","idIMVDB":"0","strTrack":"Liberian Girl","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"233533","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Liberian Girl\" was the ninth single to be released from Michael Jackson's 1987 album Bad. The song was written as early as 1983 and was among those considered for The Jacksons' Victory album. It was reworked and rewritten for Bad. The song was released as a single in Europe and Australia.\n\"Liberian Girl\" was written and composed by Michael Jackson. It was dedicated to Jackson's close friend, Elizabeth Taylor.\n\nThe song was the ninth single released from the Bad album in Europe and Australia, but not in the United States.\nThe New York Times editor Jon Pareles wrote that a melody line from Billie Jean reappears in this song. Rolling Stone's Davitt Sigerson praised the song: \"Liberian Girl\" — is Michael's filler, which makes it richer, sexier, better than Thriller's forgettables\" and he also described that it \"glistens with gratitude for the existence of a loved one.\"\nThe song received a positive reception in Liberia, with women from the country viewing the song as empowering. Liberian woman Margaret Carson said in an interview with the Washington Times \"When that music came out … the Liberian girls were so astonished to hear a great musician like Michael Jackson thinking about a little country in Africa. It gave us hope, especially when things went bad … . It make us to feel that we are still part of the world.\"","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/sptyww1374954759.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=f3V-7DEAgdc","strMusicVidDirector":"Jim Yukich","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"11293226","intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"4","intLoved":"0","intScore":"8","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"7750b3a2-b167-47db-ac21-ce7533c986f4","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823008","idAlbum":"2118224","idArtist":"112424","idLyric":"0","idIMVDB":"0","strTrack":"Just Good Friends","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"248306","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Just Good Friends\" is a song from Michael Jackson's 1987 album Bad. The song is one of two duets on the album, the other being \"I Just Can't Stop Loving You\". The song features Jackson and Stevie Wonder quarelling over a girl in a light, cheerful manner. \"Just Good Friends\" is the fifth track on Bad with a duration of 4:08. It and \"Speed Demon\" are the only two tracks from the album never to be released as singles.\n\n\"Just Good Friends\" is one of only two songs on Bad which were not written by Jackson himself, the other being \"Man in the Mirror\". The song was written and composed by the 80's song writing-partnership of Terry Britten and Graham Lyle.\n\"Just Good Friends\" was performed only once, on November 20, 1987, during a Bad World Tour concert. During the Australian leg of the tour, there was a surprise performance of the song during a concert at Sydney's Parramatta Stadium. The concert had a sell-out crowd of 45,000 people, and fans were shocked when Stevie Wonder made a surprise appearance during the show. He and Jackson then proceeded to perform \"Just Good Friends\" for the first and last time.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"www.youtube.com/watch?v=Y126PQnXl0g","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"483465","intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"5","intLoved":"0","intScore":"7","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"526c6bf4-7f21-4ea8-9f8d-0f06f0e8517a","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823009","idAlbum":"2118224","idArtist":"112424","idLyric":"333160","idIMVDB":"0","strTrack":"Another Part of Me","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"234826","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Another Part of Me\" is a song by American recording artist Michael Jackson. Produced by Quincy Jones (and co-produced by Jackson), it was released as the sixth single on July 11, 1988 for the singer's seventh solo album, Bad (1987). The song was originally featured in Jackson's 1986 3D film Captain EO. It is the sixth song on the album. The song also appeared as a dance attack and level song for the later revisions of Michael Jackson's Moonwalker video game (originally the first revision used excerpts of Thriller).\n\nAs with earlier songs in his career such as \"Can You Feel It\" and \"We Are the World\", the lyrics emphasize global unity, love and outreach.\n\nThe song was also featured in the trailer for Jackson's 1988 film Moonwalker.\n\nIn July 2009, a short part of the song has been used by singer Madonna as a tribute during the second leg of her Sticky & Sweet Tour. A Jackson impersonator performed his signature moves, while dancing to a medley of Jackson's songs.\n\nAccording to Quincy Jones in an interview that was featured in the 2001 special edition of Bad, Jackson wanted to include \"Streetwalker\" instead of \"Another Part of Me\" . But after Jackson's manager Frank DiLeo danced along to the song, it was decided that the song would be featured on the album. \"Streetwalker\" was later released on the 2001 special edition and the second disc of 25th anniversary re-issue.\nAn official video was released in 1988, directed by Patrick Kelly, featuring Jackson performing the song live during his Bad World Tour. The film footage was taken July 16 at Wembley Stadium with soundtrack mixed from live multitrack recording taken on the same day, with additional footage from June 27–28 show at Parc des Princes. It is featured on the DVD Michael Jackson's Vision and the Target version DVD of Bad 25.\n\"Another Part of Me\" was performed on the second leg of the Bad World Tour with an extra instrumental section added at the end which was only briefly heard at the end of the single. In the USA portion of the second leg, it was played at the same speed as the original but with some instruments altered. In the Europe portion of the second leg, it was played much more quickly than the original single. A live version of the song is available on the DVD Live at Wembley July 16, 1988. A snippet of the song was used for the \"This Is It\" concerts during the song \"Jam\", but the shows were cancelled, due to his sudden death.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/sxxwwu1374953991.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=8vwHQNQ88cM","strMusicVidDirector":"Patrick T. Kelly","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"5731192","intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"6","intLoved":"0","intScore":"8","intScoreVotes":"3","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"778e7766-3e46-4b4a-9313-00e260e76c3e","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823010","idAlbum":"2118224","idArtist":"112424","idLyric":"333128","idIMVDB":"0","strTrack":"Man in the Mirror","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"319600","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Man in the Mirror\" is a song made popular by Michael Jackson and written by Glen Ballard and Siedah Garrett. Jackson's recording was produced by Quincy Jones and co-produced by Jackson. It peaked at number 1 in the United States when released in January 1988 as the fourth single from his seventh solo album, Bad. It is one of Jackson's most critically acclaimed songs and it was nominated for Record of the Year at the Grammy Awards. The song topped the Billboard Hot 100 for 2 weeks. The song peaked at number 21 in the UK Singles Charts in 1988, but in 2009, following the news of Jackson's death, the song peaked at number 2, having re-entered the chart at 11 the previous week as his top song on the singles chart. It also became the number 1 single in iTunes downloads in the US and the UK, having sold over 1.3 million digital copies in the former alone.\n\"Man in the Mirror\" was composed by Glen Ballard and Siedah Garrett. Jackson added background vocals from Garrett, The Winans and the Andrae Crouch Choir, which gave the song its distinctive sound. The song is said to have been one of his favorite songs. Arranged with a gospel choir, Jackson would use a gospel choir again several years later on his hit \"Will You Be There\". Siedah Garrett also sang Jackson's duet \"I Just Can't Stop Loving You\" in summer 1987. The song is played in the key of G Major at a tempo of 100bpm. The vocal range is Ab3-C6.\nAllmusic editor Stephen Thomas Erlewine wrote that this song showcases Michael at his worst and highlighted it on studio album. When Ed Hogan reviewed the song, he called it \"gentle.\" Robert Christgau wrote: \"He's against burglary, speeding, and sex in favor of harmonic convergence and changing the world by changing the man in the mirror.\" Jon Pareles of The New York Times noted that this song has \"gospelly lift.\" Rolling Stone's Davitt Sigerson thought that \"Man in the Mirror\" stands among the half dozen best things Jackson has done, and he continued: \"On \"Man in the Mirror,\" a song he did not write, Jackson goes a step further and offers a straightforward homily of personal commitment: \"I'm starting with the man in the mirror/I'm asking him to change his ways/And no message could have been clearer/If you wanna make the world a better place/Take a look at yourself and then make a change.\"\nOne of the videos is a notable departure from Jackson's other videos mainly because Jackson himself does not appear in the video (aside from a brief clip toward the end of the video in which he can be seen donning a red jacket and standing in a large crowd). Instead, it featured a montage of footage from various major news events such as the nuclear explosion of Operation Crossroads, the Civil Rights March on Washington, John F. Kennedy and Robert Kennedy's assassinations, the Vietnam War, the Kent State shootings, the Iranian hostage crisis, Solidarity's birth and growth, Ethiopian famine, increases in U.S. homelessness, Live Aid, the first Farm Aid with Willie Nelson, Jessica McClure's rescue, Camp David Accords (with Anwar El Sadat, Menachem Begin and Jimmy Carter), INF Treaty signing (with Mikhail Gorbachev and Ronald Reagan), and other notable people including Martin Luther King, Lech Wałęsa, Mother Teresa, Desmond Tutu, Mahatma Gandhi, Rosa Parks, Nelson Mandela, Pieter Willem Botha, Muammar al-Gaddafi, the Ku Klux Klan, and Adolf Hitler.\n\nThe PCM Stereo music video version of this song was included on Number Ones, Michael Jackson's Vision, the Target version DVD of Bad 25, and the song's video that released on VHS in 1989.\n\nAn alternate live video was used as the opening song in Jackson's film Moonwalker with live audio and footage from several live performances of the song during the Bad World Tour.\n\"Man In The Mirror\" was the 4th consecutive number-one single for Jackson's Bad in the United States. The single debuted on the Billboard Hot 100 at number 48 on February 6, 1988, and reached number 1 by its 8th week on the chart, on March 26, 1988, where it remained for 2 weeks. It originally peaked at number 21 in the United Kingdom in 1988. However, following Jackson's death on June 25, 2009, \"Man in the Mirror\" re-entered the UK Singles Chart at number 11, and the following week the song peaked at number 2, held off by Cascada's \"Evacuate the Dancefloor\". The chart had also contained over 12 Michael Jackson songs in the Top 40. This song had been at top 100 for 15 consecutive weeks in this chart. In Australia the song originally charted at number 39. After the singer's death, the song re-entered the chart and peaked at number 8, much higher than its original release. It was also the top single in iTunes downloads in the US and the UK","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/trtpvy1486137040.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=PivWY9wn5ps","strMusicVidDirector":"Donald Wilson","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"29292097","intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"7","intLoved":"1","intScore":"9.3","intScoreVotes":"3","intTotalListeners":"573843","intTotalPlays":"3276548","strMusicBrainzID":"a52309e7-7471-43d7-876e-b198fa6c3a20","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823011","idAlbum":"2118224","idArtist":"112424","idLyric":"0","idIMVDB":"0","strTrack":"I Just Can't Stop Loving You","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"265106","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"I Just Can't Stop Loving You\" is a 1987 ballad by Michael Jackson featuring a duet with Siedah Garrett, and was the first single released from his seventh album, Bad. The song was written by Jackson, and co-produced by Jackson and Quincy Jones. It reached #1 on the Billboard Hot 100, R&B and adult contemporary charts.\n\nThe song became the first of five consecutive number-one Hot 100 singles from the Bad album. It was Jackson's second number-one song on the AC chart (his first, coincidentally, had also been a duet: 1982's \"The Girl Is Mine\" with Paul McCartney). It was released without an accompanying music video.\n\nThe presence of Garrett on the track was a last-minute decision by Jackson and Jones, after Jackson's first two choices for the duet, Barbra Streisand and Whitney Houston, both decided against participating. Garrett, a protégé of Jones's who co-wrote another song on Bad, \"Man in the Mirror\", did not know that she would be singing the song until the day of the recording session. It became her first hit since Dennis Edwards' 1984 song \"Don't Look Any Further\".\n\nJackson and Garrett later recorded \"Todo Mi Amor Eres Tú\", a Spanish-language version of the song, with lyrics translated by Rubén Blades, and \"Je Ne Veux Pas La Fin De Nous\", a French-language version, with translation by Christine \"Coco\" Decroix. All three versions are featured on the 2012 reissue album Bad 25. The original English-language version was re-released as a single in 2012, as part of the Bad 25 release.\n\nOriginally, the song featured a spoken intro by Jackson backed with a longer version of the opening music. This intro was mixed out on the single, on future releases of Bad and on most compilation albums.\nFor the duet ballad \"I Just Can't Stop Loving You,\" Michael Jackson wanted to share vocals with Barbra Streisand or Whitney Houston. Both singers took a pass on the invitation. The co-duet duties were given to Siedah Garrett who had previously dueted on former Temptations member Dennis Edwards' \"Don't Look Any Further.\" Garrett first came to the attention of producer Quincy Jones after auditioning for and winning a spot in the group Deco. She later signed as a recording artist with Jones' Warner Bros. Domestic Television Distribution. The singer was constantly sent song demos including one for \"I Just Can't Stop Loving You,\" though she didn't know that the demo was a song written and sung by Jackson. While reporting for a recording session, Garrett thought that she was summoned to do overdubs for a song she'd co-written titled \"Man in the Mirror.\" Instead she was surprised to learn that she'd been chosen to sing a duet with Jackson. To some, the wispy ballad was reminiscent of Jackson's Motown classic \"Got to Be There.\"\n\nThe album version opens with Jackson cooing a tremulous spoken intro that goes, in part, \"I just want to lay next to you for awhile . You look so beautiful tonight... A lot of people misunderstand me. That's because they don't know me at all. I just want to touch you and hold you...\"\n\"I Just Can't Stop Loving You\" was the lead single from Jackson's much-anticipated Bad album. The single debuted on the U.S. Billboard Hot 100 singles chart at #37, the week of August 8, 1987. The single was the highest debuting single of 1987, and quickly traveled to the top quarter of the Hot 100, advancing to #16 in its second week, and soaring to #1 in its seventh week on the tally, the week of September 19, 1987.\n\nHowever, due to the album title track's quick release as a single (it debuted on the Hot 100 at #40 in the same week that \"I Just Can't Stop Loving You\" hit number one), the duet had a relatively short chart run and fell out of the top 40 just five weeks after topping the chart, spending a total of 11 weeks in the top 40. Billboard ranked it as #43 on the year-end Hot 100 chart for 1987.\n\nThe track spent three weeks at number one on Billboard's Adult Contemporary singles chart, becoming only the second Michael Jackson single to top that chart and the last one to date (although \"Man in the Mirror\" would come close to topping the chart when it reached #2 in 1988). In the United Kingdom, the song reached #1 on the UK Singles Chart for the week of August 11, 1987 and ranked #30 on the year-end UK tally.\n\nIn his autobiography, Moonwalk, Jackson stated the song was not written with someone in mind, but that he had been thinking of someone when singing the song live.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=Tai2j3dVSUQ","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"8993941","intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"8","intLoved":"0","intScore":"9","intScoreVotes":"2","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"c548b560-1105-483f-b8ad-de4a3eef8a9a","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823012","idAlbum":"2118224","idArtist":"112424","idLyric":"333255","idIMVDB":"0","strTrack":"Dirty Diana","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"292600","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Dirty Diana\" is a song by American singer Michael Jackson featuring guitarist Steve Stevens. It is the ninth track from Jackson's seventh studio album, Bad. The song was released by Epic Records on April 18, 1988 as the fifth single from the album. The song presented a harder rock sound similar to that of \"Beat It\" from the album Thriller. \"Dirty Diana\" was written and co-produced by Jackson, and produced by Quincy Jones. The songs lyrics pertain to groupies. \"Dirty Diana\" has a moderate tempo and is played in the key of Bb major.\n\n\"Dirty Diana\" received mixed reviews from contemporary music critics, with some criticizing the lyrics, while others found the song better than \"Thriller '​s forgettables\". The song was a commercial success worldwide in 1988, charting at number one on the United States Billboard Hot 100. The song also charted within the top ten in multiple countries, including the United Kingdom, France, Italy and New Zealand. \"Dirty Diana\" was the fifth and final Hot 100 number-one single from Bad. In 2009, after Jackson's death in June, the song re-entered charts, mainly due to digital download sales. A music video for \"Dirty Diana\" was filmed in front of a live audience and was released in 1988.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/qxwytu1374954294.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=yUi_S6YWjZw","strMusicVidDirector":"Joe Pytka","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"13206279","intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"9","intLoved":"0","intScore":"9.5","intScoreVotes":"2","intTotalListeners":"437581","intTotalPlays":"2410870","strMusicBrainzID":"83e75337-7320-496c-b221-1f81d7b5ee24","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823013","idAlbum":"2118224","idArtist":"112424","idLyric":"333181","idIMVDB":"2147483647","strTrack":"Smooth Criminal","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"258826","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Smooth Criminal\" is the seventh single from Michael Jackson's 1987 Bad album. The song contains a fast-paced beat intertwined with Jackson's lyrics about a woman named Annie, who has been attacked in her apartment by a \"smooth\" assailant. It was released as a single on October 21, 1988, and peaked at number seven on the Billboard Hot 100. It was re-released on April 10, 2006, as a part of the Visionary: The Video Singles box-set. The re-released Visionary single charted at number 19 in the UK. The piece is one of Jackson's signature songs, and has appeared on numerous greatest hits albums, including Number Ones, The Essential Michael Jackson, Michael Jackson: The Ultimate Collection, King of Pop, This Is It, and Immortal (for the New version of song).\n\nThe song also serves as the theme song to Jackson's 1988 film Moonwalker. The single has sold over 7.5 million copies.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/yqtvsv1359695999.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=h_D3VFfhvs4","strMusicVidDirector":"Colin Chilvers","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"11263993","intMusicVidLikes":"63991","intMusicVidDislikes":"1670","intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"10","intLoved":"4","intScore":"9","intScoreVotes":"10","intTotalListeners":"619574","intTotalPlays":"3998234","strMusicBrainzID":"774e840c-164b-434c-8f2e-359eab5b050d","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823014","idAlbum":"2118224","idArtist":"112424","idLyric":"333176","idIMVDB":"0","strTrack":"Leave Me Alone","strAlbum":"Bad","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"279440","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Leave Me Alone\" is a single by American singer Michael Jackson. The song was featured on Jackson's seventh studio album, Bad in 1987, and was as the eighth single from the album in February 1989, but was released outside of the United States and Canada. \"Leave Me Alone\" was recorded during the original album sessions but the song only appeared on the CD editions of Bad as a bonus track, as well as on the 2001 cassette edition. The song was written and composed by Jackson and produced by Quincy Jones (with Jackson serving as co-producer).\n\nInternationally, the song was a success, peaking at number one and two in Ireland and the United Kingdom respectively and reaching the top 10 in Belgium, New Zealand and Spain. \"Leave Me Alone\" was generally well received by contemporary music critics. A short film was released for the song. In the film, Jackson pokes fun at the false rumors about him such as the stories about him purchasing the bones of \"The Elephant Man\" and his cosmetic surgeries. The short film was the recipient of a Grammy Award in 1990 for Best Short Form Music Video. Despite the success of the single, the song never appeared on any of Jackson's world concert tours.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/srrrru1374954497.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=crbFmpezO4A","strMusicVidDirector":"Jim Blashfield","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"13363577","intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"11","intLoved":"1","intScore":"7.66667","intScoreVotes":"3","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"9c6551a7-de65-46f3-b433-30c80286ad27","strMusicBrainzAlbumID":"a5711a77-42d1-3f4c-830c-e27a96f0800f","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"}]}