{"track":[{"idTrack":"32822995","idAlbum":"2118223","idArtist":"112424","idLyric":"0","idIMVDB":"0","strTrack":"Wanna Be Startin' Somethin'","strAlbum":"Thriller","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"362000","strGenre":"Pop","strMood":"Quirky","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Wanna Be Startin' Somethin'\" is a song by American recording artist Michael Jackson. Released on May 8, 1983, by Epic Records, \"Wanna Be Startin' Somethin'\" was the fourth single from Jackson's sixth studio album Thriller (1982). The opening track of the album, it was written, composed and co-produced by Jackson, and was produced by Quincy Jones.\n\nThe song's lyrics pertain to strangers spreading rumors to start an argument for no good reason. Musically, \"Wanna Be Startin' Somethin'\" evokes the disco sound of Jackson's previous studio album, Off the Wall, released in 1979. The song is characterized by a complex rhythm arrangement and a distinctive horn arrangement. \"Wanna Be Startin' Somethin'\" has been covered and sampled by multiple recording artists since its release. Aside from Thriller, the song appears on multiple compilation and greatest hits albums by Jackson.\n\n\"Wanna Be Startin' Somethin'\" was generally well received by contemporary music critics. The song was also commercially successful, charting within the top 20 and top 30 in several countries. It became Jackson's fifth consecutive top 10 single in the United States on the Billboard Hot 100, peaking at number five, and later re-entered charts in 2008 after the release of Thriller 25. Following Jackson's death in June 2009, the song re-entered music charts worldwide, mainly due to digital download sales. Unlike previous singles from Thriller, \"Wanna Be Startin' Somethin'\" did not have a music video to accompany it, but was performed by Jackson on world concert tours, as both a member of The Jacksons and as a solo artist.\n\nAs part of the release of Thriller 25, a remix of \"Wanna Be Startin' Somethin'\", entitled \"Wanna Be Startin' Somethin' 2008 with Akon\", was recorded with Akon, and released as the second single from the album. The song was commercially successful, mainly charting within the top 10 in six countries, as well as the top 20 in several territories worldwide and top 40 in Canada. The song was more successful internationally than in the United States, having peaked on the Billboard Hot 100 at number 81, which was the song's lowest charting position.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"1","intLoved":"1","intScore":"7.66667","intScoreVotes":"3","intTotalListeners":"495340","intTotalPlays":"2253199","strMusicBrainzID":"211fad1e-c313-413f-94bb-7ae64ce3014a","strMusicBrainzAlbumID":"f32fab67-77dd-3937-addc-9062e28e4c37","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32822996","idAlbum":"2118223","idArtist":"112424","idLyric":"333161","idIMVDB":null,"strTrack":"Baby Be Mine","strAlbum":"Thriller","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"259000","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"2","intLoved":"0","intScore":"6","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"2423b232-8284-4afb-8633-741cd7d01744","strMusicBrainzAlbumID":"f32fab67-77dd-3937-addc-9062e28e4c37","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32822997","idAlbum":"2118223","idArtist":"112424","idLyric":"333137","idIMVDB":"0","strTrack":"The Girl Is Mine","strAlbum":"Thriller","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"221000","strGenre":"Pop","strMood":"Quirky","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"The Girl Is Mine\" is a song recorded by Michael Jackson and Paul McCartney. The track was written by Jackson and produced by Jackson and Quincy Jones. It was released as the first single for Jackson's sixth solo album, Thriller (1982). The song was recorded at Westlake Studios, Los Angeles, from April 14 to 16, 1982. The year before, Jackson and McCartney had recorded \"Say Say Say\" and \"The Man\" for the latter's fifth solo album, Pipes of Peace (1983). Although it was released as a single, Jackson never performed the song live.\n\n\"The Girl Is Mine\" achieved success in the music charts. Aside from topping the R&B singles chart, the single peaked at number two on the Billboard Hot 100 and number eight in the UK. By 1985, it had sold 1.3 million copies, and was eventually certified platinum by the Recording Industry Association of America, for shipments of at least one million units. Despite the song's success, it received generally mixed reviews from critics who consider it to be the weakest song on Thriller.\n\n\"The Girl Is Mine\" has been the subject of two plagiarism lawsuits, the first in 1984 and the latter in 1993. Both instances required Jackson to testify in court, and each lawsuit found in the favour of the singer and his record label.\n\nIn 2008, for the 25th anniversary edition of Thriller, Black Eyed Peas singer will.i.am remixed \"The Girl Is Mine\". The remix received generally unfavourable reviews from music critics.\n\nThe writing of \"The Girl Is Mine\" was completed by Jackson as he watched cartoons with Paul McCartney. Producer Quincy Jones had initially told Jackson to write a song about two men fighting over a girl. Inspired, Jackson awoke during the night and sang the song into a tape recorder. He later said, \"I sang exactly what I heard in my head, starting with the melody and the keyboard and the strings and everything. So, I just orally put it all on tape.\" Jones also asked Jackson to add a rap verse. The song was then recorded by Jackson and McCartney at Westlake Studios, Los Angeles, from April 14 to 16, 1982. The year before, the duo had recorded \"Say Say Say\" and \"The Man\" for McCartney's fifth solo album, Pipes of Peace (1983).\n\nJackson said that the recording of \"The Girl Is Mine\" was one of his most enjoyable moments in the studio. He stated, \"One of my favourite songs to record, of all my recordings as a solo artist, is probably \"The Girl Is Mine\", because working with Paul McCartney was pretty exciting and we just literally had fun. It was like lots of kibitzing and playing, and throwing stuff at each other, and making jokes. We actually recorded the (instrumental) track and the vocals pretty much live at the same time, and we do have footage of it, but it's never been shown.\" He concluded, \"Maybe one day we'll give you a sneak preview of it.\" The footage of the pair was later shown at The Paul McCartney World Tour.\n\nMany members of the band Toto participated in the recording of this song, including David Paich (piano), Jeff Porcaro (drums), Steve Lukather (guitars) and Steve Porcaro (synthesizers).\n\nThe musical structuring of \"The Girl Is Mine\" uses the AABA form, in which the song's title serves as the main source of needed repetition. When used to the maximum, this structuring, also known as the thirty-two-bar form, has the title repeat itself in the same place, in at least two of the three A verses. Author Sheila Davis' book, The Craft of Lyric Writing, notes that \"the repeated title line simultaneously outlines the framework of the design and drives home the main point of the lyric\". Jackson's \"She's Out of My Life\" also uses this musical structuring, as does \"Body and Soul\", \"Oh, Lady Be Good!\" and \"Try a Little Tenderness\". The musical chords in \"The Girl Is Mine\" are seen in several songs written by Jackson. \"That's What You Get for Being Polite\", from The Jacksons' Destiny album, and two unreleased songs (\"Why Can't I Be\" and \"Thank You for Life\") used the chords before \"The Girl Is Mine\".","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"3","intLoved":"0","intScore":"8","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"434a19ae-d70f-4337-996f-951100018633","strMusicBrainzAlbumID":"f32fab67-77dd-3937-addc-9062e28e4c37","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32822998","idAlbum":"2118223","idArtist":"112424","idLyric":"333141","idIMVDB":null,"strTrack":"Thriller","strAlbum":"Thriller","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"357000","strGenre":"Pop","strMood":"Quirky","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Thriller\" is a song recorded by American recording artist Michael Jackson, composed by Rod Temperton, and produced by Quincy Jones. It is the seventh and final single from his sixth studio album of the same name. It was released on November 12, 1983 in most countries and January 23, 1984 in the United States by Epic Records. The song has appeared on multiple greatest hits compilation albums from Jackson, including HIStory (1995), Number Ones (2003), The Essential Michael Jackson (2005), and Michael Jackson's This Is It (2009) and it was remixed to the Immortal album in 2011. The song, which has a voice-over from actor Vincent Price had originally been titled \"Starlight\".\n\nThe song's instruments include a bassline and synthesizer. In the song, sound effects such as a creaking door, thunder, feet walking on wooden planks, winds and howling dogs can be heard, and the lyrics contain frightening themes and elements. \"Thriller\" received positive reviews from critics, though the song was outshone by its music video. \"Thriller\" became Jackson's seventh top-ten single on the Billboard Hot 100 Chart from the album, while reaching the top of the charts in France and Belgium and the top ten in other countries.\n\n\"Thriller\" was adapted into a highly successful music video, directed by John Landis and known independently as Michael Jackson's Thriller. At fourteen minutes the video is substantially longer than the song, which ties together a narrative featuring Jackson and actress Ola Ray in a setting heavily inspired by horror films of the 1950s. In the video's most iconic scene, Jackson leads other actors costumed as zombies in a choreographed dance routine. Though it garnered some criticism for its occult theme and violent imagery, the video was immediately popular and received high critical acclaim, being nominated for six MTV Video Music Awards in 1984 and winning three. In 2009 it was added to the National Film Registry by the Library of Congress, the first music video ever selected.\n\n\"Thriller\" has been covered by multiple recording artists since its release in 1984, including Henry Mancini (with The Royal Philharmonic Orchestra), Ian Brown, Ten Masked Men and Imogen Heap.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/quxqqw1376487887.jpg","strTrack3DCase":null,"strTrackLyrics":"It's close to midnight and something evil's lurking in the dark\nUnder the moonlight you see a sight that almost stops your heart\nYou try to scream but terror takes the sound before you make it\nYou start to freeze as horror looks you right between the eyes,\nYou're paralyzed\n\n'Cause this is thriller, thriller night\nAnd no one's gonna save you from the beast about to strike\nYou know it's thriller, thriller night\nYou're fighting for your life inside a killer, thriller tonight\n\nYou hear the door slam and realize there's nowhere left to run\nYou feel the cold hand and wonder if you'll ever see the sun\nYou close your eyes and hope that this is just imagination\nGirl, But all the while you hear a creature creepin' up behind\nYou're out of time\n\n'Cause this is thriller, thriller night\nThere ain't no second chance against the thing with forty eyes, girl\nYou know it's thriller, thriller night\nYou're fighting for your life inside a killer, thriller tonight\n\nNight creatures call\nAnd the dead start to walk in their masquerade\nThere's no escapin' the jaws of the alien this time (they're open wide)\nThis is the end of your life\n\nThey're out to get you, there's demons closing in on every side\nThey will possess you unless you change that number on your dial\nNow is the time for you and I to cuddle close together, yeah\nAll through the night I'll save you from the terror on the screen,\nI'll make you see\n\nThat this is thriller, thriller night\n'Cause I can thrill you more than any ghost would dare to try\nGirl, this is thriller, thriller night\nSo let me hold you tight and share a killer, diller, chiller,\nThriller here tonight\n\nDarkness falls across the land\nThe midnight hour is close at hand\nCreatures crawl in search of blood\nTo terrorize your neighborhood\nAnd whosoever shall be found\nWithout the soul for getting down\nMust stand and face the hounds of hell\nAnd rot inside a corpse's shell\n\nI'm gonna thrill you tonight\n(Thriller, thriller)\nI'm gonna thrill you tonight\n(Thriller night, thriller)\nI'm gonna thrill you tonight\nOoh, babe, I'm gonna thrill you tonight\nThriller night, babe\n\nThe foulest stench is in the air\nThe funk of forty thousand years\nAnd grizzly ghouls from every tomb\nAre closing in to seal your doom\nAnd though you fight to stay alive\nYour body starts to shiver\nFor no mere mortal can resist\nThe evil of the thriller\n","strMusicVid":"http://www.youtube.com/watch?v=sOnqjkJTMaA","strMusicVidDirector":"John Landis","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"678384845","intMusicVidLikes":"4207305","intMusicVidDislikes":"241327","intMusicVidFavorites":"0","intMusicVidComments":"355181","intTrackNumber":"4","intLoved":"1","intScore":"9.57143","intScoreVotes":"7","intTotalListeners":"1083228","intTotalPlays":"5488361","strMusicBrainzID":"65bff453-6ada-4bf4-afd1-d8d9e5b2a761","strMusicBrainzAlbumID":"f32fab67-77dd-3937-addc-9062e28e4c37","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32822999","idAlbum":"2118223","idArtist":"112424","idLyric":"333116","idIMVDB":"0","strTrack":"Beat It","strAlbum":"Thriller","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"258000","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Beat It\" is a song written and performed by American recording artist Michael Jackson and produced by Quincy Jones (with co-production by Jackson). It is the third single from the singer's sixth solo album, Thriller (1982). Eddie Van Halen played the song's distinctive overdriven guitar solo, but was prevented by his record label from appearing in the music video. He did appear on stage with Jackson in Dallas during the Jackson brothers \"Victory Tour.\" Following the successful chart performances of the Thriller singles \"The Girl Is Mine\" and \"Billie Jean\", \"Beat It\" was released on February 3, 1983 as the album's third single. The song was promoted with a short film that featured Jackson bringing two gangs together through the power of music and dance. It is one of the artist's most recognizable signature songs, and a favorite of many Jackson fans worldwide.\n\n\"Beat It\" received the Grammy Awards for Record of the Year and Best Male Rock Vocal Performance, as well as two American Music Awards. It was inducted into the Music Video Producers Hall of Fame. \"Beat It\" (along with the song's music video) propelled Thriller into becoming the best-selling album of all time. The single was certified platinum in the United States in 1989. Rolling Stone placed \"Beat It\" on the 344th spot of its list of \"The 500 Greatest Songs of All Time\". \"Beat It\" was also ranked number 81 on Rolling Stone '​s \"100 Greatest Guitar Songs of All Time\".\n\nIn the decades since its release, \"Beat It\" has been covered, parodied, and sampled by numerous artists including Pierce the Veil, Fall Out Boy, Pomplamoose, Justin Bieber, Alvin and the Chipmunks, Fergie, John 5, \"Weird Al\" Yankovic, and Eminem. The song was also featured in the National Highway Safety Commission's anti-drunk driving campaign.\n\"Beat It\" was composed by Michael Jackson for his Thriller album. Producer Quincy Jones had wanted to include a rock 'n' roll song in the vein of the Knack's \"My Sharona\", though Jackson reportedly had never previously shown an interest in the genre. Jackson later said of \"Beat It\", \"I wanted to write a song, the type of song that I would buy if I were to buy a rock song... That is how I approached it and I wanted the children to really enjoy it—the school children as well as the college students.\" Upon hearing the first recorded vocals, Jones stated that it was exactly what he was looking for. The song begins with seven distinct synthesizer notes played on the Synclavier digital synthesizer. While Tom Bahler is credited with Synclavier performance on the song, the intro is taken note for note from a demo LP released the year before, called \"The Incredible Sounds of Synclavier II\" first published in 1981 by Denny Jaeger Creative Services, Inc and sold by New England Digital, makers of the Synclavier.\n\nEddie Van Halen, lead guitarist of hard rock band Van Halen, was asked to add a guitar solo. When initially contacted by Jones, Van Halen thought he was receiving a prank call. Having established that the call was genuine, Van Halen recorded his guitar solo free of any charge. \"I did it as a favor\", the musician later said. \"I was a complete fool, according to the rest of the band, our manager and everyone else. I was not used. I knew what I was doing – I don't do something unless I want to do it.\" Van Halen recorded his contribution following Jones and Jackson arriving at the guitarist's house with a \"skeleton version\" of the song. Fellow guitarist Steve Lukather recalled, \"Initially, we rocked it out as Eddie had played a good solo—but Quincy thought it was too tough. So I had to reduce the distorted guitar sound and that is what was released.\" The song was among the last four completed for Thriller; the others were \"Human Nature\", \"P.Y.T. (Pretty Young Thing)\" and \"The Lady in My Life\".\n\nOn the record, right before Van Halen's guitar solo begins, a noise is heard that sounds like somebody knocking at a door. It is reported that the knock was a person walking into Eddie's recording studio. Another story has claimed that the sound was simply the musician knocking on his own guitar. The sound, however, is that of Jackson knocking on a drum case, as he is credited in the album's liner notes. The lyrics of \"Beat It\" are about defeat and courage, and have been described as a \"sad commentary on human nature\". The line \"don't be a macho man\" is said to express Jackson's dislike of violence, whilst also referring to the childhood abuse he faced at the hands of his father Joseph. The song is played in the key of D-sharp minor at a moderately fast tempo of 139 beats per minute, making it one of Jackson's fastest songs. In the song, Jackson's vocal range is A♯3 to C♯5.\n\nDrums on the song were played by Toto co-founder Jeff Porcaro.\n\nA remix of \"2 Bad\", is featured on Blood on the Dance Floor: HIStory in the Mix containing a sample of \"Beat It\" as well as a rap by John Forté and guitar solo by Wyclef Jean.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/qqxwpt1418298803.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=oRdxUFDoQe0","strMusicVidDirector":"Bob Giraldi","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"108365347","intMusicVidLikes":"355798","intMusicVidDislikes":"15273","intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"5","intLoved":"2","intScore":"9.625","intScoreVotes":"8","intTotalListeners":"962368","intTotalPlays":"5628848","strMusicBrainzID":"4fba8ed1-5ac1-4cf9-94fa-cc0f53cb4d6a","strMusicBrainzAlbumID":"f32fab67-77dd-3937-addc-9062e28e4c37","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823000","idAlbum":"2118223","idArtist":"112424","idLyric":"333117","idIMVDB":"2147483647","strTrack":"Billie Jean","strAlbum":"Thriller","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"293000","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Billie Jean\" is a song by American recording artist Michael Jackson. It is the second single from the singer's sixth solo album, Thriller (1982). It was written and composed by Jackson and produced by him and Quincy Jones. There are contradictory claims to what the song's lyrics refer to. One suggests that they are derived from a real-life experience, in which a female fan claimed that Jackson (or one of his brothers) had fathered one of her twins. However, Jackson himself stated that \"Billie Jean\" was based on groupies he had encountered. The song is well known for its distinctive bassline by guitarist David Williams, and Jackson's vocal hiccups. The song was mixed 91 times by audio engineer Bruce Swedien before it was finalized.\n\nThe song became a worldwide commercial and critical success; it was one of the best-selling singles of 1983 and is one of the best-selling singles worldwide. The song topped both the US and UK charts simultaneously. In other countries, it topped the charts of Switzerland and reached the top ten in Austria, Italy, New Zealand, Norway and Sweden. \"Billie Jean\" was certified platinum by the Recording Industry Association of America (RIAA) in 1989. Rolling Stone magazine placed the song in the 58th spot on its list of The 500 Greatest Songs of All Time.\n\nAwarded numerous honors—including two Grammy Awards, one American Music Award, and an induction into the Music Video Producers Hall of Fame—the song and corresponding music video propelled Thriller to the status of best-selling album of all time. The song was promoted with a short film that broke down MTV's racial barrier as the first video by a black artist to be aired in heavy rotation. Also, Jackson's Emmy-nominated performance on Motown 25: Yesterday, Today, Forever, in which Jackson premiered his \"moonwalk\" also helped to popularize the song. It was also promoted through Jackson's Pepsi commercials; during the filming of one commercial, Jackson's scalp was severely burned. Covered by modern artists, \"Billie Jean\" sealed Jackson's status as an international pop icon.\nJackson stated several times that \"Billie Jean\" was based on the groupies he and his brothers encountered while part of The Jackson 5. \"Billie Jean is kind of anonymous. It represents a lot of girls. They used to call them groupies in the '60s.\" He added: \"They would hang around backstage doors, and any band that would come to town they would have a relationship with, and I think I wrote this out of experience with my brothers when I was little. There were a lot of Billie Jeans out there. Every girl claimed that their son was related to one of my brothers.\"\n\nJackson biographer J. Randy Taraborrelli promoted the theory that \"Billie Jean\" was derived from a real life experience the singer faced in 1981. The Magic & The Madness documents how a young woman wrote Jackson a letter, which informed the singer that he was the father of one of her twins. Jackson, who regularly received letters of this kind, had never met the woman in question and ignored it. The woman, however, continued to send Jackson more letters, which stated that she loved him and wanted to be with him. She wrote of how happy they would be if they raised the child together. She pondered how Jackson could ignore his own flesh and blood. The letters disturbed the singer to the extent that he suffered nightmares.\n\nFollowing the letters, Jackson received a parcel containing a photograph of the fan, as well as a letter and a gun. Jackson was horrified; the letter asked that the pop singer kill himself on a certain day and at a specific time. The fan would do the same once she had killed their baby. She wrote that if they could not be together in this life, then they would be in the next. To his mother's dismay, Jackson had the photograph of the woman framed and hung above the dining room table of their family home. Afterwards, the Jacksons discovered that the fan had been sent to a psychiatric hospital.\nMichael Jackson wrote \"Billie Jean\" with his female fans in mind, and later stated that when he wrote the song, he knew it would be a success: \"A musician knows hit material. Everything has to feel in place. It fulfills you and it makes you feel good. That's how I felt about 'Billie Jean'. I knew it was going to be big when I was writing it.\" The singer explained that he was so absorbed by the song that, in one instance, he did not notice that his car had caught fire as he drove down a freeway with a friend until a passing motorcyclist informed him. Jackson noted: \"The kid probably saved our lives.\"\n\nJackson faced numerous disagreements with the song's co-producer. It has been reported that Quincy Jones did not want the song to appear on Thriller and that he felt that the song was too weak to be part of the collection, but Jones has stated this is a false rumor. The producer disliked the demo and did not care for the song's bassline. Jones wanted to cut Jackson's 29-second introduction, which was the longest one ever created at the time. The entertainer, however, insisted that it be kept. \"I said, 'Michael we've got to cut that intro'\" Jones later recalled. \"He said: 'But that's the jelly!''That's what makes me want to dance'. And when Michael Jackson tells you, 'That's what makes me want to dance', well, the rest of us just have to shut up.\" Jones also wanted to change the track's title to \"Not My Lover\", as he believed that people would think the song referred to the tennis player Billie Jean King. Jackson refused to change the title and asked Jones to give him co-producing credits for the track, as he felt that the demo tape sounded exactly like the finished product. In addition, Jackson wanted extra royalties. Jones granted neither and the two fell out for several days.\n\nHaving resolved their differences, Jones had Jackson sing his vocal overdubs through a six-foot-long cardboard tube. Jackson's entire lead vocal was performed in one take; he had received vocal training every morning throughout the production of the song. Jazz saxophonist Tom Scott played the lyricon. Bass guitarist Louis Johnson was then brought in and he played his part on every guitar he owned, before Jackson finally settled for a Yamaha bass. Greg Phillinganes was also drafted in and he played the keyboard. He later said of the song, \"'Billie Jean' is hot on every level. It's (sic) hot rhythmically moving action got Michael excited. It's hot sonically, because the instrumentation is so minimal, you can really hear everything. It's hot melodically  lyrically  vocally. It affects you physically, emotionally, even spiritually.\"\n\nThe song was mixed by Bruce Swedien ninety-one times — unusual for Swedien, who usually mixed a song just once. Jones had told Swedien to create a drum sound that no one had ever heard before. The audio engineer was also told to add a different element: \"sonic personality\". \"What I ended up doing was building a drum platform and designing some special little things, like a bass drum cover and a flat piece of wood that goes between the snare and the hi-hat\" Swedien later wrote. \"The bottom line is that there aren't many pieces of music where you can hear the first three or four notes of the drums, and immediately tell what the piece of music is.\" He concluded, \"But I think that is the case with 'Billie Jean' — and that I attribute to sonic personality.\"\n\"Billie Jean\" blends elements of post-disco, rhythm and blues, funk, and dance-pop. The song opens with a standard drum beat along with a standard hi-hat, and it contains hardly any reverberation. After two bars, another standard open hi-hat enters. After two more bars, a repetitive bassline enters. Each time it passes through the tonic, the note is doubled by a distorted synth bass. This accompaniment is followed by a repetitive three-note synth, played staccato with a deep reverb. The defining chord progression is then established. Jackson's quiet vocals enter, accompanied by a finger-snap, which comes and goes during the verses, as the rhythm and chord progression repeats.\n\nAccording to Daryl Hall, when Jackson was recording “We Are the World,” Jackson approached him and admitted to lifting the bassline for \"Billie Jean\" from a Hall & Oates song (apparently referring to Hall's \"I Can't Go for That (No Can Do)\" from the 1981 album Private Eyes): \"Michael Jackson once said directly to me that he hoped I didn't mind that he copied that groove.\" Hall says he told Jackson that he had lifted the bassline himself, remarking, \"it's something we all do.\"\n\nAccording to Inside the Hits, the lyrics refer to the commotion created by Billie Jean on a dance floor. She entices the crowd with a seductive come-on before luring Jackson to her bedroom, through the fragrance of her perfume. Jackson's vocal range spanned from a high baritone to a falsetto and he usually wrote melodies to show this range. However, in the verses of \"Billie Jean\", the singer's vocals range from a tenor to a low falsetto. A four note falsetto is showcased in the chorus and, during the last line, Jackson peaks at a full octave. The song has a tempo of 117 beats per minute and is in the key of F-sharp minor. Following the first chorus, a cello-like synth eases in at the beginnings of both the third, and later, the fourth, verses. Upon the announcement that the baby's eyes resemble Jackson's, a voice laments, \"oh no\". This is met with Jackson's signature falsetto \"hee hee\". The bridge debuts the strings, and holds a pedal tone tonic with the exception of two lines and a chord leading into the chorus. Violins are then played, followed by a four-note minor guitar solo. During the solo, vocal shouts, screams and laughs are added. Throughout this, the chord progression remains unaltered and is laced with Jackson's vocal hiccups. All the musical and vocal elements are then brought together in the final chorus. In the fade, Jackson repeats the denial of fathering Billie Jean's child.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/tqqsur1418298940.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=Zi_XLOBDo_Y","strMusicVidDirector":"Steve Barron","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"128634833","intMusicVidLikes":"321232","intMusicVidDislikes":"10269","intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"6","intLoved":"5","intScore":"8.23077","intScoreVotes":"13","intTotalListeners":"1266742","intTotalPlays":"7692829","strMusicBrainzID":"cb052235-5107-4988-ac2f-10404025c663","strMusicBrainzAlbumID":"f32fab67-77dd-3937-addc-9062e28e4c37","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823001","idAlbum":"2118223","idArtist":"112424","idLyric":"0","idIMVDB":"0","strTrack":"Human Nature (album version)","strAlbum":"Thriller","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"245000","strGenre":"Pop","strMood":"Quirky","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Human Nature\" is a song performed by American recording artist Michael Jackson released on his solo album, Thriller (1982). The lyrics describe a passer-by in New York City. It was written and composed by Steve Porcaro and John Bettis, and produced by Quincy Jones. It is the fifth single from Jackson's sixth solo album, Thriller (1982). Initially, Porcaro recorded a rough demo of the song on a cassette, which was then given to Jones, who brought in Bettis to finish the lyrics. The song was the last selected for the album, removing \"Carousel\" from the final track listing.\n\n\"Human Nature\" was released on July 3, 1983, as the album's fifth single. Although not released in the UK, the song became Jackson's fifth top 10 hit from Thriller in the US, reaching number two on Billboard's Hot Adult Contemporary chart and number seven on the Hot 100. In Canada and the Netherlands the single reached number 11.\n\nThe song garnered positive reviews from music critics. \"Human Nature\" has been covered and sampled by numerous artists, including Stevie Wonder, Vijay Iyer, John Mayer, Miles Davis, SWV, ELEW, Nas, 2Cellos, Jason Nevins, Danny Chan, David Mead and Chris Brown.\n\n\"Human Nature\" was written and composed by Steve Porcaro of Toto and John Bettis for Michael Jackson's Thriller album. Initially, Porcaro recorded a rough demo of the song on a cassette. He had written the song after his first-grade daughter came home crying because a boy pushed her off the slide. He blurted out three reasons for the incident to comfort her: one, the boy liked her, two, people can be strange and three, it's human nature. Fellow Toto band member David Paich gave the demo, along with two songs written by Paich, to producer Quincy Jones, hoping they would be included on Thriller. Jones did not think Paich's songs were right for the album, but enjoyed the rough demo of \"Human Nature\" at the end of the cassette. Jones explained, \"All of a sudden, at the end, there was all this silence, there was: 'why, why, dah dah da-dum dah dah, why, why'. Just a dummy lyric and a very skeletal thing—I get goosebumps talking about it. I said, 'This is where we wanna go, because it's got such a wonderful flavor'\". However, Jones was dissatisfied with the original lyrics and so Bettis, who had written lyrics for hits by The Carpenters and The Pointer Sisters, among others, was asked to add lyrics to the song. He completed the song in two days. The producer asked if the song could be included on Jackson's album, to which Porcaro and Bettis agreed. \"Human Nature\" was the last song selected for Thriller, ousting \"Carousel\" from the final track listing.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"7","intLoved":"0","intScore":"9","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"b9a85eca-f4e9-46d3-8765-dd08b5e183ea","strMusicBrainzAlbumID":"f32fab67-77dd-3937-addc-9062e28e4c37","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823002","idAlbum":"2118223","idArtist":"112424","idLyric":"333179","idIMVDB":"0","strTrack":"P.Y.T. (Pretty Young Thing)","strAlbum":"Thriller","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"237000","strGenre":"Pop","strMood":"Quirky","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"P.Y.T. (Pretty Young Thing)\" is a song by American recording artist Michael Jackson. It is the sixth single from Jackson's sixth solo album, Thriller (1982). The original demo version of the song was written by Jackson and Greg Phillinganes. Quincy Jones passed on the song itself but liked the title and, with James Ingram, fashioned a totally new song with that title. The demo version is featured on The Ultimate Collection.\n\n\"P.Y.T. (Pretty Young Thing)\" was released on September 19, 1983, as the penultimate single from Thriller. The single charted at number 10 on the Billboard Hot 100 and no. 46 on the Hot Black Singles chart, becoming the sixth Top 10 hit from the album. In the UK, the song reached a peak position of 11. The single was most successful in Belgium, charting within the Top 10 at no. 6. The song has been covered and sampled by numerous artists, including Monica, Justin Guarini and Kanye West. The original demo was also remixed by The Black Eyed Peas singer will.i.am for Thriller 25.\n\n\"P.Y.T. (Pretty Young Thing)\" was never performed live by Jackson. In a rehearsal for the Dangerous World Tour, however, Jackson sang a small part of the demo version, describing it as \"something I wrote that I haven't recorded yet.\"\n\nJames Ingram later described working with Jackson and Jones as being in The Wonderful Wizard of Oz. \"It's almost like I got the chance to go to Oz and Quincy was the Wizard of Oz and Michael Jackson was who he was dealing with in his world. Their work ethic is unbelievable.\" He noted how Jones would fall asleep on the board, waking up to answer a question. \"He works in the Alpha state a lot\", Ingram added. Two of Jackson's sisters, Janet and La Toya, provided backing vocals in the guise of the P.Y.T.s. The two sisters sang \"na na na\" back at their brother towards the end of the song. It has a tempo of 126 beats per minute, making it one of Jackson's fastest songs.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"8","intLoved":"0","intScore":"8","intScoreVotes":"1","intTotalListeners":"430970","intTotalPlays":"1979941","strMusicBrainzID":"a0c05b51-ed66-469d-adad-18a362f7c9ff","strMusicBrainzAlbumID":"f32fab67-77dd-3937-addc-9062e28e4c37","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"},{"idTrack":"32823003","idAlbum":"2118223","idArtist":"112424","idLyric":"333185","idIMVDB":null,"strTrack":"The Lady in My Life","strAlbum":"Thriller","strArtist":"Michael Jackson","strArtistAlternate":null,"intCD":null,"intDuration":"298000","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"9","intLoved":"0","intScore":"5","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"c6795fd7-a6e1-4c72-86b4-0aaa1d6b8449","strMusicBrainzAlbumID":"f32fab67-77dd-3937-addc-9062e28e4c37","strMusicBrainzArtistID":"f27ec8db-af05-4f36-916e-3d57f91ecf5e","strLocked":"unlocked"}]}