{"track":[{"idTrack":"33899805","idAlbum":"2205903","idArtist":"111239","idLyric":"0","idIMVDB":"0","strTrack":"Always in My Head","strAlbum":"Ghost Stories","strArtist":"Coldplay","strArtistAlternate":null,"intCD":null,"intDuration":"0","strGenre":"Pop-Rock","strMood":"Relaxed","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Always in My Head\" is a song by British alternative rock band Coldplay. It was written by all the members of the band and appears as the opening track from their sixth studio album, Ghost Stories (2014). Although it was never released as a single, the song has charted in the UK and in France.\n\nThe song came with a music video, animated by Alasdair+Jock.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=kWh7Nr9Cxlc","strMusicVidDirector":"Alasdair+Jock","strMusicVidCompany":"Trunk","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"2219021","intMusicVidLikes":"18997","intMusicVidDislikes":"200","intMusicVidFavorites":"0","intMusicVidComments":"637","intTrackNumber":"1","intLoved":"0","intScore":null,"intScoreVotes":null,"intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"5c278fd7-fc78-43f2-b74a-e428ae811ade","strMusicBrainzAlbumID":"9c5aa9d2-068b-4626-b352-ae6f4f4e0b15","strMusicBrainzArtistID":"cc197bad-dc9c-440d-a5b5-d52ba2e14234","strLocked":"unlocked"},{"idTrack":"33899806","idAlbum":"2205903","idArtist":"111239","idLyric":"0","idIMVDB":"0","strTrack":"Magic","strAlbum":"Ghost Stories","strArtist":"Coldplay","strArtistAlternate":null,"intCD":null,"intDuration":"0","strGenre":"Pop-Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Magic\" is a song recorded by British alternative rock band Coldplay for their sixth studio album, Ghost Stories (2014). It was written and produced by band members Guy Berryman, Jonny Buckland, Will Champion, Chris Martin, with production assistance from Paul Epworth, Daniel Green, and Rik Simpson. The song was released as the lead single from Ghost Stories on 3 March 2014, by Parlophone. A beat consisting of a \"muffled snare\" and \"dusty bass riff\" is repeated throughout most of the song. As the song progresses, an organ is later added to the instrumentation which is eventually swapped out for a stomp-clap beat and again for a synth beat. Following the song's second chorus, these beats are gradually combined together while Martin sings in falsetto. The song's \"anticlimactic\" portion then decreases intensity until it has eventually resumed to simply a snare and bass riff.\nThe song was recorded by the band during sessions for their sixth studio album in 2013, at their purpose-built studios The Bakery and The Beehive in North London, England, both originally constructed for work on their two previous studio albums, 2008's Viva la Vida or Death and All His Friends and 2011's Mylo Xyloto respectively. The song's bass riff, the first part of the song, was originally conceived by Guy Berryman during the band's recording sessions in February 2013. The song was then covered by singer/songwriter Lauren Aquilina for her BBC Radio 1 Maida Vale session.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/vqxuxr1400597180.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"http://www.youtube.com/watch?v=Qtb11P1FWnc","strMusicVidDirector":"Jonas Åkerlund","strMusicVidCompany":"","strMusicVidScreen1":"https://www.theaudiodb.com/images/media/track/mvidscreen/xruywv1510242363.jpg","strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"52837755","intMusicVidLikes":"295775","intMusicVidDislikes":"8732","intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"2","intLoved":"3","intScore":"10","intScoreVotes":"3","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"5eaee471-7c3e-49ef-9dba-2f09b2d41fd3","strMusicBrainzAlbumID":"9c5aa9d2-068b-4626-b352-ae6f4f4e0b15","strMusicBrainzArtistID":"cc197bad-dc9c-440d-a5b5-d52ba2e14234","strLocked":"unlocked"},{"idTrack":"33899807","idAlbum":"2205903","idArtist":"111239","idLyric":"0","idIMVDB":"2147483647","strTrack":"Ink","strAlbum":"Ghost Stories","strArtist":"Coldplay","strArtistAlternate":null,"intCD":null,"intDuration":"0","strGenre":"Pop-Rock","strMood":"Relaxed","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Ink\" is a song by British rock band Coldplay from their sixth studio album Ghost Stories (2014). It was released as the fifth overall single from the album on 13 October 2014. Prior to its single release, \"Ink\" debuted at number 156 on the UK Singles Chart.\n\nMusic video\nThe animated video was designed by production team, Blind. An interactive video of \"Ink\" was uploaded on Coldplay's official website. An official cut was made and uploaded on YouTube.\n\nSynopsis\nThe official cut video begins with a couple lying on a beach, the woman leaves the man on the beach and walks into the woods. The man take the compass (which contains an image of the woman) and follows the woman. The woman walks into a path on the left side. The man soon arrives at the branch path and decide to walk into the right side. The man is upset and looks into a water puddle on the road. The video continue with the man's drifting in the ocean, looking to a cloud which represent to the woman. The man falls after arrive to a waterfall. A bird saves the man and the man falls down after that. Many papers surround the man and build a staircase. The man climbs up and looking at the stars with a telescope. The man sees many constellations and the constellations are the image of the couple. The man rides on a sailboat and arrives to a mega waterfall. The woman appears and saves the man at the end of the video.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/wwyuuy1510242931.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=nLhcmwvI1Dg","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":"https://www.theaudiodb.com/images/media/track/mvidscreen/urypyx1510242425.jpg","strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"3452714","intMusicVidLikes":"29795","intMusicVidDislikes":"507","intMusicVidFavorites":"0","intMusicVidComments":"881","intTrackNumber":"3","intLoved":"0","intScore":"8","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"ffcc1b43-a189-4125-93b5-e91270ec32cf","strMusicBrainzAlbumID":"9c5aa9d2-068b-4626-b352-ae6f4f4e0b15","strMusicBrainzArtistID":"cc197bad-dc9c-440d-a5b5-d52ba2e14234","strLocked":"unlocked"},{"idTrack":"33899808","idAlbum":"2205903","idArtist":"111239","idLyric":"0","idIMVDB":"0","strTrack":"True Love","strAlbum":"Ghost Stories","strArtist":"Coldplay","strArtistAlternate":null,"intCD":null,"intDuration":"0","strGenre":"Pop-Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"True Love\" is a song written by British alternative rock band Coldplay. The song was originally recorded for the band's sixth studio album Ghost Stories, where it appears as the fourth track. It was released by Parlophone as the third single from Ghost Stories on 14 August 2014. The song was written by Guy Berryman, Jonny Buckland, Will Champion and Chris Martin, with production being done by Coldplay, Paul Epworth, Daniel Green and Rik Simpson, while American record producer Timbaland provided additional drums.\n\nThe song's main instrumentation consists in heavy rhythms, dancing synths and wallowing strings. It also features a guitar solo. Lyrically, \"True Love\" talks about heartache and how the protagonist can't bear the pain of losing his lover. The song's lyrics were adressed to be about Martin's divorce from his wife Gwyneth Paltrow, a recurrent theme on the whole album. Martin has claimed that \"True Love\" is the band's favorite track it has ever written.\n\nThe song received generally acclaim from most music critics, who commended the song's raw honesty and its lyrics, which were seen as haunting and painfully truthful. Commercially successful in Belgium and the Netherlands, \"True Love\" did not chart on the UK Singles Chart. The accompaning music video for the song was directed by Jonas Åkerlund, who also directed the \"Magic\" video. It was shot in Los Angeles and centres around a tale of two ballet-loving outsiders, played by Martin and Canadian actress Jessica Lucas.\nAfter the success of their fifth studio album, Mylo Xyloto (2011), which sold more than 8 million copies worldwide and spawned the hit singles \"Paradise\" and \"Princess of China\", Coldplay planned to release a more stripped-down record. Frontman Chris Martin claimed that the album is about “life itself and all its glorious colorfulness\", while critics noted that it was inspired in Martin's divorce from actress Gwyneth Paltrow, with \"Ghost Stories\" being deemed as a \"breakup album\". Martin elaborated: \"Up to a certain point in my life I wasn't completely vulnerable and it caused some problems. If you don't let love in then you can't really give it back. So what 'Ghost Stories' means to me is like, you've got to open yourself up to love and if you really do, of course it will be painful at times, but then it will be great at some point.\"\n\nOn 4 August 2011, the band announced \"True Love\" as the album's third single, along with its artwork, which was created by artist Mila Fürstová. The song was officially released on 14 August 2014. Regarding the decision to release \"True Love\" as a single, Martin commented: \"Sometimes we'll pick a single knowing that it doesn't really fit into how singles should sound or do sound. Our whole philosophy, especially recently, has been to follow our gut feeling. If we feel like this record needs to be a bit smaller and shouldn't tour it, then we follow it, and we worry about the consequences afterwards.\n\"True Love\" was written by Guy Berryman, Jonny Buckland, Will Champion and Chris Martin, with production being handled by the band with Paul Epworth, Daniel Green and Rik Simpson. American record producer Timbaland provided additional drums, while Davide Rossi arranged strings. The song is written in the key of G major, with a moderate tempo of 120 beats per minute. Martin's vocal range spans from the low note of E4 to the high note of G6. Its instrumentation consist in heavy rhythms, dancing synths and wallowing strings. Chris DeVille of Stereogum noted that the song has \"Timbaland show up to add 'Apologize'-style schmaltz\" and \"a mournful guitar solo.\"\n\nLyrically, \"True Love\" deals with themes of heartbreak, with Martin lashing out at his lover’s alleged lies, even as he strains to bring back the old feelings: \"And I wish you would have let me know/ What’s really going on below/ I’ve lost you now, you’ve let me go/ But one last time/ Tell me you love me,\" he sings. In the chorus, the truth is too painful to bear, so the singer instructs his partner, \"Just tell me you love me/If you don't, then lie/Oh, lie to me.\"\nThe song's music video was directed by Jonas Åkerlund, who also directed the \"Magic\" video. It was shot in Los Angeles and premiered on 22 August 2014. The video stars Chris Martin and Canadian actress Jessica Lucas. It centres around a tale of two ballet-loving outsiders and the message behind the video is about \"in spite of the obstacles blocking our access, 'anything is possible'.\" According to Åkerlund, the video \"came about in the same way as 'Magic' did. One thing I said early was that I wanted it to be very different in tone from 'Magic'. But related somehow because it has a story.\"","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=Wpl_6jotaHA","strMusicVidDirector":"Jonas Åkerlund","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"7044344","intMusicVidLikes":"74629","intMusicVidDislikes":"1932","intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"4","intLoved":"0","intScore":"10","intScoreVotes":"2","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"b4cb134b-9811-49d6-9c69-450f0d6f02ae","strMusicBrainzAlbumID":"9c5aa9d2-068b-4626-b352-ae6f4f4e0b15","strMusicBrainzArtistID":"cc197bad-dc9c-440d-a5b5-d52ba2e14234","strLocked":"unlocked"},{"idTrack":"33899809","idAlbum":"2205903","idArtist":"111239","idLyric":"0","idIMVDB":"2147483647","strTrack":"Midnight","strAlbum":"Ghost Stories","strArtist":"Coldplay","strArtistAlternate":null,"intCD":null,"intDuration":"0","strGenre":"Pop-Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"Midnight\" is a song recorded by British alternative rock band Coldplay for their sixth studio album, Ghost Stories (2014). It was written and produced by band members Guy Berryman, Jonny Buckland, Will Champion, Chris Martin, with production assistance from Paul Epworth, Daniel Green, and Rik Simpson, and co-production from Jon Hopkins. A music video for the Ghost Stories track was released on 25 February 2014 as a teaser for the then-unannounced sixth studio album. A \"Midnight\" 7-inch vinyl single was pressed by Parlophone for Record Store Day 2014. The single, featuring the track on a single side of the record, was released on 17 April 2014, becoming the second music release by the band in promotion of Ghost Stories. A live version of the song, recorded and filmed at the Royal Albert Hall, in London, was included in the Ghost Stories Live 2014.\n\"Midnight\" was built over a previously unreleased original track produced by Jon Hopkins in 2003. The track, named \"Amphora\", was never completed by Hopkins and was partly released by ambient/electronic music blog A Strangely Isolated Place on SoundCloud in early 2012, as part of their playlist \"ASIP - 1.00.00\". The song also incorporates elements from a Jon Hopkins recording titled by Hopkins as \"The Fourth State II\", a reproduction of his 2008 extended play The Fourth Estate.\nThe song was recorded by the band during sessions for their sixth studio album in 2013, at their purpose-built studios The Bakery and The Beehive in North London, England, both originally constructed for work on their two previous studio albums, 2008's Viva la Vida or Death and All His Friends and 2011's Mylo Xyloto respectively. Chris Martin's recorded vocals for the song were put through a vocoder.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/qtpwxv1418300110.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=BQeMxWjpr-Y","strMusicVidDirector":"Mary Wigmore","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"25683901","intMusicVidLikes":"149408","intMusicVidDislikes":"10781","intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"5","intLoved":"0","intScore":null,"intScoreVotes":null,"intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"35f9f0cb-a196-4b47-8f8c-6d2708a4e933","strMusicBrainzAlbumID":"9c5aa9d2-068b-4626-b352-ae6f4f4e0b15","strMusicBrainzArtistID":"cc197bad-dc9c-440d-a5b5-d52ba2e14234","strLocked":"unlocked"},{"idTrack":"33899810","idAlbum":"2205903","idArtist":"111239","idLyric":"0","idIMVDB":null,"strTrack":"Another's Arms","strAlbum":"Ghost Stories","strArtist":"Coldplay","strArtistAlternate":null,"intCD":null,"intDuration":"0","strGenre":"Pop-Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"6","intLoved":"0","intScore":"6","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"0f787ae7-e0e0-4c59-b34b-8fc6cd7fcd33","strMusicBrainzAlbumID":"9c5aa9d2-068b-4626-b352-ae6f4f4e0b15","strMusicBrainzArtistID":"cc197bad-dc9c-440d-a5b5-d52ba2e14234","strLocked":"unlocked"},{"idTrack":"33899811","idAlbum":"2205903","idArtist":"111239","idLyric":"0","idIMVDB":null,"strTrack":"Oceans","strAlbum":"Ghost Stories","strArtist":"Coldplay","strArtistAlternate":null,"intCD":null,"intDuration":"0","strGenre":"Pop-Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"7","intLoved":"0","intScore":null,"intScoreVotes":null,"intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"4f11e0e7-185e-4103-9416-a45953bf0f8d","strMusicBrainzAlbumID":"9c5aa9d2-068b-4626-b352-ae6f4f4e0b15","strMusicBrainzArtistID":"cc197bad-dc9c-440d-a5b5-d52ba2e14234","strLocked":"unlocked"},{"idTrack":"33899812","idAlbum":"2205903","idArtist":"111239","idLyric":"0","idIMVDB":"0","strTrack":"A Sky Full of Stars","strAlbum":"Ghost Stories","strArtist":"Coldplay","strArtistAlternate":null,"intCD":null,"intDuration":"0","strGenre":"Pop-Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":"\"A Sky Full of Stars\" is a song recorded by British alternative rock band Coldplay, released on 2 May 2014 as the second single from their sixth studio album, Ghost Stories (2014). The band co-wrote and co-produced the song with Swedish DJ Avicii, with production assistance from Paul Epworth, Daniel Green, and Rik Simpson. It was recorded at The Bakery and The Beehive in North London, England.\n\nUpon its release, \"A Sky Full of Stars\" garnered mostly positive reviews from music critics and have charted inside the top 10 in over 16 countries such as Australia, Canada, Europe, Japan, Mexico, the United Kingdom and United States. A music video for the song was directed by Mat Whitecross and was released on 19 June 2014. The song is used as the theme song for Godzilla.\n\"A Sky Full of Stars\" marks the band's first dance track, being outlined as an EDM track with house influences. A piano-centric song which is written in the key of E♭ minor, the track opens as a piano ballad, with progressive house-influenced electronic music that plays out in between verses. According to the sheet music published at Musicnotes.com, the song follows a chord progression of E♭m7–C♭maj9–G♭–B♭m(♭6) with a tempo of 125 beats per minute, and the vocals span from A♭4 to G♭6. The track has been described as \" in line with the synth-heavy soundscapes of 'Midnight', but with more danceable flavor\".\n\"A Sky Full of Stars\" was recorded during the sessions for the band's sixth studio album, at their purpose-built studios The Bakery and The Beehive in North London, England. The studios were both originally constructed for work on their two previous studio albums, 2008's Viva la Vida or Death and All His Friends and 2011's Mylo Xyloto.\n\nSwedish record producer Avicii was invited by the band to collaborate on \"A Sky Full of Stars\". In addition to producing the track, he was also asked by lead singer Chris Martin to play and record the piano parts. However, Martin later stated in a BBC Radio 1 interview with Zane Lowe that he felt that he had \"cheated\" on the band by asking Avicii to play the piano instead of him.\nThe single art for \"A Sky Full of Stars\" was etched by UK-based, Czech etching artist Mila Fürstová. The artwork continues the motif of artworks in the Ghost Stories album cycle, which feature a scene occurring in a larger, enclosed body. Multiple figures such as angels with wings like of the Ghost Stories artwork, buildings such as a church, and objects such as a maze and a chair, also alluding to those in the Ghost Stories artwork, are depicted encased in a three-dimensional star chart. The artwork is reminiscent of Fürstová's earlier work, Other Skies, which also features various figures, buildings and objects imposed onto a star map.\nThe official music video was directed by Mat Whitecross and the shooting took place on King Street in Newtown, a suburb of Sydney, on 17 June 2014. It was released on 19 June. At the beginning of the video, Coldplay's lead singer, Chris Martin, walks through Sydney's streets dressed as a one-man band, singing the first verse of the song. Then he reaches the other members of the band (also dressed as one-man bands) and, together, they play the instrumental refrain. Martin is then seen walking through the street, without the other members, while he sings the second verse. At the end of the video the band reunites in a square, singing and playing the final part of the song with a crowd of fans. While Martin is singing the final part, many paper-made stars are blown into the square.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/ypvruy1414417701.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=VPRjCeoBqrI","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"55649298","intMusicVidLikes":"368388","intMusicVidDislikes":"7788","intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"8","intLoved":"0","intScore":"10","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"c12bd871-5ae2-449a-918b-1fdffda3b6c8","strMusicBrainzAlbumID":"9c5aa9d2-068b-4626-b352-ae6f4f4e0b15","strMusicBrainzArtistID":"cc197bad-dc9c-440d-a5b5-d52ba2e14234","strLocked":"unlocked"},{"idTrack":"33899813","idAlbum":"2205903","idArtist":"111239","idLyric":"0","idIMVDB":null,"strTrack":"O","strAlbum":"Ghost Stories","strArtist":"Coldplay","strArtistAlternate":null,"intCD":null,"intDuration":"0","strGenre":"Pop-Rock","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"9","intLoved":"0","intScore":"5.66667","intScoreVotes":"3","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"4733b01f-0caf-43a2-aa41-3ef2e3992432","strMusicBrainzAlbumID":"9c5aa9d2-068b-4626-b352-ae6f4f4e0b15","strMusicBrainzArtistID":"cc197bad-dc9c-440d-a5b5-d52ba2e14234","strLocked":"unlocked"}]}