{"track":[{"idTrack":"33973975","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"2147483647","strTrack":"One","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"253089","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"In Love","strDescriptionEN":"\"One\" is a song by English singer-songwriter Ed Sheeran. It features production from frequent collaborator Jake Gosling. The song was released on 14 May 2014 as the first promotional \"instant-grat\" single from his second studio album, x, reaching number 18 in the UK Singles Chart.\n\n\"One\" was the first song Sheeran wrote for x, written before the release of his first album, +. The song was written on a whiskey barrel whilst on tour in New Zealand It was the final song Sheeran wrote about the main love interest that featured on +.\n\nIt was released as the first promotional single from x on 16 May, available as an \"instant grat\" download on iTunes when you pre-ordered the album. It peaked at number 18 on the UK Singles Chart and entered the Billboard Hot 100 at 87.\n\nOn May 2, 2014, an official video was released on his YouTube channel. It features him performing the song live to an empty stadium. As of October 2014, it has over 10,000,000 million views.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=Ix9NXVIbm2A","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"144996559","intMusicVidLikes":"673745","intMusicVidDislikes":"13226","intMusicVidFavorites":"0","intMusicVidComments":"15782","intTrackNumber":"1","intLoved":"1","intScore":"10","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"07a4f279-5499-4338-bec5-a00dca4b1037","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973976","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"I'm a Mess","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"246029","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"I'm a Mess\" is a song recorded by English singer-songwriter Ed Sheeran for his second studio album, × (2014). It features production from frequent collaborator Jake Gosling. It entered the UK Singles Chart at number 72 and rose to number 49 due to strong download sales, despite lacking an independent release.\n\nFollowing the release of his debut studio album, +, in 2011, Sheeran started writing material for his next release. Instead of rush-run and launch an album the next year, the singer decided to take time and focus on writing material that would help expand his career in the United States, like fellow British musician Adele and band Coldplay. \"I'm a Mess\" premiered on 22 June 2014 via MTV, a day before the release of ×, his second album in the United Kingdom and the United States. The track together with \"Thinking Out Loud\" were the last songs he wrote for × and were inspired by his then-girlfriend, Athina Andrelos. On 16 July 2014, during the album unveiling in a room in RAK Studios, he noted that he wrote \"I'm a Mess\" while he was in the shower.\n\nIn an interview with New Zealand Herald, he described \"I'm a Mess\" as him being in a bad situation after he hurt a person, \"I think it's important to stay double-sided. I'm very aware I have a lot of flaws too and I think I wear them on my sleeve with this album.\" Talking to News.com.au, he identified the song as \"fairly self-explanatory\" and recalled, \"'I’m a Mess' was definitely written at my lowest point. It actually turned out a lot nicer than what was going on at the time, the lyrics aren’t too mental. That came at the end of a lot of things meeting. After that I was fine. Writing that song sorted everything out.\" Sheeran said that \"I'm a Mess\" is his favourite track from ×.\n\nThe production of \"I'm a Mess\" was done by Sheeran's regular collaborator, Jake Gosling and was recorded at his Sticky Studios in Windlesham, Surrey. Gosling together with Geoff Swan served as the song's engineers while William Hicks did the vocal editing and provided additional vocals. Mark \"Spike\" Stent mixed the track at Mixsuite UK whilst Stuark Hawkos mastered it at Metropolis Mastering in London. All the programming and instrumentation was provided by Sheeran, Gosling and Chris Leonard. A live version of \"I'm a Mess\" was released as a B-side on the 7\" release of \"Thinking Out Loud\".\n\n\"I'm a Mess\" is a pop song with folk music influences and a length of four minutes and five seconds. Its instrumentation included electric guitar notes, backing vocals and a beating drum. According to Sony/ATV Music Publishing's digital sheet music for the song, \"I'm a Mess\" is composed in the key of C minor and set in common time signature, and has a groove of 140 beats per minute. Sheeran's vocals span from the low note of Bb3 to the high note of Bb5. Neil McCormick of The Daily Telegraph described \"I'm a Mess\" as a \"edgy, rocky drama\", whilst according to Jason Lipshutz of Billboard Sheeran uses his \"classic folk voice and sensibility\" to deliver the song's lyrics. MTV News' Emily Blake noted that the stripped down production of the song helps the focus to be on Sheeran's voice. She further elaborated, \"like most of his folk-leaning pop numbers, it’s a track that makes you feel like Sheeran’s singing just to you\" and \" when his voice comes down to a near whisper — making the whole thing that much more intimate.\"\n\nAccording to Caitlin White of the same publication, \"I'm a Mess\" is a \"lovelorn song\" which shows a different side of Sheeran; instead of being brokenhearted, \"he’s the one that messed up\". He is \"self-reflective\" and \"self-critical\" with one of the verses contain lyrics as, \"And oh, I’ve only caused you pain\" and the chorus features the line, \"Easy baby, maybe I’m a liar\". Billboard's Colin Stutz concluded, \"Sheeran's intimate voice carries over simple guitar strokes as he describes a night of loneliness and longing that erupts with fiery passion.\"","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"2","intLoved":"0","intScore":"8","intScoreVotes":"1","intTotalListeners":"213179","intTotalPlays":"1378647","strMusicBrainzID":"468bb085-0c20-44b3-8ca6-66c65cd688f0","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973977","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"Sing","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"235382","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"Guys Night Out","strDescriptionEN":"\"Sing\" is a song by English singer-songwriter Ed Sheeran. It was written by Sheeran and Pharrell Williams, who also produced it and provides uncredited background vocals. The song was released as a digital download on 7 April 2014, serving as the lead single from Sheeran's second studio album, x (2014).\n\nThree years after the release of his debut album, +, Sheeran announced that he hoped he would release his second album during 2014. The song was written by Sheeran and Pharrell Williams, produced by the latter, and has a length of 3 minutes and 55 seconds. The song, which has pop and R&B influences and was inspired by singer Justin Timberlake, is a considered a departure from Sheeran's folk rock sound he became known for on his album +. Sheeran was inspired to model the song after the pop and R&B stylings of Timberlake, stating \"It was pretty close to a direct inspiration. I love Justified and FutureSex/LoveSounds, so I took inspiration from those.\" The lyrics are about \"a night out in Vegas.\"\n\n\"Sing\" was released in the United Kingdom, Ireland, Australia and Germany in May 2014 with a corresponding EP. Aside from these nations, \"Sing\" was released internationally on 7 April 2014, during a YouTube live chat with Sheeran. \"Friends\", a track from the EP, entered the UK Singles Chart at number 121.\n\nThe music video for \"Sing\", directed by Emil Nava, was released exclusively to Sheeran's Facebook page on 22 May 2014, and added to Vevo and YouTube on 23 May, exactly a month before the album was released. It follows a puppet caricature of Sheeran on a night out, during which he gets drunk, sings karaoke, goes to a strip club and picks up Sheeran and Pharrell from a studio in his truck.\n\nThe puppet is currently in Sheeran's safekeeping, but he has \"no idea how to work it yet\". The puppet was closely modelled on him, down to his clothes and tattoos. Sheeran and Pharrell received the award for Best Male Video at the 2014 MTV Video Music Awards for the video.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/uwpryw1414422648.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=tlYcUqEPN58","strMusicVidDirector":"Emil Nava","strMusicVidCompany":"London Alley Entertainment","strMusicVidScreen1":"https://www.theaudiodb.com/images/media/track/mvidscreen/vxsrpy1515668378.jpg","strMusicVidScreen2":"https://www.theaudiodb.com/images/media/track/mvidscreen/wwwurv1515668389.jpg","strMusicVidScreen3":"https://www.theaudiodb.com/images/media/track/mvidscreen/wqurvq1515668398.jpg","intMusicVidViews":"206855907","intMusicVidLikes":"1019471","intMusicVidDislikes":"32293","intMusicVidFavorites":"0","intMusicVidComments":"26221","intTrackNumber":"3","intLoved":"2","intScore":"10","intScoreVotes":"2","intTotalListeners":"376898","intTotalPlays":"2870332","strMusicBrainzID":"4ee00f62-b61c-4236-98b7-b511b5ae31a7","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973978","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"Don't","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"219442","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"In Love","strDescriptionEN":"\"Don't\" is a song recorded by English singer-songwriter Ed Sheeran taken from his second studio album x (2014). It was written by Sheeran and Benjamin Levin and produced by Rick Rubin and Levin, under his production moniker Benny Blanco. The song samples \"Don't Mess with My Man\" by Lucy Pearl.\n\n\"Don't\" was initially planned as the lead single for the album but was passed over in favour of \"Sing\". The song was instead released to iTunes on 13 June 2014 as the second \"instant grat\" promotional single from x. It peaked at number 8 on the UK Singles Chart. \"Don't\" officially impacted US contemporary hit radio on 15 July 2014 and was released independently on 24 August 2014 as the album's second single.\n\n\"Don't\" is a song about a girlfriend who cheated on Sheeran with a close friend, and has been linked to several of Sheeran's fellow singers, including Ellie Goulding. Sheeran has said it is \"100 percent not about Taylor\". Having played the song for Swift he said, \"She was just like, 'Whatever happens, ever, between us as friends, I never want to piss you off that much,'\". The song started off \"as a riff on his phone\", and was recorded first with Benny Blanco, then again with Rick Rubin with the two producers coming together to produce the final cut. The song almost didn't make it onto the album, as Sheeran felt it was \"a bit personal\", but was urged by those who had heard the demo to release it, as it was \"an alright song... so it ended up on the record\".\n\nAn accompanying music video was released on YouTube on 4 August 2014. The video was directed by Emil Nava and follows a dancer (Philiph Chbeeb from I.aM.mE) going from poverty to wealth. Sheeran makes a brief drive-by cameo appearance. 4Music called it a \"compelling watch\".","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/uwvrry1488922674.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=iD2rhdFRehU","strMusicVidDirector":"Emil Nava","strMusicVidCompany":"London Alley Entertainment","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"175433741","intMusicVidLikes":"863548","intMusicVidDislikes":"25849","intMusicVidFavorites":"0","intMusicVidComments":"20893","intTrackNumber":"4","intLoved":"1","intScore":"10","intScoreVotes":"1","intTotalListeners":"381267","intTotalPlays":"2908977","strMusicBrainzID":"9037fd5b-e74f-49c9-90aa-9c8d08ee160a","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973979","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":null,"strTrack":"Nina","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"223965","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"5","intLoved":"0","intScore":"7","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"017830c1-d1cf-46f3-8801-aaaa0a930223","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973980","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"Photograph","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"257611","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Photograph\" is a song recorded by the English singer-songwriter, Ed Sheeran, for his second studio album, × (2014). Sheeran wrote the song with Snow Patrol member, Johnny McDaid, who had a piano loop from which the composition developed. After recording several versions with other producers, Sheeran eventually solicited help from Jeff Bhasker; the collaboration generated a version that Bhasker further enhanced for months. The ballad derives its music primarily from an acoustic guitar, piano and programmed drums. With visually descriptive lyrics, it discusses a long-distance relationship inspired by Sheeran's own experience of being away from his then-girlfriend while he was on tour.\n\nThe song received generally positive commentary from critics, who noted the lyrics and Sheeran's use of imagery. \"Photograph\" served as the fifth and final single from the album. It reached the top five on the main singles charts in more than five countries. In the US, where it peaked at No. 10, \"Photograph\" became the third single from the album to have reached within the top ten. In the UK, it reached No. 15 and has since been certified platinum for sales of 600,000 units. The single has also been certified double platinum in Australia and Canada, and platinum in New Zealand and Italy.\n\nThe single's release on 11 May 2015 followed the premiere of the music video on 9 May 2015. The video is a montage of real home footage of Sheeran's infancy, childhood and adolescence, providing insight on his private early life such as his inclination to playing music instruments and fondness of Lego. The video was nominated for Best Video at the 2016 Brit Awards. Sheeran performed the song on television shows and on his x Tour, which ran from 2014 to 2015.\n\nOn 9 June 2016, it was revealed that Sheeran was being sued by songwriters Martin Harrington and Thomas Leonard, writers of Matt Cardle's 2011 single \"Amazing\", for $20 million for copyright infringement.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=nSDgHBxUbVQ","strMusicVidDirector":"Emil Nava","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"908400240","intMusicVidLikes":"4659622","intMusicVidDislikes":"132220","intMusicVidFavorites":"0","intMusicVidComments":"142986","intTrackNumber":"6","intLoved":"1","intScore":"10","intScoreVotes":"5","intTotalListeners":"461727","intTotalPlays":"4029876","strMusicBrainzID":"7dcbc1be-4257-4d64-b915-045dfb23ae88","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973981","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"Bloodstream","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"299021","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Bloodstream\" is a song recorded by English singer-songwriter, Ed Sheeran for his second studio album, × (2014). It was written by Sheeran, Rudimental, and Snow Patrol members – Johnny McDaid and Gary Lightbody. Production was handled by Rick Rubin.\n\nThe song was released as an \"instant grat\" digital download to the iTunes Store on 17 June 2014, serving as the fourth of seven promotional singles from ×. It entered the UK Singles Chart at number 81 and rose to number 60.\n\nIn December 2014, \"Bloodstream\" was remixed by Rudimental. This version of the song was released on 29 March 2015 as a joint single between Sheeran and Rudimental, serving as the fourth single from × and the lead single from Rudimental's second studio album, We the Generation (2015). This remix peaked at number 2 on the UK Singles Chart.\n\n\"Bloodstream\" was written by Sheeran, Rudimental, and Snow Patrol members - Johnny McDaid and Gary Lightbody, and produced by Rick Rubin. The song is about Sheeran taking MDMA during a wedding celebration in Ibiza. He claims that during the experience he \"fell in love with a beanbag\" and that \" felt anxiety,  felt love,  felt warm,  felt a bit weird\". Sheeran made a live PA to perform the song during Rudimental's set at Glastonbury on 27 June 2014.\n\nA music video featuring actor Ray Liotta was released on 23 March 2015. The video was directed by Emil Nava.\n\n\"Emil Nava has delivered this Youtube Music Award video for Ed Sheeran & Rudimental's track Bloodstream, exploring the psychology of a wealthy, disgruntled ex-rock star who's dissatisfaction with the emptiness of his middle-age life - in contrast to the success and happiness of his glory days - has reached a breaking point.\n\nIn this respect, the casting of Ray Liotta is an inspired move. He transmits the growing crisis of a complex character driven to the brink by blotting out his loneliness with booze, girls, more booze - and riding his horse indoors.\" (Cat Velez, Promonews)","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=Orq_75kFi8I","strMusicVidDirector":"Emil Nava","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"27853517","intMusicVidLikes":"205145","intMusicVidDislikes":"6425","intMusicVidFavorites":"0","intMusicVidComments":"5519","intTrackNumber":"7","intLoved":"0","intScore":"8","intScoreVotes":"1","intTotalListeners":"224704","intTotalPlays":"1602157","strMusicBrainzID":"09296cd5-d11a-402e-8f32-29418fb1d86b","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973982","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"Tenerife Sea","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"240067","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Tenerife Sea\" is a song by English singer-songwriter Ed Sheeran. It was co-written by Snow Patrol member Johnny McDaid and Foy Vance, and features production from Rick Rubin. The song was released on 20 June 2014 as part of his second studio album, x. It entered the UK Singles Chart at number 93 despite lacking an independent release.\n\nSheeran wrote \"Tenerife Sea\" while in Nashville, the capital of the US state of Tennessee. It was inspired by the events following the 2013 Grammy Awards, wherein his single \"The A Team\" was nominated for Song of the Year, a first Grammy nomination for Sheeran. He lost the award to the American band Fun for its song \"We Are Young\". Along with his girlfriend, Sheeran attended the after-party where he, being in a new experience, felt uninterested participating in the conversations. According to Sheeran, \"neither of  wanted to be there - you just want to be with this one person\". He also told The San Francisco Examiner: \"It was a very odd atmosphere, where everyone was out for themselves. And I found myself being competitive, as well, and pissed off that I didn’t win, which felt very unhealthy.\"\n\nThe song's title is a reference to Tenerife in the Canary Islands of Spain. According to Sheeran, the hue of his girlfriend's eyes are as blue as the seas in Tenerife, \"seriously blue, like electric blue\". The lyrics speaks of Sheeran's girlfriend who he sees \"really pretty\" in her dress.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/rwqtvy1488923532.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"8","intLoved":"1","intScore":"10","intScoreVotes":"1","intTotalListeners":"281480","intTotalPlays":"1691668","strMusicBrainzID":"2ec68f9f-e687-47ed-b867-e9b575f482d6","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973983","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":null,"strTrack":"Runaway","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"206501","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"9","intLoved":"0","intScore":"7","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"7210c300-bbf0-45d9-912d-71dc27364852","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973984","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":null,"strTrack":"The Man","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"249951","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"10","intLoved":"0","intScore":"9","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"bb31cc9b-5816-4bee-afa4-84e60d390d26","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973985","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"Thinking Out Loud","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"280945","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"In Love","strDescriptionEN":"\"Thinking Out Loud\" is a song by English singer-songwriter Ed Sheeran. It features production from frequent collaborator Jake Gosling. The song was released as an \"instant grat\" digital download to the iTunes Store on 18 June 2014, serving as a promotional single from his second studio album, x (2014). It entered the UK Singles Chart at number 26 and has since peaked at number 13. \"Thinking Out Loud\" impacted Australian radio on 14 August 2014, and is scheduled for release as the third single off x.\n\nSheeran has described the piece as a \"walking down the aisle song\" . The song is a romantic ballad. It has been confirmed as the album's third single, with the music video premiered on 7 October 2014.\n\nOn the 8th of October, 2014, a music video was released for the song. It features Sheeran and his ballroom partner Brittany Cherry dancing, with choreography by Nappytabs and training help from Paul Karmiryan. After only sixteen hours, the video hit 2,000,000 views on YouTube.","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/xtxtyx1432838266.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=lp-EO5I60KA","strMusicVidDirector":"Emil Nava","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"2919565926","intMusicVidLikes":"10923796","intMusicVidDislikes":"486193","intMusicVidFavorites":"0","intMusicVidComments":"308017","intTrackNumber":"11","intLoved":"6","intScore":"10","intScoreVotes":"6","intTotalListeners":"567364","intTotalPlays":"5430182","strMusicBrainzID":"cb2cc207-8125-445c-9ef9-6ea44eee959a","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973986","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"Afire Love","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"298806","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Afire Love\" is a song recorded by English singer-songwriter Ed Sheeran for his second studio album, × (2014). The song is about Sheeran's late grandfather who suffered from Alzheimer's disease. The record, which was produced by Snow Patrol member Johnny McDaid, samples elements of \"Remembering Jenny\" composed by Christophe Beck for the soundtrack to the American television series Buffy the Vampire Slayer.\n\nThe song was released as an \"instant grat\" digital download to the iTunes Store on 16 June 2014, serving as the third of seven promotional singles from ×. Due to high streaming rates, all of the album's 12 tracks including \"Afire Love\" charted in the United Kingdom.\n\nThe song is about Sheeran's late grandfather who suffered from Alzheimer's disease for 20 years. He died of the disease in December 2013, two weeks after Sheeran began writing about it. Sheeran finished writing the song at his grandfather's funeral. Prior to the release of the album, Sheeran had also paid tribute at the 2014 Grammy Awards, in which he wore a necktie belonging to his grandfather.\n\nThe lyrics discusses Sheeran's reaction to the disease as a child all the way up until his grandfather's funeral. In the verses prior to the first chorus, Sheeran recounts the circumstances present upon his grandfather's disease. For instance, he sings the moment when his grandfather lost his capability of recognizing the face of his grandson: \"My father told me, son/ It's not his fault he doesn't know your face/ And you're not the only one.\" The chorus tells the \"powerful love between his grandparents\", in which his grandfather said to his grandmother: \"Put your open lips on mine and slowly let them shut/ For they're designed to be together/ With your body next to mine, our hearts will beat as one/ And we're set alight, we're afire in love.\" The song concludes with Sheeran and his family seemingly singing \"hallelujah\" at the funeral.\n\nSheeran recorded \"Afire Love\" in Cocoloco studio in Los Angeles, and Sphere and Metropolis studios in London. It was produced by Snow Patrol member Johnny McDaid, and engineered by Mcdaid and Geoff Swan. The track samples elements of \"Remembering Jenny\", which was composed by Christophe Beck for the soundtrack to the American television series Buffy the Vampire Slayer. The ballad is piano-driven and has a \"grooving\" beat.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"12","intLoved":"0","intScore":"7","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"2c805ab0-6796-4269-b96f-8265f4a2fb8f","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973987","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"Take It Back","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"208000","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"Take It Back\" is a song by English singer-songwriter Ed Sheeran. It features production from hip hop producer Rick Rubin. The song was released on 20 June 2014 as part of the deluxe edition of his second studio album, x (2014). It entered the UK Singles Chart at number 117 and rose to number 85 due to strong download sales, despite lacking an independent release.\n\nSheeran premiered an acoustic version of the song through SB.TV on 25 April 2014. The acoustic recording, and all live performances of the song, use Sheeran's verse from \"Epic Dreamers' Remix\" as a fourth verse which does not feature on the album version.","strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"","strMusicVidDirector":"","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"0","intMusicVidLikes":"0","intMusicVidDislikes":"0","intMusicVidFavorites":"0","intMusicVidComments":"0","intTrackNumber":"13","intLoved":"0","intScore":"8","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"cc121ba0-1700-44b1-8bf9-737ba979145c","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973988","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":null,"strTrack":"Shirtsleeves","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"189000","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"14","intLoved":"0","intScore":"6","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"2b1262ad-3306-40a1-8159-f8780f74effe","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973989","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":null,"strTrack":"Even My Dad Does Sometimes","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"228000","strGenre":"Pop","strMood":null,"strStyle":null,"strTheme":null,"strDescriptionEN":null,"strTrackThumb":null,"strTrack3DCase":null,"strTrackLyrics":null,"strMusicVid":null,"strMusicVidDirector":null,"strMusicVidCompany":null,"strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":null,"intMusicVidLikes":null,"intMusicVidDislikes":null,"intMusicVidFavorites":null,"intMusicVidComments":null,"intTrackNumber":"15","intLoved":"0","intScore":"6","intScoreVotes":"1","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"8914d7c8-8ba6-4f67-825d-ea8c72b32240","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973990","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"I See Fire","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"299000","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"I See Fire\" is a song from The Hobbit: The Desolation of Smaug, written, composed and performed by English singer-songwriter Ed Sheeran. It appears as the end-credit song for the film. It entered the UK Singles Chart at number 13 and reached number 1 in New Zealand on its sixth week, marking Sheeran's first number-one single in the country.\n\nChosen by The Hobbit director Peter Jackson, Sheeran saw the film, wrote the song, and recorded most of it on the same day. The song was released as a digital download on 5 November 2013. Its music video was released on the same day. The song has also since been nominated for a Satellite Award for Best Original Song.\n\nThe official music video for \"I See Fire\" premiered on 5 November 2013, along with the release of the song. The video shows Sheeran during the production of the song and Sheeran performing the song, as well as shots of the film. Peter Jackson stating, \"it was a great experience, and what you will see in this video are moments captured by our behind the scenes team during the creation of the song\".","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/qprrwy1488925389.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=uf8Fwiy0Bkc","strMusicVidDirector":"Peter Jackson","strMusicVidCompany":"","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"14570020","intMusicVidLikes":"132245","intMusicVidDislikes":"2375","intMusicVidFavorites":"0","intMusicVidComments":"6373","intTrackNumber":"16","intLoved":"1","intScore":"9.16667","intScoreVotes":"6","intTotalListeners":"443670","intTotalPlays":"4142393","strMusicBrainzID":"0a340ee9-1dd8-4b83-bae7-3e0893df0289","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"},{"idTrack":"33973991","idAlbum":"2212099","idArtist":"111611","idLyric":"0","idIMVDB":"0","strTrack":"All of the Stars","strAlbum":"x","strArtist":"Ed Sheeran","strArtistAlternate":null,"intCD":null,"intDuration":"237000","strGenre":"Pop","strMood":"Philosophical","strStyle":"Rock/Pop","strTheme":"...","strDescriptionEN":"\"All of the Stars\" is a song by British singer Ed Sheeran. It is one of the theme songs from The Fault in Our Stars, and as well as the first track of the soundtrack album, The Fault in Our Stars (Music from the Motion Picture). It also features as a bonus track on the physical deluxe edition of Sheeran's second studio album x (2014).\n\nThe music video was premiered on YouTube on 9 May 2014. The video does not feature any new footage from the movie, but it does feature fan-submitted messages of encouragement such as \"Everything is beautiful\" and \"You are not a burden\".","strTrackThumb":"https://www.theaudiodb.com/images/media/track/thumb/tvsusw1488925481.jpg","strTrack3DCase":null,"strTrackLyrics":"","strMusicVid":"https://www.youtube.com/watch?v=nkqVm5aiC28","strMusicVidDirector":"DJay Brawner","strMusicVidCompany":"Anthem Films","strMusicVidScreen1":null,"strMusicVidScreen2":null,"strMusicVidScreen3":null,"intMusicVidViews":"132287147","intMusicVidLikes":"850067","intMusicVidDislikes":"12096","intMusicVidFavorites":"0","intMusicVidComments":"22645","intTrackNumber":"17","intLoved":"1","intScore":"10","intScoreVotes":"2","intTotalListeners":null,"intTotalPlays":null,"strMusicBrainzID":"99fac5a2-06b1-41c2-b6e0-2ae946a4ddd5","strMusicBrainzAlbumID":"c24e5416-cd2e-4cff-851b-5faa78db98a2","strMusicBrainzArtistID":"b8a7c51f-362c-4dcb-a259-bc6e0095f0a6","strLocked":"unlocked"}]}