{"album":[{"idAlbum":"2109569","idArtist":"111233","idLabel":"45344","strAlbum":"Echoes, Silence, Patience & Grace","strAlbumStripped":"Echoes Silence Patience Grace","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2007","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"10000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/echoes-silence-patience--grace-4dd180eb9fbfb.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/vqswwu1534798725.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/echoes-silence-patience--grace-4dded50cd7f0e.png","strAlbumSpine":null,"strAlbum3DCase":"https://www.theaudiodb.com/images/media/album/3dcase/a5od261605172360.png","strAlbum3DFlat":"https://www.theaudiodb.com/images/media/album/3dflat/zma7l41605172378.png","strAlbum3DFace":"https://www.theaudiodb.com/images/media/album/3dface/wxtel01605172392.png","strAlbum3DThumb":"https://www.theaudiodb.com/images/media/album/3dthumb/jiuyhe1605172369.png","strDescriptionEN":"Echoes, Silence, Patience & Grace is the sixth studio album by alternative rock band Foo Fighters, released on September 25, 2007 by RCA Records. The album is noted for a blend of regular rock and acoustic rock tracks with shifting dynamics, which emerged from the variety of styles employed on the demos the band produced. It also marks the second time the band worked with producer Gil Norton, whom frontman Dave Grohl brought to fully explore the potential of his compositions and have a record that sounded different from their previous work. Grohl tried to focus on songs with messages that resonated on the audience, writing reflective lyrics which drew inspiration from the birth of his daughter.\n\nCritical reception to Echoes, Silence, Patience & Grace was mostly positive, with praise to the sonic variety and songwriting, though some reviewers found the record inconsistent and uninspired. The album topped the charts in the United Kingdom, Australia, New Zealand and Austria, and had three successful singles, \"The Pretender\", \"Long Road to Ruin\" and \"Let It Die\". Echoes, Silence, Patience & Grace was nominated for five Grammy Awards, winning Best Rock Album, and was also awarded the Brit Award of Best International Album.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"7.7","intScoreVotes":"3","strReview":"Upstaging Madonna at Live Earth, rocking out with half of Queen at Hyde Park, throwing down heartfelt notes to trapped miners, it's all in a day's work for your friendly neighbourhood Dave Grohl. Hell, this guy can even pull his mum up onstage in front of thousands of festival-goers and still look cool.\n\nYet it’s very easy to overlook what the former Nirvana sticksman has achieved musically over the last two years. The Foos are one of the biggest bands in the world right now but that's not to say they haven't had their critics. 2005's, In Your Honor, was decried by many as an exercise in self-indulgence. So in an effort to defy non-believers, the band have sandwiched that album’s finer ingredients into 12 eclectic tracks for their sixth album.\n\nIt kicks off with a huge stadium rock belter. \"The Pretender\" is your typical trademark Foos anthem; packed with the same hefty punch that made \"Best Of You\" and \"Monkey Wrench\" such classics. The Kurt and Courtney inspired \"Let It Die\", is an acoustic/electric number which morphs into stabbing guitars and Grohl's raucous yelp as he screeches: ‘Why do you have to go and let it die!’. It’s a familiar formula, but one the Foos are masters at.\n\nUnfortunately when Grohl et al do delve into pastures new it doesn't quite work. When the charismatic frontman kicks up a country storm on \"Summer's End\", it falls painfully short of the mark.\n\nThe same can be said for some of Echoes' acoustic numbers. The piano-driven '”\u009dStatues”\u009d sits uncomfortably with the album's finer rock moments while closer “Home”\u009d may come on like \"Next Year”\u009d’s distant cousin, but it plods along aimlessly. It’s only when Grohl teams up with jazz guitarist Kaki King for the finger plucking instrumental \"The Ballad Of The Beaconsfield Miners\" ”“ based on one of the trapped miners' request for an iPod full of Foo Fighter tunes - that we find ourselves applauding their experimental side.\n\nIn Echoes, Silence, Patience & Grace the Foos may have certainly tried to branch out and defy their critics. But there's no getting away from the fact that rocking out is what Dave Grohl is best at.","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"0ce4a1f2-7908-3865-8f19-08348546424a","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":"mw0000748803","strBBCReviewID":"66hj","strRateYourMusicID":"echoes__silence__patience_and_","strDiscogsID":"62208","strWikidataID":"Q752268","strWikipediaID":"Echoes,_Silence,_Patience_%26_Grace","strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2109570","idArtist":"111233","idLabel":"45344","strAlbum":"There Is Nothing Left to Lose","strAlbumStripped":"There Is Nothing Left to Lose","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"1999","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/yrvyqs1367232208.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/rvwvuq1534798608.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/there-is-nothing-left-to-lose-4dded66b0efc8.png","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"There Is Nothing Left to Lose is the third studio album by the Foo Fighters, released November 2, 1999. The album marks the first appearance of drummer Taylor Hawkins, and is often seen as a departure from the band's previous work, showcasing a softer, more experimental sound. In a 2006 interview, Dave Grohl states that the album is \"totally based on melody\" and that it \"might be his favorite album that they've ever done.\"\nEarly pressings of the disc included a temporary tattoo, similar to the one featured on the album cover. The album was also re-released in 2001 in Australia as a two-CD edition which offers a second VCD disc of four videos and one bonus track, \"Fraternity.\" This Australian edition has a picture of the Australian swimmer Michael Klim on the front, wearing the temporary \"FF\" tattoo on his shoulder. The album is widely available as an enhanced CD.\n\nThere Is Nothing Left to Lose won the Grammy Award for Best Rock Album in 2001, marking the group's first ever Grammy Award. The band would go on to win the Grammy for Best Rock Album for three of their next four studio releases, (One By One, Echoes, Silence, Patience & Grace, and Wasting Light).","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"5.8","intScoreVotes":"4","strReview":"","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"1cfc9a17-1fdb-30dd-83ca-dce93c481492","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":"mw0000670897","strBBCReviewID":null,"strRateYourMusicID":"there_is_nothing_left_to_lose","strDiscogsID":"62148","strWikidataID":"Q907605","strWikipediaID":"There_Is_Nothing_Left_to_Lose","strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2109571","idArtist":"111233","idLabel":"45344","strAlbum":"In Your Honor","strAlbumStripped":"In Your Honor","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2005","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"1","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/rppvxy1367232125.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/spxwtp1534798672.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/in-your-honor-disc-1-4ddec53196b26.png","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"In Your Honor is the fifth studio album by alternative rock band Foo Fighters, released on June 14, 2005 by RCA Records. It is a double album, with one disk containing heavy rock songs and a second disk with mellower acoustic songs. Frontman Dave Grohl decided to do a diverse blend of songs as he felt that after ten years of existence, the band had to break new ground with their music. The album was recorded on a newly built studio in Northridge, Los Angeles, and featured guests such as John Paul Jones, Norah Jones and Josh Homme. The lyrics dealt with both resonating and introspective themes, with a major influence from Grohl's involvement on the campaign trail with John Kerry during the 2004 presidential election.\n\nThe promotional tour for the album included both rock shows on stadiums and acoustic gigs on smaller venues. Reviews for In Your Honor were mostly positive, praising the composition and sound, although some critics found the album overly long and inconsistent. The album was also nominated for five Grammy Awards, and topped the charts in five countries - including Australia - and reached the top five in five more, including a number two on both the United States and the United Kingdom.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"7.3","intScoreVotes":"4","strReview":"The buzz surrounding In your Honour is palpable.\nA double album; one rock, one acoustic, it's an ambitious undertaking for a band like the Foo Fighters but the intrepid Grohl isn't concerned, hailing it their best album to date.\nThe single \"Best Of You\" was our first taste of what was to come and while the band came out of their corner fighting with a song full of Foo Fighters trademarks, the first punch fell short and failed to whip up the same frenzy as previous singles \"All My Life\" (2002) and \"Learn To Fly\" (1999).\nThankfully, \"In Your Honour\", the opening track on disk one, does what \"Best Of You\" should have and reminds the world what the band is capable of. A promising start, but in the same way \"One By One\" lost it's way after fifth track \"Disenchanted Lullaby\", this album also fails to maintain momentum.\n\"In Your Honour\" and \"No Way Back\" stick out like sore thumbs on a disk that, sadly, is pretty forgettable.\nDisk two is better and will undoubtedly prove to be the soundtrack to the summer for many. \"Cold Day In The Sun\" sees drummer Taylor Hawkins taking over vocal duties. The result is one of the album's best tracks and is as contagious as 1995's \"Big Me\".\nBut as poignant as this disk is, it suffers the same fate as the first, with only a few tracks lingering, particularly \"Friend Of A Friend\" and the infamous Norah Jones collaboration \"Virginia Moon\" which actually works surprisingly well.\nIn truth, In your Honour is disappointing because it doesn't live up to the hype. However, there are several songs on this double disk that stand head and shoulders above the rest and truly represent how the Foo Fighters have developed. It's just the songs in between that let the album down and despite declarations to the contrary, In your Honour doesn't surpass their debut or the sublime The Colour And The Shape.\nMaybe if they had just taken the best tracks from each disc and put them on one album they might have succeeded.","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"304479f9-ea77-3299-8745-3985f05cfa13","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":"mw0000208725","strBBCReviewID":"9jmq","strRateYourMusicID":null,"strDiscogsID":"62195","strWikidataID":"Q907592","strWikipediaID":"In_Your_Honor","strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2109572","idArtist":"111233","idLabel":"45344","strAlbum":"Foo Fighters","strAlbumStripped":"Foo Fighters","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"1995","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"2000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/mblre21605172447.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/qvtqpu1534798534.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/tu5jth1605172420.png","strAlbumSpine":null,"strAlbum3DCase":"https://www.theaudiodb.com/images/media/album/3dcase/yokuah1605172430.png","strAlbum3DFlat":"https://www.theaudiodb.com/images/media/album/3dflat/ao72m61605172455.png","strAlbum3DFace":"https://www.theaudiodb.com/images/media/album/3dface/dj7zgu1605172463.png","strAlbum3DThumb":"https://www.theaudiodb.com/images/media/album/3dthumb/uvdm9r1605172438.png","strDescriptionEN":"Foo Fighters is the debut album by American alternative rock band Foo Fighters, released on July 4, 1995 by Capitol Records through Dave Grohl's label Roswell. At the time, the only official member of the Foo Fighters was Grohl, who wrote and recorded the entire album himself - with the exception of a guest guitar spot by Greg Dulli - with the assistance of producer Barrett Jones at Robert Lang Studios in Seattle, Washington in 1994. Grohl claimed he recorded the album just for fun, describing it as a cathartic experience to recover from the death of his Nirvana bandmate Kurt Cobain.\nAfter Grohl completed the recordings, he picked up the name \"Foo Fighters\" to hide his identity and passed cassettes copies of the sessions to personal friends. After said tapes attracted record label interest, Grohl signed with Capitol and recruited a full band to perform the songs live. The album was promoted through extensive tours and six singles, two of which received music videos. Foo Fighters earned positive reviews praising the songwriting and performances, and was also a commercial success, becoming the band's second best-selling album in the United States and reaching the top five in the charts of United Kingdom, Canada, Australia and New Zealand.","strDescriptionDE":null,"strDescriptionFR":"Foo Fighters est le premier album du groupe américain de rock alternatif Foo Fighters, publié le 4 juillet 1995 par Capitol Records sur le label de Dave Grohl, Roswell Records. Unique membre du groupe de l'époque, il écrit et enregistre seul l'intégralité de l'album, en dehors de quelques passages interprétés à la guitare par Greg Dulli, avec l'aide de son ami producteur Barrett Jones aux Robert Lang Studios de Seattle en 1994. Initialement, Dave Grohl enregistre cet album uniquement dans le but de s'amuser, décrivant l'expérience comme un exutoire après le suicide de Kurt Cobain, leader emblématique de son ancien groupe Nirvana.\n\nC'est seulement à la fin de l'enregistrement que Dave Grohl décide d'intituler son travail, dont il donne des copies à ses amis. Capitol Records montrant un intérêt pour cette réalisation, il signe un contrat auprès du label et cherche des musiciens dans le but de jouer les chansons en concert. Six singles, dont deux avec clip vidéo, et d'intenses tournées permettent au groupe de promouvoir l'album, recevant par la suite des critiques positives, que ce soit sur l'écriture des chansons ou les performances sur scène. L'album est un succès, puisqu'il est le deuxième album du groupe le plus vendu aux États-Unis et entre dans le top 5 des classements des meilleures ventes au Royaume-Uni, au Canada, en Australie et en Nouvelle-Zélande.","strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":"Foo Fighters es el álbum debut de la banda homónima de rock alternativo. Fue editado en el año 1995 bajo la discográfica Capitol Records, a través del sello independiente Roswell Records, propiedad del líder de Foo Fighters, Dave Grohl.\n\nA pesar de que Grohl formó una banda después de grabar el álbum, él mismo tocó prácticamente todos los instrumentos en esta grabación. Lo conforman canciones que había escrito a lo largo de varios años, incluyendo el tiempo que estuvo en Nirvana. La grabación se realizó en ocubre de 1994, en el estudio de Robert Lang en Seattle bajo la producción de su amigo Barrett Jones. Este fue el mismo estudio en que nueve meses antes Nirvana grabó las sesiones de «You Know You're Right».\n\nEl álbum alcanzó el lugar número 3 en las listas de popularidad del Reino Unido y el número 23 en Estados Unidos, vendiendo más de un millón de copias.","strDescriptionPT":"Foo Fighters é o álbum de estreia da banda americana Foo Fighters, foi lançado no dia 4 de julho de 1995.\n\nTeve origem de uma fita demo que Dave Grohl fez, onde ele tocava todos os instrumentos.\n\nDave Grohl passou quatro anos como baterista da banda grunge Nirvana. Nesse período desenvolveu uma série de composições não divulgadas, uma forma de preservar a interação do grupo. Em contrapartida Dave gravou algumas demos em estúdio, sendo que algumas canções foram compiladas no álbum Pocketwatch, lançado com o pseudônimo \"Late!\", em 1992.\n\nApós a morte de Kurt Cobain em Abril de 1994, Grohl considerou abandonar a música, mas eventualmente resolveu gravar como \"experiência catártica\" suas composições. Em Outubro do mesmo ano, Grohl entrou no Robert Lang's Studio em Seattle com o amigo e produtor musical Barrett Jones. No espaço de uma semana, Grohl gravou as faixas cantando e tocando todos os instrumentos, com exceção de uma guitarra em \"X-Static\" por Greg Dulli do grupo americano Afghan Whigs. Para manter o anonimato, Grohl escolheu o nome \"Foo Fighters\" para criar a ilusão de que era uma banda em vez de \"aquele cara do Nirvana\".\n\nGrohl passou fitas das gravações para amigos, e eventualmente atraiu a atenção de gravadoras. Eventualmente um contrato foi assinado com a Capitol Records por Grohl conhecer o presidente Gary Gersh desde que ele era da gravadora do Nirvana. A fita se tornou o primeiro álbum do Foo Fighters, também intitulado Foo Fighters.\n\nPara divulgar o trabalho e tocar as músicas ao vivo, Grohl decidiu montar uma banda completa. Grohl chamou o guitarrista Pat Smear, que tocara no The Germs e era membro da banda de turnê do Nirvana, e após tomar conhecimento sobre o fim da banda conterrânea de rock alternativo Sunny Day Real Estate, convocou o baixista Nate Mendel e o baterista William Goldsmith. A banda realizou sua primeira turnê ainda em 1995 abrindo concertos para Mike Watt. O Foo Fighters tocaria cerca de 190 vezes ao longo de 1995 e 1996.\n\nSeu primeiro single \"This Is a Call\" foi lançado em junho de 1995, e o álbum de estréia no mês seguinte. \"I'll Stick Around\" e \"Big Me\" foram os singles lançados nos meses seguintes.","strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"7.3","intScoreVotes":"4","strReview":"","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"440c9ce8-8ce4-3103-a745-0b385ae70a34","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":"mw0000177195","strBBCReviewID":null,"strRateYourMusicID":"foo_fighters","strDiscogsID":"62100","strWikidataID":"Q735771","strWikipediaID":"Foo_Fighters_(album)","strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2109573","idArtist":"111233","idLabel":"45344","strAlbum":"The Colour and the Shape","strAlbumStripped":"The Colour and the Shape","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"1997","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"2000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/rtqvvx1367232246.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/wvtpvx1534798560.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/the-colour-and-the-shape-546490b8cd000.png","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"The Colour and the Shape is the Foo Fighters' second album. It was released on May 20, 1997, through Roswell. The album reached number three in the UK and number ten in the United States. The Colour and the Shape is the Foo Fighters' biggest U.S. seller, having sold over two million copies according to Nielsen SoundScan. The album is considered by many to be the band's magnum opus.\n\nThe album was in total nominated for five MTV Video Music Awards in 1997 and 1998, for the videos \"Monkey Wrench\" and \"Everlong\". It was also a Grammy Award nominee for Best Rock Album in 1998.\n\nThe album was the debut of Foo Fighters as a band, as frontman Dave Grohl had recorded all of the first album by himself with the exception of one guitar part by Greg Dulli. The Colour and the Shape was produced by Gil Norton, who was perhaps best known for his work with the Pixies. Norton was very demanding of the band's performance, eventually leading bassist Nate Mendel to enhance his musical formation. Grohl stated that he wanted to go back to the studio as \"we didn't want people to feel [the Foo Fighters] were just another side project.\" The songs on the record were composed during sound checks during the extensive touring that the band went through for the previous eighteen months. Over the course of the making of the album, Grohl's own marriage to photographer Jennifer Youngblood ultimately ended in divorce.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":"2","intScore":"8.3","intScoreVotes":"3","strReview":"Originally released in 1997, The Colour And The Shape marked Foo Fighters' coming of age. The follow-up to 1995's self-titled debut, it marked the first appearance of a whole band rather than just Dave Grohl, who'd played pretty much everything on the first album himself. And while the goodwill and smart tunes saw it succeed, The Colour And The Shape sounds fuller and more dynamic, especially under the auspicious production skills of Gil (Pixies) Norton, it gave the first indication that Foo Fighters could easily surpass the heights - and step out of the shadow of ”“ Dave's previous employers, Nirvana. \n\nOriginally meant as some loose concept album about the beginning and end of a relationship, Grohl's lyrics read in hindsight suggest a nice man tackling everyday issues, and who was laying his heart on the line. There is a sad undercurrent of loss and regret under some of the finest born-for-stadiums rock outs. The gentle strums of opener Doll offers a vulnerable moment before Monkey Wrench ignites and blasts off into orbit. Highlights such as powerhousing My Hero and the majestic Everlong rank among the band's classics and were the pathway to the band ultimately selling out Wembley for a couple of nights in 2008. \n\nIt's still, somewhat worryingly, their biggest selling album in America, where it was showered with nominations for VMAs and Grammys at the time. Over in the UK, it confirmed the beginnings of a beautiful relationship between the Foos and very large crowds. \n\nThe Colour And The Shape may have got somewhat lost in 1997's other significant albums, in what was a bit of a vintage year, however 12 years on, it sounds fresh as a singalong-in', lighters aloftin' metal-pop daisy.","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"7822977a-984d-358d-823f-426139c0eaba","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":"mw0000088006","strBBCReviewID":"5df9","strRateYourMusicID":"the_colour_and_the_shape","strDiscogsID":"62129","strWikidataID":"Q968646","strWikipediaID":"The_Colour_and_the_Shape","strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":"Colour_and_the_Shape,_The","strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2109574","idArtist":"111233","idLabel":"45344","strAlbum":"Wasting Light","strAlbumStripped":"Wasting Light","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2011","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"1064000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/rpppuw1367231809.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/xyyusp1534798775.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/wasting-light-4dd44a0bbcb41.png","strAlbumSpine":"https://www.theaudiodb.com/images/media/album/spine/vvvryp1537029188.jpg","strAlbum3DCase":"https://www.theaudiodb.com/images/media/album/3dcase/rtrxrr1537029081.png","strAlbum3DFlat":"https://www.theaudiodb.com/images/media/album/3dflat/qyvxwq1537029063.png","strAlbum3DFace":"https://www.theaudiodb.com/images/media/album/3dface/ywtusy1537029073.png","strAlbum3DThumb":null,"strDescriptionEN":"Wasting Light is the seventh studio album by American alternative rock band Foo Fighters. It was released on April 12, 2011 on RCA Records. As frontman Dave Grohl wanted a record that would capture the essence of the band's earlier work and lack the artificiality of digital recording, the group recorded in Grohl's garage in Encino, California with only analog equipment. The sessions were supervised by producer Butch Vig, with whom Grohl had worked on Nirvana's Nevermind. Since the old equipment did not allow for many mistakes to be corrected in post-production, the band spent three weeks rehearsing the songs, and Vig had to relearn outdated editing techniques. The band went for a heavier and rawer sound to contrast with the musical experiments in the previous albums, and most of the lyrics were written as Grohl reflected upon his life and possible future. Guest musicians include Bob Mould, Krist Novoselic, and Fee Waybill.\nThe recording sessions were documented for fans on the band's website and Twitter, and the album's promotion included the documentary Back and Forth and a worldwide concert tour that included concerts played in fans' garages. Wasting Light was preceded by the successful single \"Rope\", which became only the second song ever to debut at number one on Billboard's Rock Songs chart, and follow-up \"Walk\" also charted highly. The album was a commercial success, debuting at number one in eleven countries, and it received positive reviews from most music critics, who complimented its production and the band's songwriting. In 2012, Wasting Light and its songs earned Foo Fighters four Grammy Awards, including Best Rock Album.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"7.3","intScoreVotes":"6","strReview":"In December last year the Foo Fighters managed to sell 110,000 tickets for two upcoming summer concerts at the National Bowl in Milton Keynes in less time than it would take to eat a bowl of cereal. More than Green Day, more, even, than Muse, it seems that the claim to the title of Britain’s Favourite Rock Band lies with Dave Grohl’s band of merry everymen. This is no small beer, especially when one considers that even the group’s staunchest of admirers would surely be pressed to nominate any of their previous albums as being classics in the manner of Absolution or American Idiot.\nWasting Light, the Foo Fighters’ seventh studio album, is not a release that is likely to alter this state of affairs. Despite a number of headline-grabbing developments ”“ the album features contributions from former Nirvana bassist Krist Novoselic and erstwhile HÃ¼sker DÃ¼ great Bob Mould, as well as being produced by Nevermind’s Butch Vig ”“ and a quite brilliant viral marketing campaign (where last-minute club shows were furtively revealed on the band’s website, alongside a clip of the group being chauffeured around Los Angeles by MotÃ¶rhead’s Lemmy), beneath all the froth, really this is more of the same. Perhaps this is to be expected; only the rarest of bands re-invent themselves seven albums in. All of this can be distilled down to the rather stale observation that if you liked this band’s work before, chances are you’ll like this.\nWasting Light does feature a number of terrific songs. The rousing I Should Have Known and the gorgeous Arlandria are among the best Grohl has written, while the noisy and messy White Limo could well become an unlikely hit sing-along in the manner of the Beastie Boys’ Sabotage. But as with some other Foo Fighters albums, the sense is that a number of the compositions featured here serve no greater purpose than making up numbers, and that a composition such as the ordinary Miss the Misery, to name just one, will not be played live and will never be heard from again.\nAdvance word on Wasting Light is strong, with a number of its creators’ devotees describing the set as being the group’s best album since 1997’s The Colour and the Shape. Really, though, this is nothing more than business as usual: some killer, some filler.","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"91825bcf-e51d-4357-986c-ac2a49b4d205","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":"mw0002115022","strBBCReviewID":"gh3q","strRateYourMusicID":"wasting_light","strDiscogsID":"326257","strWikidataID":"Q521826","strWikipediaID":"Wasting_Light","strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2109575","idArtist":"111233","idLabel":"45344","strAlbum":"One by One","strAlbumStripped":"One by One","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2002","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"1300000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/vtyytx1367232196.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/yrypuu1534798634.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/f9su4u1605172489.png","strAlbumSpine":null,"strAlbum3DCase":"https://www.theaudiodb.com/images/media/album/3dcase/y06lne1605172499.png","strAlbum3DFlat":"https://www.theaudiodb.com/images/media/album/3dflat/jwo34t1605172512.png","strAlbum3DFace":"https://www.theaudiodb.com/images/media/album/3dface/hpivif1605172521.png","strAlbum3DThumb":"https://www.theaudiodb.com/images/media/album/3dthumb/932zlz1605172506.png","strDescriptionEN":"One by One is the fourth studio album by alternative rock band Foo Fighters, released on October 22, 2002 by RCA. The album is the first to feature guitarist Chris Shiflett. Production on the album was troubled, with initial recording sessions considered unsatisfying and raising tensions between the band members. They eventually decided to redo the album from scratch during a two week period at frontman Dave Grohl's home studio in Alexandria, Virginia. The songs on the album, which include the successful singles \"All My Life\" and \"Times Like These\", have been noted for their introspective lyrics and a heavier and more aggressive sound compared to the band's earlier work, which Grohl said was intended to translate the energy of the Foo Fighters' live performances into a recording.\n\nThe album was a commercial success, topping the charts in Australia, Ireland and the United Kingdom and sold over one million copies in the United States. One by One was positively received by critics, winning a Grammy Award for Best Rock Album in 2004 and praised for its sound and production. However, some considered the work inferior to the band's previous albums, and the musicians themselves eventually grew distasteful of the record as a whole.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"7.8","intScoreVotes":"4","strReview":"You can't help feeling that Dave Grohl is a contender rather than a heavy weight champion. He can land the odd killer punch; he's disciplined, professional and has bags of energy and commitment. But maybe he lacks the touch of insanity or genius that you need to make a really classic rock album.\nOne By One starts brilliantly. First track \"All My Life\" must be the best thing he's ever done. With its atmosphere of claustrophobic sex, ghosts and frustration it sounds like some personal demons are being cast out. It's manic, tight and the guitars sound fabulous. It reaches deeper than the entertaining but lightweight pop grunge that the Foo Fighters have delivered up to now. And when the churning \"Low\" is followed by the high energy of \"Have It All\" and The Byrds meets Husker Du rush of \"Times Like These\" things are set up for a knockout victory.\nUnfortunately they can't maintain this quality. Queen's Brian May adds some of his usual wailing guitar to \"Tired of You\". It sounds out of place and can't disguise the poor quality of the song. Grohl's lyrics sometimes let him down. And while \"Lonely As You\" packs a pretty hefty punch, \"Overdrive\" seems pretty inessential and \"Burn Away\" lumbers along. The final track \"Come Back\" is an epic that strains for classic status but sadly it doesn't quite come off.\nThere's about half a fantastic album here. Foo fans will love it. But so far Dave Grohl's best music has been made with or for other people. It's tough to say it but One by One doesn't change that. If Queens of the Stone Age had made room on their album for the best songs here we really would be talking about rock heaven. For now One By One is good, but it leaves you feeling just a little frustrated.\n\nby Nick Reynolds 2002-11-20","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"a9f6787f-0c0b-39e2-aaf7-befba34727b4","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":"mw0000223679","strBBCReviewID":"2rf9","strRateYourMusicID":"one_by_one","strDiscogsID":"62175","strWikidataID":"Q907578","strWikipediaID":"One_by_One_(Foo_Fighters_album)","strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2113724","idArtist":"111233","idLabel":"45344","strAlbum":"Greatest Hits","strAlbumStripped":"Greatest Hits","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2009","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Compilation","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/qssuvs1367231984.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/greatest-hits-4dded7a799d17.png","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"Greatest Hits is a compilation album released by American rock band the Foo Fighters on November 3, 2009.\n\nGreatest Hits includes a selection of Foo Fighters hit singles. Two singles from their 1995 debut, Foo Fighters album (\"This Is a Call\" and \"Big Me\") are included. Three singles are included from 1997's The Colour and the Shape album (\"Monkey Wrench\", \"Everlong\" and \"My Hero\"). The Colour and the Shape remains the band's biggest selling album in the US. Two singles are included from 1999's There Is Nothing Left to Lose album (\"Learn to Fly\" and \"Breakout\") as are two singles from 2002's One by One album (\"All My Life\" and \"Times Like These\"). Surprisingly only one single (\"Best of You\") is included from the band's biggest world wide selling album In Your Honor, released in 2005. \"Best of You\" remains the band's highest charting hit on the US, UK and Australian singles charts. Two singles are included from 2007's Echoes, Silence, Patience & Grace album (\"The Pretender\" and \"Long Road to Ruin\"). Greatest Hits also contains two new songs \"Wheels\" and \"Word Forward\".\n\n\"Wheels\" is the first single taken from the album, which premiered on radio on September 23, 2009. The single was officially released on September 29, 2009. \"Wheels\" and \"Word Forward\", which was written for Dave Grohl's friend, Jimmy, who had recently died, were composed during the Echoes, Silence, Patience & Grace tour and recorded specifically for the compilation with producer Butch Vig.\n\nA deluxe edition of the compilation includes a book and a DVD featuring some of the band's music videos and live performances. It also includes a video for \"Wheels\" directed by Sam Brown, who also worked on \"The Pretender\".","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"8.3","intScoreVotes":"3","strReview":"A greatest hits set is a perfect vehicle for the talents of Dave Grohl. The former Nirvana drummer has always exhibited a fine ear for enormous pop hooks, and with the Foo Fighters has enjoyed considerable chart success. But the last truly great album he appeared on was, inarguably, In Utero.\nGrohl was intimidated by Kurt Cobain’s writing for Nirvana ”“ though he’d pen songs, he kept them to himself ”“ but when the frontman committed suicide in 1994 Grohl struck out alone rather than man the kit for another group. Using the name Foo Fighters in an attempt to embrace anonymity, Grohl’s first recordings stirred enough label interest to necessitate a stepping out from the shadows. A collection of what were little more than demos became the first Foo Fighters album, a band was formed to take the songs on tour (featuring half of Sunny Day Real Estate), and the rest, as they say, is history.\nAnd here is that history ”“ or at least 13 tracks of it, along with a couple of new songs and a solo acoustic take on fan-favourite Everlong (the studio version appears, too). These are big songs, full of cracking choruses; they are, at their centres, loud and proud pop songs dressed up as rock numbers simply because of the amplification addictions of individuals involved. Over the course of a full album the Foos can drag ”“ 1997’s The Colour and the Shape may be the exception ”“ but here the four-piece never allow attentions or affections to wander. It’s a perfect greatest hits set ”“ all the songs you recognise, without any of those pesky numbers that never made it to radio. It’s a bluffer’s guide, Foo Fighters for Dummies, and there’s no problem with that at all.\nBut who does it appeal to? The Foos have sold millions of albums already, and two new tracks ”“ Wheels and Word Forward ”“ will be downloaded separately by many. With Christmas around the corner, Greatest Hits is positioned as a fine stocking filler for a younger brother or sister just beginning to get interested in rock music ”“ the MTV variety, assuming the channel plays videos these days. Long-term fans will appreciate the ‘how to multitrack at home’ notes from Grohl, but said attraction aside this is straight-up Foos 101, best appreciated by fair-weather followers and absolute beginners.","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"edc167ea-ca3e-4178-9f2e-f43d62b19380","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2113805","idArtist":"111233","idLabel":"45344","strAlbum":"Skin and Bones","strAlbumStripped":"Skin and Bones","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2006","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Live","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/yrtrty1367232105.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/skin-and-bones-4f27142fe2b7b.png","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"Skin and Bones is a live acoustic album by Foo Fighters released on November 7, 2006. The 15-track set was recorded on August 29, 30 and 31, 2006 at the Pantages Theater in Los Angeles and spotlights an expanded eight-piece lineup featuring violinist/singer Petra Haden, former Germs/Nirvana/Foo Fighters guitarist Pat Smear, Wallflowers keyboardist Rami Jaffee, and percussionist Drew Hester. Haden and Jaffee had appeared as guest musicians on the band's previous studio album, In Your Honor. A three-song encore consists of Grohl's solo performances of \"Friend of a Friend\", \"Best of You\", and \"Everlong\". The album debuted at number 21 on the Billboard 200, selling about 49,000 copies in its first week. This was also the album's peak position on the chart.\n\nA DVD of the original shows, featuring a total of 21 songs, was released on November 28, 2006. It was directed by Danny Clinch, who appears briefly on-stage to play harmonica on the song Another Round, reprising the contribution he made to the original album recording of the song for In Your Honor. The UK version of the release is a two-disc set including the band's 2006 (electric) performance at Hyde Park.\n\nThe title song was previously released as a B-side on the single \"DOA\", and was included on the EP \"Five Songs and a Cover\".","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"10","intScoreVotes":"1","strReview":"","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"578a8246-a9e7-35cb-b7e9-bb799aba44cc","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2114554","idArtist":"111233","idLabel":"45344","strAlbum":"Live at Wembley Stadium","strAlbumStripped":"Live at Wembley Stadium","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2008","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"VideoAlbum","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/srvwxu1367232049.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"Live at Wembley Stadium is a live video by the Foo Fighters, released on August 22, 2008, in Ireland and August 25, 2008, in the UK on DVD. It was also released in Australia on August 30, New Zealand on September 1, and Germany, Austria and Switzerland on September 5. It was released in the United States on November 18, 2008.\n\nIt was filmed during the band's two sold out shows at Wembley Stadium on Friday June 6 and Saturday June 7, 2008. The video features a combination of footage from both nights, including the second night's collaboration with special guests, Led Zeppelin members John Paul Jones (bass guitar) and Jimmy Page (guitar).\nThe video was also broadcast via satellite across the UK at Vue Cinemas on June 24, 2008. The video was shown in high definition with 5.1 surround sound, and was the same cut as the video release.\n\nThe image on the artwork was shot by the aerial camera above the crowd on Friday 6 June.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"10","intScoreVotes":"1","strReview":"","strMood":"Energetic","strTheme":"Party","strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"0c437c9c-3b61-4f82-a792-e5555e6a910a","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2157946","idArtist":"111233","idLabel":"45344","strAlbum":"Five Songs and a Cover","strAlbumStripped":"Five Songs and a Cover","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2005","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"EP","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/swywvv1367232166.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"Five Songs and a Cover (A.K.A. 4 Stars) is an EP released by the Foo Fighters in 2005. Released on November 20, 2005, it was exclusively distributed to Best Buy retail stores.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":"","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"9c353f3e-b519-378f-82a0-95b53f720e4f","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2192931","idArtist":"111233","idLabel":"45344","strAlbum":"Quiet before the Storm","strAlbumStripped":"Quiet before the Storm","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2005","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Live","intSales":"0","strAlbumThumb":null,"strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescription":null,"strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":"","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"c8162b57-352e-491b-851b-7c8fbc359c28","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2219903","idArtist":"111233","idLabel":"45344","strAlbum":"Sonic Highways","strAlbumStripped":"Sonic Highways","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2014","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/sonic-highways-53f7755b42c87.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/wrpupw1534798794.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/sonic-highways-54a0011ea36a2.png","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"Sonic Highways is the eighth studio album by the American rock band Foo Fighters, scheduled for release on November 10, 2014, through RCA Records. As part of a companion HBO television series, Foo Fighters Sonic Highways, the band recorded eight songs for the album, each in a different US city: Austin, Chicago, Los Angeles, Nashville, New Orleans, New York, Seattle, and Washington, D.C. It will be available on CD, vinyl and as a digital download. The album's lead single \"Something from Nothing\" was released on October 16, 2014.\nDespite initially announcing a break after supporting Wasting Light, Grohl later stated in January 2013 that the band had started writing material for an eighth studio album. On February 20, 2013, at the Brit Awards, Grohl said he was flying back to America the following day to start work on the next album. In an August 2013 interview with XFM, Grohl announced that their next album has been slated for a 2014 release, saying:\n\n\"Well, I’ll tell you, we have been in our studio writing and in the past few weeks we’ve written an album and we are going to make this album in a way that no-one’s ever done before and we’re pretty excited about it... It’s a little ways off – it’s not ready to happen right now – but I think next year is going to be a really big year for the Foo Fighters, without question.\"\n\nAccording to lead guitarist Chris Shiflett, Grohl would finish the lyrics just before recording his vocals, the last part of each song. This time the compositions would drift away from \"love letters and confused relationships\" to deal with the feelings Grohl had regarding each city during production.\nOn September 6, 2013, lead guitarist Chris Shiflett posted a photo to his Instagram account that had indicated 13 songs were being recorded for the album. Keyboardist Rami Jaffee has recorded parts for three songs, one of which is entitled \"In The Way.\" Butch Vig, who produced the band's prior album, Wasting Light, confirmed he produced Sonic Highways as well. On July 30, 2014, Vig revealed that the band had finished recording and mixing the new album and it is slated to be released a month after the Sonic Highways TV series. In an August 2014 press release Grohl spoke about the album, saying: \"This album is instantly recognizable as a Foo Fighters record, but there's something deeper and more musical to it. I think that these cities and these people influenced us to stretch out and explore new territory, without losing our ‘sound’.\"","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":"1","intScore":"6.8","intScoreVotes":"6","strReview":"","strMood":"Energetic","strTheme":"","strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"9908fab7-baf6-4438-b82c-298bd2c18d98","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":"mw0002720414","strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":"746528","strWikidataID":"Q17151253","strWikipediaID":"Sonic_Highways","strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2225502","idArtist":"111233","idLabel":"45344","strAlbum":"Medium Rare","strAlbumStripped":"Medium Rare","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2011","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Other","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/medium-rare-53fdceacd4423.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/medium-rare-4dded9c96551d.png","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"Medium Rare is a covers album by Foo Fighters. The album was released on April 16, 2011 as a limited-edition vinyl for Record Store Day, an event that celebrates independent record stores. Apart from the new recordings of \"Bad Reputation\" and \"This Will Be Our Year\" and the live version of \"Young Man Blues\", all tracks have been previously released as B-sides or in other compilation albums.\nA CD edition of the album was also given free to new subscribers of Q magazine for a limited time, with the song \"Darling Nikki\" omitted.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"5","intScoreVotes":"1","strReview":"","strMood":"Energetic","strTheme":"","strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"7ae0a614-a3c7-44ab-9d1e-30917c646cc3","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2225503","idArtist":"111233","idLabel":"45344","strAlbum":"The Wireless","strAlbumStripped":"The Wireless","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"1992","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Compilation","intSales":"0","strAlbumThumb":null,"strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescription":null,"strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":"","strMood":"Energetic","strTheme":"","strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"e0c2329d-a095-3ad4-a5d2-3c4b7c49fd74","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2251744","idArtist":"111233","idLabel":"45344","strAlbum":"2007-08-17: BBC Radio 1, Brighton, England, UK","strAlbumStripped":"20070817 BBC Radio 1 Brighton England UK","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"0","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Live","intSales":"0","strAlbumThumb":"","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescription":null,"strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":"","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"db8b41ec-41ed-41d0-beb1-ff78167b1884","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2251745","idArtist":"111233","idLabel":"45344","strAlbum":"Live at Roswell","strAlbumStripped":"Live at Roswell","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2005","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Live","intSales":"0","strAlbumThumb":"","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescription":null,"strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":"","strMood":"Energetic","strTheme":null,"strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"31879903-f0cd-36b9-8b93-283118640ea0","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2251746","idArtist":"111233","idLabel":"45344","strAlbum":"Everywhere But Home","strAlbumStripped":"Everywhere But Home","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2003","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Other","intSales":"0","strAlbumThumb":"","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescription":null,"strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":"","strMood":"Energetic","strTheme":"","strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"f0eae3c6-a8e4-4047-8bc6-b92b31444399","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2251747","idArtist":"111233","idLabel":"45344","strAlbum":"Brain Damage","strAlbumStripped":"Brain Damage","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2001","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Other","intSales":"0","strAlbumThumb":"","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescription":null,"strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":"","strMood":"Energetic","strTheme":"","strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"8ecf91bb-d4b0-358e-aaba-b4ece1478057","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2280757","idArtist":"111233","idLabel":null,"strAlbum":"Saint Cecilia EP","strAlbumStripped":"Saint Cecilia EP","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2015","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":null,"strReleaseFormat":"EP","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/saint-cecilia-573100f6c6c2d.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":"","strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescriptionEN":"Saint Cecilia is an EP by American rock band Foo Fighters. It was released as a free download on November 23, 2015. Initially intended as a sign of gratitude to the group's fans, the EP was also dedicated to the victims of the terrorist attacks in Paris.\n\nThe vinyl version of the Saint Cecilia EP was released on February 19, 2016.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":"","strMood":"Energetic","strTheme":"","strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"aca2b2b2-05ba-44f6-bde5-5e1f1ad7af82","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2284967","idArtist":"111233","idLabel":"45344","strAlbum":"Concrete and Gold","strAlbumStripped":"Concrete and Gold","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2017","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/cm7hct1605172297.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/tsyqtw1534798822.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/dniabw1605172325.png","strAlbumSpine":null,"strAlbum3DCase":"https://www.theaudiodb.com/images/media/album/3dcase/fgc4541605172245.png","strAlbum3DFlat":"https://www.theaudiodb.com/images/media/album/3dflat/5798se1605172307.png","strAlbum3DFace":"https://www.theaudiodb.com/images/media/album/3dface/ylown61605172334.png","strAlbum3DThumb":"https://www.theaudiodb.com/images/media/album/3dthumb/g0j4cb1605172257.png","strDescriptionEN":"\"Concrete and Gold\"  is the ninth studio album by American rock band Foo Fighters. It was released on September 15, 2017 on the RCA label.   The album's first single, \"Run\", was released on June 1, 2017, and topped the US Billboard Mainstream Rock Songs chart the following month. \nConcrete and Gold received generally positive reviews from critics. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the album has an average score of 73 out of 100, which indicates \"generally favorable reviews\" based on 11 reviews.","strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":"7.4","intScoreVotes":"5","strReview":"In the review for AllMusic, editor Stephen Thomas Erlewine concluded that \"Foo Fighters show that they're in love with light and shade, fury and quiet, every twist and turn they can make with their instruments, and even if Concrete And Gold isn't about much more than that, it's refreshing to hear the Foos embrace to the logical flashing conclusion of Grohl's allegiance to real rock values.\n","strMood":"Energetic","strTheme":"","strSpeed":"Medium","strLocation":null,"strMusicBrainzID":"e0335c44-58cd-433c-86d3-e114b14b7111","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":"mw0003068709","strBBCReviewID":null,"strRateYourMusicID":"concrete-and-gold","strDiscogsID":"1234880","strWikidataID":"Q30348676","strWikipediaID":"Concrete_and_Gold","strGeniusID":"Concrete-and-gold","strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2349353","idArtist":"111233","idLabel":null,"strAlbum":"2000-05-16: The Howard Stern Show: New York, NY, USA","strAlbumStripped":"20000516 The Howard Stern Show New York NY USA","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2000","strStyle":null,"strGenre":null,"strLabel":null,"strReleaseFormat":"Live","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/flstro1598652009.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":null,"strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescription":null,"strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":null,"strMood":null,"strTheme":null,"strSpeed":null,"strLocation":null,"strMusicBrainzID":"c7f26896-31b2-4c55-8736-725c0b83e873","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"},{"idAlbum":"2352415","idArtist":"111233","idLabel":null,"strAlbum":"2020-11-07: Saturday Night Live, New York, NY, USA","strAlbumStripped":"20201107 Saturday Night Live New York NY USA","strArtist":"Foo Fighters","strArtistStripped":"Foo Fighters","intYearReleased":"2020","strStyle":null,"strGenre":null,"strLabel":null,"strReleaseFormat":"Live","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/pvfx6t1605144911.jpg","strAlbumThumbHQ":null,"strAlbumThumbBack":null,"strAlbumCDart":null,"strAlbumSpine":null,"strAlbum3DCase":null,"strAlbum3DFlat":null,"strAlbum3DFace":null,"strAlbum3DThumb":null,"strDescription":null,"strDescriptionDE":null,"strDescriptionFR":null,"strDescriptionCN":null,"strDescriptionIT":null,"strDescriptionJP":null,"strDescriptionRU":null,"strDescriptionES":null,"strDescriptionPT":null,"strDescriptionSE":null,"strDescriptionNL":null,"strDescriptionHU":null,"strDescriptionNO":null,"strDescriptionIL":null,"strDescriptionPL":null,"intLoved":null,"intScore":null,"intScoreVotes":null,"strReview":null,"strMood":null,"strTheme":null,"strSpeed":null,"strLocation":null,"strMusicBrainzID":"6e8046ad-3b46-4ffd-84f8-683da7c928d1","strMusicBrainzArtistID":"67f66c07-6e61-4026-ade5-7e782fad3a5d","strAllMusicID":null,"strBBCReviewID":null,"strRateYourMusicID":null,"strDiscogsID":null,"strWikidataID":null,"strWikipediaID":null,"strGeniusID":null,"strLyricWikiID":null,"strMusicMozID":null,"strItunesID":null,"strAmazonID":null,"strLocked":"unlocked"}]}