{"album":[{"idAlbum":"2109574","idArtist":"111233","idLabel":"45344","strAlbum":"Wasting Light","strArtist":"Foo Fighters","intYearReleased":"2011","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"1064000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/rpppuw1367231809.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/xyyusp1534798775.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/wasting-light-4dd44a0bbcb41.png","intScore":"7.3","strDescriptionEN":"Wasting Light is the seventh studio album by American alternative rock band Foo Fighters. It was released on April 12, 2011 on RCA Records. As frontman Dave Grohl wanted a record that would capture the essence of the band's earlier work and lack the artificiality of digital recording, the group recorded in Grohl's garage in Encino, California with only analog equipment. The sessions were supervised by producer Butch Vig, with whom Grohl had worked on Nirvana's Nevermind. Since the old equipment did not allow for many mistakes to be corrected in post-production, the band spent three weeks rehearsing the songs, and Vig had to relearn outdated editing techniques. The band went for a heavier and rawer sound to contrast with the musical experiments in the previous albums, and most of the lyrics were written as Grohl reflected upon his life and possible future. Guest musicians include Bob Mould, Krist Novoselic, and Fee Waybill.\nThe recording sessions were documented for fans on the band's website and Twitter, and the album's promotion included the documentary Back and Forth and a worldwide concert tour that included concerts played in fans' garages. Wasting Light was preceded by the successful single \"Rope\", which became only the second song ever to debut at number one on Billboard's Rock Songs chart, and follow-up \"Walk\" also charted highly. The album was a commercial success, debuting at number one in eleven countries, and it received positive reviews from most music critics, who complimented its production and the band's songwriting. In 2012, Wasting Light and its songs earned Foo Fighters four Grammy Awards, including Best Rock Album."}]}
