{"album":[{"idAlbum":"2109618","idArtist":"111239","idLabel":"45114","strAlbum":"X&Y","strArtist":"Coldplay","intYearReleased":"2005","strStyle":"Rock/Pop","strGenre":"Pop-Rock","strLabel":"Parlophone","strReleaseFormat":"Album","intSales":"12000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/xy-4ea02a5208fd0.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/ttrwtu1429177433.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/qrwyvp1429179558.png","intScore":"8.4","strDescriptionEN":"X&Y is the third studio album by British rock band Coldplay, released 6 June 2005 in the United Kingdom via the record label Parlophone. The album, which features influences of electronic music, was produced by the band and British record producer Danton Supple. Development of the album was often troubled; the album's original producer, British record producer Ken Nelson, was supposed to produce much of the album, however, many songs written during their sessions were ditched due to the band's dissatisfaction. The album's cover art is a combination of colours and blocks, which is a representation of the Baudot code.\n\nThe album contains twelve tracks and an additional hidden track, \"Til Kingdom Come\". It is omitted from the track listing on the album sleeve, but listed as \"+\" on the disc label and inside the album booklet. It was originally planned for American singer-songwriter Johnny Cash to record it with Martin, but Cash died before he was able to do so. The song \"Talk\" appeared on the main track listing, although it was thought to have been downgraded to a B-side for the album's subsequent single releases, after it leaked online in early 2005.\n\nOriginally titled Zero Theory, X&Y was released after a considerable amount of hype and was a significant commercial success, reaching the top spot of many charts worldwide, including the United Kingdom and United States, the latter being their first. With accumulated sales of 8.3 million units in 2005 alone, X&Y was the best-selling album released in 2005 worldwide. The album has sold over 12 million copies worldwide.\n\nOverall reaction to the album has been generally positive, though some critics cited it as being inferior to its predecessors. The album has spawned the singles \"Speed of Sound\", \"Fix You\", \"Talk\", \"The Hardest Part\", and \"White Shadows\"."}]}
