{"album":[{"idAlbum":"2109573","idArtist":"111233","idLabel":"45344","strAlbum":"The Colour and the Shape","strArtist":"Foo Fighters","intYearReleased":"1997","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"2000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/rtqvvx1367232246.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/wvtpvx1534798560.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/the-colour-and-the-shape-546490b8cd000.png","intScore":"8.3","strDescriptionEN":"The Colour and the Shape is the Foo Fighters' second album. It was released on May 20, 1997, through Roswell. The album reached number three in the UK and number ten in the United States. The Colour and the Shape is the Foo Fighters' biggest U.S. seller, having sold over two million copies according to Nielsen SoundScan. The album is considered by many to be the band's magnum opus.\n\nThe album was in total nominated for five MTV Video Music Awards in 1997 and 1998, for the videos \"Monkey Wrench\" and \"Everlong\". It was also a Grammy Award nominee for Best Rock Album in 1998.\n\nThe album was the debut of Foo Fighters as a band, as frontman Dave Grohl had recorded all of the first album by himself with the exception of one guitar part by Greg Dulli. The Colour and the Shape was produced by Gil Norton, who was perhaps best known for his work with the Pixies. Norton was very demanding of the band's performance, eventually leading bassist Nate Mendel to enhance his musical formation. Grohl stated that he wanted to go back to the studio as \"we didn't want people to feel [the Foo Fighters] were just another side project.\" The songs on the record were composed during sound checks during the extensive touring that the band went through for the previous eighteen months. Over the course of the making of the album, Grohl's own marriage to photographer Jennifer Youngblood ultimately ended in divorce."}]}
