{"album":[{"idAlbum":"2109617","idArtist":"111239","idLabel":"46413","strAlbum":"Viva la Vida or Death and All His Friends","strArtist":"Coldplay","intYearReleased":"2008","strStyle":"Rock/Pop","strGenre":"Pop-Rock","strLabel":"Atlantic","strReleaseFormat":"Album","intSales":"10000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/urvvxq1367234034.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/tvptxx1429192735.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/wxsuvy1429182454.png","intScore":"7.2","strDescriptionEN":"Viva la Vida or Death and All His Friends, often referred to as simply Viva la Vida is the fourth studio album by British rock band Coldplay, released on 11 June 2008 on Parlophone. The album was named after a Spanish phrase that translates in English as \"long live life\". Lyrically, the album contains references to love, life, death, and war.\nRecording sessions for the album took place during June 2007 to April 2008 and featured production by Jon Hopkins, Rik Simpson, Markus Dravs and Brian Eno. The album was the first to be produced by the latter. The band forced themselves to explore experimental styles, as Eno required every song on the album to sound different, and expanded their musical interests while recording Viva la Vida. The band wanted to make the album shorter than 42 minutes. As a result, the album is longer than the length they intended. Development of the album delayed the release date several times.\nViva la Vida was both a critical and commercial success. Five singles have been released in promotion of the album; \"Violet Hill\" and \"Viva la Vida\" in May 2008, \"Lovers in Japan\" and \"Lost!\" in November 2008, and \"Strawberry Swing\" in September 2009. \"Viva la Vida\" became the band's first song to reach number one in both the United States and the United Kingdom. It won Best Rock Album at the 2009 Grammy Awards and was also nominated for Album of the Year. \nIt was the best selling album of 2008. To date, the album has sold more than 10 million copies. Viva la Vida was re-released on 25 November 2008 in a deluxe edition containing the original album and the Prospekt's March EP."}]}
