{"album":[{"idAlbum":"2109614","idArtist":"111239","idLabel":"45114","strAlbum":"A Rush of Blood to the Head","strArtist":"Coldplay","intYearReleased":"2002","strStyle":"Rock/Pop","strGenre":"Pop-Rock","strLabel":"Parlophone","strReleaseFormat":"Album","intSales":"15000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/vsusvs1521243711.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/uyswus1429191734.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/vuyruy1429191547.png","intScore":"8.4","strDescriptionEN":"A Rush of Blood to the Head is the second studio album by British alternative rock band Coldplay. Released on 26 August 2002 in the UK through the label Parlophone, the album was produced by the band and British record producer Ken Nelson. Recording started after the band became popular worldwide with the release of their debut album, Parachutes, and one of its singles in particular, \"Yellow\". Attitudes to songwriting were affected by the September 11 attacks in the United States, which occurred the week before recording started. The songs featured in the album have a greater use of piano and electric guitar than its predecessor.\n\nThe album was made available in August 2002, two months after its original planned release date. It was released on 27 August in the United States through Capitol Records. Capitol released a remastered version of the album in 2008 on a 180-gram vinyl record as part of the \"From the Capitol Vaults\" series. The album debuted and continued their huge commercial legacy, an ongoing pattern that began with Parachutes which made Coldplay one of the best-selling bands worldwide. It topped the UK Album Charts upon its first week of release in the United Kingdom, and became the eighth biggest-selling albums in the 21st century in the UK. The British Phonographic Industry has since certified the album 9x platinum for its accumulated sales of over 2.7 million units in Britain and over 15 million worldwide. The album spawned the hit singles \"In My Place\", \"The Scientist\", \"Clocks\", and \"God Put a Smile upon Your Face\".\n\nA Rush of Blood to the Head has been critically acclaimed, and it won the band the 2003 Grammy for Best Alternative Album for the second time in a row, successive to their previous win in the same category, and the 2004 Grammy for Record of the Year for the song \"Clocks\". In 2003 it was ranked number 473 on Rolling Stone's 500 Greatest Albums of All Time."}]}
