{"album":[{"idAlbum":"2110247","idArtist":"111280","idLabel":null,"strAlbum":"Tusk","strArtist":"Fleetwood Mac","intYearReleased":"1979","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":null,"strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/xxwwwt1352400004.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/tusk-51598af4be1ba.png","intScore":"8","strDescriptionEN":"Tusk is the 12th album by the British/American rock band Fleetwood Mac. Released in 1979, it is considered experimental, primarily due to Lindsey Buckingham's sparser songwriting arrangements and the influence of punk rock and New Wave on his production techniques. Bassist John McVie has commented that the album sounds like \"the work of three solo artists\" (Buckingham, Stevie Nicks and Christine McVie), whilst Mick Fleetwood later proclaimed that it is his favourite and the best Fleetwood Mac studio album created by the group. Costing over one million dollars to record (a fact widely noted in the 1979 press), it was the most expensive rock album made up to that point.\nTusk peaked at #4 in the US and was certified double platinum for shipping two million copies. It peaked at #1 in the UK and achieved a Platinum award for shipments in excess of 300,000 copies. The album gave the group two US top-ten hit singles, with the Buckingham-penned title track (US #8/UK #6), and the Stevie Nicks composition \"Sara\" (US #7/UK #37). Further releases from the album, \"Not That Funny\" (UK only single release), \"Think About Me\" and \"Sisters of the Moon\" were less successful; however, the latter two appear in their 'single versions' on the 2002 compilation The Very Best of Fleetwood Mac. \"Sara\" was cut to 4½ minutes for both the single and the first CD release of the album, but the unedited version has since been restored on the 1988 Greatest Hits compilation and the 2004 reissue of Tusk as well as Fleetwood Mac's 2002 release of The Very Best of Fleetwood Mac. Original guitarist Peter Green also took part in the sessions for Tusk, but his playing on the Christine McVie track \"Brown Eyes\" is not credited on the album.\nThough the album sold four million copies worldwide, in comparison to the huge sales of Rumours and the unprecedented recording expense, the band's record label deemed the project a failure, laying the blame squarely with Buckingham himself. Fleetwood, however, blames the album's relative failure on the RKO radio chain playing the album in its entirety prior to release, thus allowing mass home taping. In addition, Tusk was a double album, with a high list price of $15.98.\nThe band embarked on a huge 18-month tour to promote Tusk. They travelled extensively across the world, including the USA, Australia, New Zealand, Japan, France, Belgium, Germany, the Netherlands, and the United Kingdom. In Germany they shared the bill with reggae superstar Bob Marley. It was on this world tour that the band recorded music for the Fleetwood Mac Live album, which was released at the end of 1980."}]}
