{"album":[{"idAlbum":"2110840","idArtist":"111319","idLabel":"43651","strAlbum":"In Utero","strArtist":"Nirvana","intYearReleased":"1993","strStyle":"Rock/Pop","strGenre":"Grunge","strLabel":"DGC Records","strReleaseFormat":"Album","intSales":"5400000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/in-utero-4ddaf21540819.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/in-utero-500832178245d.png","intScore":"8.7","strDescriptionEN":"In Utero is the third and final studio album by the American grunge band Nirvana, released on September 13, 1993, on DGC Records. Nirvana intended the record to diverge significantly from the polished production of its previous album, Nevermind (1991). To capture a more abrasive and natural sound, the group hired producer Steve Albini to record In Utero during a two-week period in February 1993 at Pachyderm Studio in Cannon Falls, Minnesota. The music was recorded quickly with few studio embellishments, and the song lyrics and album packaging incorporated medical imagery that conveyed frontman Kurt Cobain's outlook on his publicized personal life and his band's newfound fame.\nSoon after recording was completed, rumors circulated in the press that DGC might not release the album in its original state, as the record label felt that the result was not commercially viable. Although Nirvana publicly denied the statements, the group was not fully satisfied with the sound Albini had captured. Albini declined to alter the album further, and ultimately the band hired Scott Litt to make minor changes to the album's sound and remix the singles \"Heart-Shaped Box\" and \"All Apologies\".\nUpon release, In Utero entered the Billboard 200 chart at number one and received critical acclaim as a drastic departure from Nevermind. The record has been certified five times platinum by the Recording Industry Association of America, and has sold 3.58 million copies in the United States alone."}]}
