{"album":[{"idAlbum":"2110253","idArtist":"111280","idLabel":null,"strAlbum":"Fleetwood Mac","strArtist":"Fleetwood Mac","intYearReleased":"1975","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":null,"strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/fleetwood-mac-4ed214d154a4d.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/fleetwood-mac-52bf7e6285fc9.png","intScore":"8","strDescriptionEN":"Fleetwood Mac is the tenth album by the British-American band Fleetwood Mac, released in 1975. It was the band's second eponymous album; the first was their 1968 album. This is the first Fleetwood Mac album to feature Lindsey Buckingham as guitarist and Stevie Nicks as vocalist, after Bob Welch departed the band in late 1974.\nThe album reached number one on the Billboard 200 over a year after entering the chart. It launched three top twenty singles: \"Over My Head\", \"Rhiannon\" and \"Say You Love Me\", the last two falling just short of the top ten, both at No. 11. In 1976, it was certified 5x platinum by the RIAA representing shipments of five million units.\nUntil the release of this album, Fleetwood Mac's albums generally sold around 300,000 - 350,000 copies apiece. This album helped launch them as musical superstars with an almost constant radio presence (which would be continued with their even more popular follow-up, Rumours). In 2003, the album was ranked No. 183 on Rolling Stone magazine's list of the 500 greatest albums of all time.\nIn Britain, the album was initially largely ignored and the first three singles lifted from the album failed to chart, therefore, generating limited interest in the album and the new line-up of the band. Only \"Say You Love Me\" charted on the UK Singles Chart and it reached No. 40. With the massive success of Rumours in 1977 and interest in the band re-ignited, Fleetwood Mac was issued again in 1978, along with the re-release of \"Rhiannon\" which peaked just outside the Top 40 at No. 46. The album eventually peaked at #23 on the UK Album Chart but was a prelude to a run of hugely successful albums for the band in Britain, including four multi-platinum number ones: Rumours, Tusk, Tango in the Night and Behind the Mask."}]}
