{"album":[{"idAlbum":"2112906","idArtist":"111480","idLabel":"45344","strAlbum":"Lateralus","strArtist":"Tool","intYearReleased":"2001","strStyle":"Metal","strGenre":"Progressive Metal","strLabel":"RCA","strReleaseFormat":"Album","intSales":"2600000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/lateralus-4e3c6d9e30d38.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/vwxtsp1565081625.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/lateralus-4ee3ebebde219.png","intScore":"8.3","strDescriptionEN":"In January 2001, Tool announced a new album, Systema Encéphale, along with a 12-song tracklist containing titles such as \"Riverchrist\", \"Numbereft\", \"Encephatalis\", \"Musick\", and \"Coeliacus\". File-sharing networks such as Napster were flooded with bogus files bearing the titles' names. At the time, Tool members were outspokenly critical of file-sharing networks in general due to their impact on artists that are dependent on record sales to continue their careers. Keenan said during an interview with NY Rock in 2000, \"I think there are a lot of other industries out there that might deserve being destroyed. The ones who get hurt by MP3s are not so much companies or the business, but the artists, people who are trying to write songs.\"\n\nA month later, the band revealed that the new album was actually titled Lateralus; the name Systema Encéphale and the tracklist had been a ruse. Lateralus and the corresponding tours would take Tool a step further toward art rock and progressive rock territory. Rolling Stone wrote in an attempt to summarize the album that \"Drums, bass and guitars move in jarring cycles of hyperhowl and near-silent death march ... The prolonged running times of most of Lateralus' thirteen tracks are misleading; the entire album rolls and stomps with suitelike purpose.\" Joshua Klein of The A.V. Club expressed his opinion that Lateralus, with its 79 minutes and relatively complex and long songs—topped by the ten-and-a-half-minute music video for \"Parabola\"—posed a challenge to fans and music programming alike.\n\nThe album became a worldwide success, reaching No.1 on the U.S. Billboard 200 albums chart in its debut week. Tool received their second Grammy Award for the best metal performance of 2001 for the song \"Schism\". During the band's acceptance speech, drummer Carey stated that he would like to thank his parents (for putting up with him) and Satan, and bassist Chancellor concluded: \"I want to thank my dad for doing my mom.\""}]}
