{"album":[{"idAlbum":"2112020","idArtist":"111418","idLabel":"46036","strAlbum":"Hail to the Thief","strArtist":"Radiohead","intYearReleased":"2003","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"XL Recordings","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/hail-to-the-thief-the-gloaming-4e23e3fb7a369.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/hail-to-the-thief-4ec72535d75ee.png","intScore":"9","strDescriptionEN":"Hail to the Thief (or The Gloaming), usually referred to without its alternative title as simply Hail to the Thief, is the sixth studio album by the English alternative rock band Radiohead. It was produced by Nigel Godrich and released on 9 June 2003. It was the last album released under Radiohead's six-album record contract with Parlophone.\n\nAfter two Radiohead albums incorporating electronica, jazz and 20th-century classical music influences, Hail to the Thief was seen as a return to a more conventional rock sound while maintaining electronic and jazz elements. Following difficult recording sessions for previous albums, the band worked deliberately quickly, employing a live, \"spontaneous\" approach, and cited the Beatles, the Pixies, Charlie Mingus, Can, New Order, Tubeway Army and Siouxsie and the Banshees as influences. George Orwell, Dante, and fairy tales influenced the lyrics, much of which were written in response to the \"War on Terror\" and the subsequent War in Afghanistan. Songwriter and vocalist Thom Yorke said the album addresses \"frustration and powerlessness and anger, and the huge gap between the people that put themselves in control and the people that allegedly voted for them.\"\n\nHail to the Thief debuted at number one in the United Kingdom and at number three in the United States, and produced three charting singles: \"There There\", \"Go to Sleep\" and \"2 + 2 = 5\". It was praised by critics, though many felt it was not Radiohead's strongest work, and it became the fifth consecutive Radiohead album to be nominated for a Grammy Award for Best Alternative Music Album. In 2010, Rolling Stone magazine ranked Hail to the Thief the 89th best album of the 2000s."}]}
