{"album":[{"idAlbum":"2112907","idArtist":"111480","idLabel":"45344","strAlbum":"Undertow","strArtist":"Tool","intYearReleased":"1993","strStyle":"Metal","strGenre":"Progressive Metal","strLabel":"RCA","strReleaseFormat":"Album","intSales":"2910000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/rxyvwx1360962256.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/yppsrv1565082810.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/undertow-5018c3b78c1bf.png","intScore":"7","strDescriptionEN":"Undertow is the debut full-length album by American rock band Tool, released in 1993. According to Allmusic, Undertow helped heavy metal music remain prominent as a mainstream musical style, and allowed several later bands to break through to the mainstream. It was released at a time when grunge was at the height of its popularity, and pop punk was slowly beginning to gather mainstream attention. Allmusic saw the album's success in the \"striking, haunting visuals that complemented the album's nihilistic yet wistful mood.\" It was eventually certified double platinum by the RIAA on May 14, 2001.\n\nAs of July 7, 2010, Undertow has sold 2,910,000 copies in the US.\n\nThe album was recorded between October and December 1992 at Grand Master Studios, Hollywood, California, by Sylvia Massy. Some of the songs featured on the album are songs that the band decided to not release on their first EP, Opiate.\nThe album art was designed by Adam Jones.Photos in the liner notes of a nude obese woman, a nude man of normal weight, and the band members with pins in the sides of their heads generated controversy, resulting in the album being removed from stores such as Kmart and Wal-Mart.The band reacted by releasing another version, which depicted a giant bar code on a white background.\n\nThis version of the album included a note from the band.\n\nThe message on the photographs of the band members reads \"Trust me trust me trust me trust me trust me I just want to start this over say you won't go this is love I'll make weapons out of my imperfections lay back and let me show you another way only this one holy medium brings me peace of mind cleanse and purge me in the water twice as loud as reason euphoria I've been far too sympathetic no one told you to come I hope it sucks you down life feeds on life this is necessary.\" This passage contains lyrics from all of the songs of the album.\n\nIn some versions of the album, when the black CD tray is removed from the case, a picture of a cow licking what appears to be its genital region is revealed. In other versions of the album, released internationally, the picture of the cow licking the genital region is viewable without problems under the transparent backing of the disc case. The photo of the cow is accredited in the album's liner notes to have been taken by Danielle Bregman. The ribcage is also on the front cover of the album, but the obese woman is absent from the booklet of the musical album, only the members of the band are depicted.\n\nAdam Jones' pet pig, Moe, appears on the back cover\namid an array of forks standing on end.\n\nComedian Bill Hicks is noted as \"inspiration\" in the liner notes. His presence would feature again on Tool's next album.\n\nChris Haskett, then with the Rollins Band, is credited in the liner notes with \"sledge hammer\", probably relating to the \"three pianos and shotguns smashed with sledgehammers\" on \"Disgustipated\".\nAdam Jones recalls a story in which the band purchased two second-hand pianos with the intention of blasting them with shotguns in the indoor parking lot of Grand Master Studio and putting the resulting sounds to tape. Apparently the man running the studio was happy as long as they cleaned up the mess afterwards. Since the incident, Tool has been approached by other bands claiming to have seen the shotgun holes left by them in the carpark wall."}]}
