{"album":[{"idAlbum":"2112366","idArtist":"111444","idLabel":"45344","strAlbum":"Station to Station","strArtist":"David Bowie","intYearReleased":"1976","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/93bu5t1605563391.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/station-to-station-4ffa79f3ad5ef.png","intScore":"9.5","strDescriptionEN":"Station to Station is the tenth studio album by English musician David Bowie, released by RCA Records in 1976. Commonly regarded as one of his most significant works, Station to Station was the vehicle for Bowie's last great character, The Thin White Duke. The album was recorded after he completed shooting Nicolas Roeg's The Man Who Fell to Earth, and the cover artwork featured a still from the movie. During the sessions Bowie was heavily dependent on drugs, especially cocaine, and recalls almost nothing of the production.\n\nMusically, Station to Station was a transitional album for Bowie, developing the funk and soul music of his previous release, Young Americans, while presenting a new direction towards synthesisers and motorik rhythms that was influenced by German electronic bands such as Kraftwerk and Neu!. This trend culminated in some of his most acclaimed work, the so-called Berlin Trilogy, recorded with Brian Eno in 1977–79. Bowie himself has said that Station to Station was \"a plea to come back to Europe for me\". The album’s lyrics reflected his preoccupations with Nietzsche, Aleister Crowley, mythology and religion.\n\nWith its blend of funk and Krautrock, romantic balladry and occultism, Station to Station has been described as \"simultaneously one of Bowie's most accessible albums and his most impenetrable\". Preceded by the single \"Golden Years\", it made the Top 5 in both the UK and US charts. In 2003, the album was ranked number 323 on Rolling Stone magazine's list of the 500 greatest albums of all time."}]}
