{"album":[{"idAlbum":"2112022","idArtist":"111418","idLabel":"46036","strAlbum":"The King of Limbs","strArtist":"Radiohead","intYearReleased":"2011","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"XL Recordings","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/the-king-of-limbs-4e23e3fb960b2.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/the-king-of-limbs-5231143ed2c56.png","intScore":"7.7","strDescriptionEN":"The King of Limbs is the eighth studio album by English rock band Radiohead, produced by Nigel Godrich. It was self-released on 18 February 2011 as a download in MP3 and WAV formats, followed by physical CD and 12\" vinyl releases on 28 March, a wider digital release via AWAL, and a special \"newspaper\" edition on 9 May 2011. The physical editions were released through the band's Ticker Tape imprint on XL in the United Kingdom, TBD in the United States, and Hostess Entertainment in Japan.\n\nFollowing the painstaking recording and relatively conventional rock instrumentation of In Rainbows, Radiohead employed a more spontaneous process to develop The King of Limbs, sampling their own recordings with turntablist techniques inspired by DJing. The band provided little information on the album, not even a track listing, before its release, and did not discuss it in detail until nearly eight months later. Singer Thom Yorke described it as an expression of \"physical movements\" and \"wildness\"; the title King of Limbs possibly refers to an oak tree in Wiltshire's Savernake Forest, thought to be 1,000 years old.\nThe King of Limbs has the shortest running time and track listing of any Radiohead album. As with 2000's Kid A, no singles were released, though a music video was released for the track \"Lotus Flower\". It received mostly positive reviews from critics, though opinion was more divided than for In Rainbows. The King of Limbs was nominated for five categories in the 54th Grammy Awards, including Best Alternative Music Album, and was named one of the best albums of 2011 by several music journals. It charted in the top ten in several countries and became a bestseller on vinyl.\n\nThe album was followed by the release of a remix album, TKOL RMX 1234567, and a live video, The King of Limbs – From the Basement."}]}
