{"album":[{"idAlbum":"2112977","idArtist":"111493","idLabel":"46036","strAlbum":"21","strArtist":"Adele","intYearReleased":"2011","strStyle":"Rock/Pop","strGenre":"Soul","strLabel":"XL Recordings","strReleaseFormat":"Album","intSales":"26000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/utqyru1514114637.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/yvvtsv1452670855.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/21-4dc971bd53cbd.png","intScore":"8.9","strDescriptionEN":"21 is the second studio album by British singer Adele. It was released on 24 January 2011 in most of Europe, and on 22 February 2011 in North America. The album was named after the age of the singer during its production. 21 shares the folk and Motown soul influences of her 2008 debut album 19, but was further inspired by the American country and Southern blues music to which she had been exposed during her 2008–09 North American tour An Evening with Adele. Composed in the aftermath of the singer's separation from her partner, the album typifies the near dormant tradition of the confessional singer-songwriter in its exploration of heartbreak, self-examination, and forgiveness.\nAdele began writing 21 in April 2009, when still involved in the relationship that subsequently inspired the record. Dissatisfied with once again portraying herself as the musical tragedian of her debut, she had intended to compose a more upbeat and contemporary follow-up. However, studio sessions ended prematurely due to a lack of inspiration. She resumed production immediately after the breakdown of her relationship, channelling her heartbreak and depression into her songs. Adele collaborated with various songwriters and producers, including Columbia Records co-president Rick Rubin, Paul Epworth, Ryan Tedder, Jim Abbiss, and Dan Wilson.\nPraised by critics for its understated production, vintage aesthetic, and Adele's vocal performance, 21 defied the modest commercial expectations of her indie record label XL Recordings and became a massive hit in 2011. The album topped the charts in more than 30 countries and appeared in the 2012 edition of Guinness World Records. In the United Kingdom, it is the best-selling album of the 21st century and fourth best-selling album of all time, while its 23-week tenure atop the UK Albums Chart is the longest by a female solo artist. In the United States, the album held the top position for 24 weeks, longer than any other album since 1985 and the longest by a female solo artist in Billboard 200 history, and was certified Diamond by the RIAA. It is one of the top 100 best-selling albums in the United States and earned the distinction of top Billboard 200 album of all time. Singles \"Rolling in the Deep\", \"Someone like You\" and \"Set Fire to the Rain\" became worldwide number-one hits, while \"Rumour Has It\" charted in the top 20 across Europe and North America.\nGlobally, 21 was the biggest selling musical release for both 2011 and 2012, and helped revitalise lagging sales of the UK and US music industry. By July 2014, the album had sold 30 million copies worldwide. Critics hailed the album as a shift from the overtly sexual and musically bombastic status quo, and attributed its success to its deeply autobiographical yet universal songs. Shortlisted for the 2011 Mercury Prize, 21 won the 2012 Grammy Award for Album of the Year and the Brit Award for British Album of the Year."}]}
