{"album":[{"idAlbum":"2112976","idArtist":"111493","idLabel":"46036","strAlbum":"19","strArtist":"Adele","intYearReleased":"2008","strStyle":"Rock/Pop","strGenre":"Soul","strLabel":"XL Recordings","strReleaseFormat":"Album","intSales":"6500000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/19-4dc8476cd7cd5.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/xrqyqq1453237650.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/19-4f77c06bc87fc.png","intScore":"8.5","strDescriptionEN":"19 is the debut studio album by British singer Adele. It was first released on 28 January 2008, through XL Recordings. Following Adele's graduation from the BRIT School for Performing Arts & Technology in May 2006, she began publishing songs and recorded a three-song demo for a class project and gave it to a friend. The friend posted the demo on Myspace, where it became very successful and led to interest from XL Recordings. This led to Adele signing a recording contract with the label and providing vocals for Jack Peñate, during this session for Peñate's song she met producer Jim Abbiss, who would go on to produce the majority of her debut album.\nAdele wrote most of the album's material solely, but did work with a select few writers and producers including Jim Abbiss, Eg White and Sacha Skarbek. Their collaborations created a blue-eyed soul album with lyrics describing heartbreak and relationship. Upon release, 19 received generally positive reviews from critics, who praised the singer's vocals and noting her as having the \"potential to become among the most respected and inspiring international artists of her generation.\" 19 was also won and was nominated for numerous accolades including a Mercury Prize, and the Grammy Award for Best New Artist. The second single, \"Chasing Pavements\" also won the Grammy Award for Best Female Pop Vocal Performance at the 51st Annual Grammy Awards.\n19 was a commercial success, debuting at number one on the UK charts during its release, and peaking at number four on the US Billboard 200 in 2012. The album is certified 7× Platinum in the UK, and 3× Platinum in the US. Worldwide sales for the album are at an estimated 10 million copies."}]}
