{"album":[{"idAlbum":"2112376","idArtist":"111444","idLabel":"45344","strAlbum":"“˜hours“¦'","strArtist":"David Bowie","intYearReleased":"1999","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/hours-4e7eabdb4d911.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/hours-4f477a0f5af57.png","intScore":"7","strDescriptionEN":"'Hours...' is the twenty-first studio album by British musician David Bowie. It was released 4 October 1999 on Virgin Records. This was Bowie's final album for the EMI sub-label.\n\nA lot of the material that ended up on 'Hours...' was originally used, in alternate versions, for the video game Omikron: The Nomad Soul, which also featured two characters based on Bowie, as well as one on his wife Iman, one on 'Hours...' collaborator Reeves Gabrels, and one on bassist Gail Ann Dorsey.\n\nTo drum up interest in the impending album, a \"Cyber Song\" contest was held on Bowie's personal website BowieNet to compose lyrics to an early instrumental version of the song \"What's Really Happening.\" The winning lyrics would be featured on 'Hours...' . Contest winner Alex Grant also won a trip to Philip Glass' Looking Glass Studios on 24 May 1999 to watch Bowie record the final vocal during a live Webcast. There, Grant contributed backing vocals to the song, along with a friend who accompanied him. Bowie also gave a \"special creativity award\" to Derek Donovan of Love Among Puppets for his entry, which Donovan posted on the Web after combining elements of the original instrumental track with his own new recording.\n\nThe album cover, designed by Rex Ray with photography by Tim Bret Day and Frank Ockenfels, depicts the short-haired Bowie persona from the intensely energetic previous album Earthling exhausted, resting in the arms of a long-haired, more youthful version of Bowie. Indeed, 'Hours...' is a much mellower album than its predecessor, and features numerous references to earlier parts of Bowie's musical career (particularly the early 1970s). For the album's initial release, a number of copies featured a lenticular version of the cover, lending a three-dimensional effect to the image.\n\nAn edition with additional tracks was released in 2004. In January 2005, Bowie's new label ISO Records reissued 'Hours...' as a double CD set with the second CD comprising remixes, alternate versions, and single B-sides.\n\nIt was the first Bowie studio album to miss the US Top 40 since Ziggy Stardust and peaked at number 47."}]}
