{"album":[{"idAlbum":"2112909","idArtist":"111480","idLabel":"45344","strAlbum":"Ænima","strArtist":"Tool","intYearReleased":"1996","strStyle":"Metal","strGenre":"Progressive Metal","strLabel":"RCA","strReleaseFormat":"Album","intSales":"3500000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/yxyuvr1359382964.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/qsywyw1565083455.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/nima-516cfdbddf7bd.png","intScore":"9","strDescriptionEN":"Ænima is the second studio album by American rock band Tool. The album was released on September 17, 1996 in vinyl format and on October 1, 1996 in Compact Disc format.] The album was recorded and cut at Ocean Way, Hollywood and The Hook, North Hollywood from 1995 to 1996. On its initial release, the album debuted at number two on the Billboard 200 chart, and has since been certified triple platinum by the RIAA on March 4, 2003. As of July 7, 2010, Ænima has sold 3,429,000 copies in the US.\nThe album appeared on several lists of the best albums of 1996, including that of Kerrang! and Terrorizer. The album won the Grammy Award for Best Metal Performance in 1998. In 2003, Ænima was ranked the 6th most influential album of all time by Kerrang! In 2006, it placed 14th on a Guitar World readers poll that attempted to find the best 100 guitar albums.\n\nThe title Ænima is a combination of the words 'anima' (Latin for 'soul' associated with the ideas of \"life force\" and a term often used by psychologist Carl Jung) and 'enema', the medical procedure.\nMusic videos were made for \"Stinkfist\" and \"Ænema\". Promotional singles were issued for \"H.\" and \"Forty Six & 2\". Several of the songs are short segues or interludes that connect to longer songs, pushing the total duration of the CD towards the maximum of around 80 minutes. These segues are \"Useful Idiot\", \"Message to Harry Manback\", \"Intermission\", \"Die Eier Von Satan\", \"Cesaro Summability\", and \"(-) Ions\".\nThemes of the album include Egyptian mythology in a seven-pointed star symbolizing Babalon, and sacred geometry in dividing the planet into grids related to chromosomes. The band dedicated the album to Bill Hicks (a comedian who the band felt was going in the same direction as them) and claimed this album to be partly inspired by him. The inside cover displays art featuring a painting of a disabled patient that shows a resemblance to singer Maynard James Keenan and Bill Hicks depicted as a doctor or \"healer\" with the line, \"Another Dead Hero\". Lines from Bill Hicks' standup set, \"One Good Drug Story\" and \"The War on Drugs\" are sampled before the song \"Third Eye\"."}]}
