{"album":[{"idAlbum":"2112908","idArtist":"111480","idLabel":"45344","strAlbum":"10,000 Days","strArtist":"Tool","intYearReleased":"2006","strStyle":"Metal","strGenre":"Progressive Metal","strLabel":"RCA","strReleaseFormat":"Album","intSales":"2500000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/10000-days-4e3c6d44336f3.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/sxpxvu1565082425.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/10000-days-4ee3ebec049da.png","intScore":"7","strDescriptionEN":"Fifteen years into the band's career, Tool had acquired what Dan Epstein of Revolver described as a devoted \"cult\" following, and as details about the band's next album emerged, such as the influence of Lateralus tourmates Fantômas and Meshuggah, controversy surrounding the new Tool album surfaced with speculation over song titles and pre-release rumors of leaked songs. Speculation over possible album titles was dismissed with a news item on the official Tool website, announcing that the new album's name was 10,000 Days. Nevertheless, speculation continued, with allegations that 10,000 Days was merely a \"decoy\" album to fool audiences. The rumor was proven false when a leaked copy of the album was distributed via filesharing networks a week prior to its official release.\n\nThe album opener, \"Vicarious\", premiered on U.S. radio stations on April 17, 2006. The album premiered on May 2 in the U.S. and debuted at the top spots of various international charts. 10,000 Days sold 564,000 copies in its opening week in the U.S. and was number one on the Billboard 200 charts, doubling the sales of Pearl Jam's self-titled album, its closest competitor. However, 10,000 Days was received less favorably by critics than its predecessor Lateralus had been.\n\nAfter the release of 10,000 Days, a tour kicked off at Coachella on April 30. The touring schedule was similar to the Lateralus tour of 2001; supporting acts were Isis and Mastodon. During a short break early the next year, after touring Australia and New Zealand, drummer Carey suffered a biceps tear during a skirmish with his girlfriend's dog, casting uncertainty on the band's upcoming concerts in North America. Carey underwent surgery on February 21 and several performances had to be postponed. Back on tour by April, Tool appeared on June 15 as a headliner at the Bonnaroo Music Festival with a guest appearance from Rage Against the Machine's Tom Morello on \"Lateralus\". Meanwhile, \"Vicarious\" was a nominee for Best Hard Rock Performance and 10,000 Days won Best Recording Package at the 49th Grammy Awards. The music video for \"Vicarious\" was released on DVD on December 18."}]}
