{"album":[{"idAlbum":"2113854","idArtist":"111626","idLabel":"43613","strAlbum":"My World 2.0","strArtist":"Justin Bieber","intYearReleased":"2010","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"Def Jam Recordings","strReleaseFormat":"Album","intSales":"1000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/my-world-20-4ddc69dec685d.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/my-world-20-4ed515e064f0b.png","intScore":"3.7","strDescriptionEN":"My World is the first release by Canadian singer Justin Bieber. It is considered to be the first part of a two-part debut release. My World, being the first part is considered an extended play standalone. It was released on November 17, 2009, via Island Records, and its follow up was released on March 23, 2010. Bieber worked a variety of producers and writers such as his mentor, Usher, Tricky Stewart, The-Dream, Midi Mafia and more. The songs are mostly inspired by teen romance and typical coming of age situations, and musically the album is R&B influenced pop.\n\nThe album received positive reviews from critics, and peaked at number five on the U.S. Billboard 200, selling 137,000 copies in its first week, which was at the time, the best opening release for a new artist in 2009, until the record was topped by Susan Boyle's I Dreamed a Dream. It also debuted at number one on the Canadian Albums Chart. The album was certified Platinum in Canada less than a month later and was certified double platinum in November 2010. In less than a month of release, the album was certified Gold in the United States by the RIAA, and in less than two months later, the album was certified platinum in the United States, selling over a million copies. After less than a month of its United Kingdom release, it was certified Silver by the BPI and was certified double platinum in December 2010.\n\nThe album's lead single, \"One Time\", was released on July 7, 2009, and reached the top twenty in five countries. The following three singles were released exclusively on iTunes. The second single, \"One Less Lonely Girl\", was released on October 6, 2009, and peaked within the top ten in Canada and top fifteen in the United States, and it later charted in several other countries. Two promo singles were released on iTunes; \"Love Me\" was released on October 26, 2009, and the second, \"Favorite Girl,\" was released on November 3, 2009. Both singles had commercial success in the United States, Canada, and eventually other countries.\nPrior to the album's release, Bieber became the first solo artist in Billboard history to have at least four singles enter the Top 40 of the Hot 100 before his debut album's release. To support the album, Bieber went on a radio/television promotion spree, a tour in Canada sponsored by Urban Behavior, was the opening act for the Fearless Tour in the United Kingdom, and will headline his first major tour, the My World Tour in June 2010 to support the release along with My World 2.0."}]}
