{"album":[{"idAlbum":"2114804","idArtist":"111827","idLabel":"43473","strAlbum":"One of the Boys","strArtist":"Katy Perry","intYearReleased":"2008","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"Columbia","strReleaseFormat":"Album","intSales":"5000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/trxuws1423097044.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/one-of-the-boys-4ffa6c03f1e88.png","intScore":"7.7","strDescriptionEN":"One of the Boys is the second studio album and major-label debut by American recording artist Katy Perry. Her change in record label, and adoption of a pseudonymous surname accompanies a notable shift from the Christian gospel rock of her self-titled debut album. The album was released on June 17, 2008 by Capitol Music Group.\n\nThe album features the Billboard Hot 100 number-one single \"I Kissed a Girl\", as well as top three hit \"Hot n Cold\", top ten hit \"Waking Up in Vegas\", and top thirty hit \"Thinking of You\". The album earned Katy Perry two Grammy Award nominations in 2009 and 2010. One of the Boys has sold more than 5 million copies worldwide.\n\nPerry has stated that she had been working on the album since she was eighteen years old. During the making of the album Perry was dropped from two record labels and went through two canceled albums. During this time, Perry had written close to seventy songs. Perry collaborated with notable producers Greg Wells, Dr. Luke, Dave Stewart, and Max Martin among others on the album. Perry co-wrote every song on the album as well as writing three of the songs herself.\n\nOnce signed to Capitol, label head Jason Flom started work on a new album by convincing Dr Luke to go back into the studio with Perry, with the two having already worked together on the abandoned Columbia sessions. Together with Max Martin they wrote and cut \"I Kissed a Girl\" and \"Hot n Cold\". Perry then collaborated again with Greg Wells, who she'd also worked with on the Columbia album, creating the songs \"Ur So Gay\" and \"Mannequin\". According to Perry's A&R Chris Anokute they ended up with five new songs and then chose the six best songs from the shelved Columbia album to compile \"One of the Boys\". When talking about the songs on the album Perry said that she released the single \"Ur So Gay\" as an introduction to the album:\n\nThe album will have a lot of the same characteristics [as \"Ur So Gay\"], though. There will be lots of storytelling, because lyrics are important to me. There are a few songs that will make you cry, but there are others to make you dance and sing. Every song is on the album for a specific reason."}]}
