{"album":[{"idAlbum":"2114584","idArtist":"111766","idLabel":"43488","strAlbum":"Evanescence","strArtist":"Evanescence","intYearReleased":"2011","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":"Concord Music Group, Inc.","strReleaseFormat":"Album","intSales":"300000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/uvpyxv1341391299.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/xof6k81596626211.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/ra4vlt1605087564.png","intScore":"7.5","strDescriptionEN":"Evanescence is the self-titled third studio album by American rock band Evanescence. The album was released on October 7, 2011, through Wind-up Records. The band started the writing process for the album in June 2009. The release of the album was changed several times; on February 22, 2010, the band entered the studio with producer Steve Lillywhite, but later they stopped recording the album with him because he \"wasn't the right fit\". During that time the album was scheduled for an August or September 2010 release, but Lee later announced that Evanescence had left the studio to write more material. On April 11, 2011, the band went back into the studio with a new producer, Nick Raskulinecz.\n\nAccording to Lee, the band drew influences from Björk, Depeche Mode, Massive Attack, MGMT and Portishead in the album. The songs on Evanescence contain elements of gothic rock, nu-metal and hard rock as well as new electro elements. Upon its release, the album received mixed to positive reviews from music critics who generally praised the new musical elements in the sound of the songs and Lee's vocals. However, some of them criticized it for being similar to the band's older material.\n\nThe album debuted at number one on the Billboard 200 chart with 127,000 copies in sales. It also debuted at number one on four other different Billboard charts including the Rock Albums, Digital Albums, Alternative Albums, and the Hard Rock Albums charts. The album was also successful worldwide appearing on the charts of over twenty countries. The band promoted Evanescence by premiering some of the songs online on various websites and appearing on several televised shows. In 2011, they embarked their third worldwide tour for the album along with The Pretty Reckless and Fair to Midland.\n\nThe first single from the album, \"What You Want\", was released on August 9, 2011. \"My Heart Is Broken\", the second single of the album, was released on November 11, 2011. \"Lost in Paradise\" was released internationally on May 25, 2012. \"The Other Side\" officially impacted U.S. Alternative and Modern rock radio on June 11, 2012."}]}
