{"album":[{"idAlbum":"2114585","idArtist":"111766","idLabel":"43488","strAlbum":"The Open Door","strArtist":"Evanescence","intYearReleased":"2006","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":"Concord Music Group, Inc.","strReleaseFormat":"Album","intSales":"6000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/the-open-door-4dc868f23430d.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/cpx1531596625920.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/the-open-door-4e837a41d0937.png","intScore":"6.8","strDescriptionEN":"The Open Door is the second studio album by the American rock band Evanescence. It was first released in Poland on September 25, 2006, through Wind-up Records and subsequently in more than 20 other countries worldwide. Originally intended to be released in March 2006, the release date of The Open Door was changed due to guitarist Terry Balsamo's stroke, the loss of the band's former manager and Will Boyd's and Ben Moody's departure from the band. The album symbolizes a new beginning for the band, incorporating new elements in their old music such as gothic rock, symphonic rock and pop music as well as choirs on several songs. The writing process for the album took a period of over 18 months and the majority of the songs were written by Amy Lee and Terry Balsamo, while being produced by Dave Fortman.\n\nThe album received mixed to positive reviews from music critics who generally praised its lyrical content and the instrumentation accompanied by Lee's vocals. However, some critics gave a negative review towards the different sound from the band's last album Fallen (2003). The album earned a nomination at the 50th Grammy Awards for Best Hard Rock Performance with \"Sweet Sacrifice\". The band also won in the category Album of the Year at the 2007 MTV Australia Video Music Awards. The Open Door debuted at number one on the Billboard 200 selling more than 447.000 copies in its first week. It topped the charts in Australia, Europe, Germany, Greece and Switzerland and charted in top five in over fifteen countries. The album was certified platinum by the Recording Industry Association of America (RIAA) just over a month after its release, and has since sold more than six million copies worldwide. It was also certified in over fifteen worldwide markets. As of October 2011 it has sold more than two million copies in the United States and over six million copies worldwide.\n\n\"Call Me When You're Sober\" was digitally released as the first single from the album on September 4, 2006 and it was later released as a CD single on September 27. It peaked at number 10 on the Billboard Hot 100 and it charted within the top 20 in several more charts internationally. \"Lithium\" was released as the second single on January 1, 2007 while \"Sweet Sacrifice\" was released as the third international single from the album on May 5, 2007. \"Good Enough\" was released as the fourth single from the album and it failed to chart on the music charts. The Open Door had been supported by two worldwide tours, including The Open Door Tour and later the Evanescence Tour."}]}
