{"album":[{"idAlbum":"2115557","idArtist":"111971","idLabel":"43287","strAlbum":"Everybody Wants to Be on TV","strArtist":"Scouting for Girls","intYearReleased":"2010","strStyle":"","strGenre":"Pop","strLabel":"Warner Bros. Records","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/wvqxts1411420032.jpg","strAlbumThumbBack":null,"strAlbumCDart":"","intScore":"3.5","strDescriptionEN":"Everybody Wants to Be on TV, the second album by British pop trio Scouting for Girls, is as light and breezy as its predecessor and is loaded with sure-fire hit material, though it does nothing to impress the legion of critics who have slagged the band for its unimaginative approach to radio-friendly pop/rock. While Scouting for Girls garnered more than their fair share of disparagement from critics in the British press, there's no denying that the band proved remarkably successful from a commercial standpoint. Scouting for Girls (2007), the band's eponymous debut, topped the U.K. albums chart and spawned a trio of Top Ten hit singles (\"She's So Lovely,\" \"Elvis Ain't Dead,\" \"Heartbeat\"). In hopes of repeating the success of their debut album, Scouting for Girls took their time writing Everybody Wants to Be on TV. It was reported that bandleader Roy Stride scrapped an entire album's worth of material in 2008 and went back to the drawing board in his aim to write \"the perfect pop song.\" The problem is that the ten songs on Everybody Wants to Be on TV are too perfect. They're well-crafted, for sure, and practically all of them are primed for mainstream pop/rock radio play. Take for instance the lead single, \"This Ain't a Love Song,\" which shot straight to the top of the U.K. singles chart upon its release. Its appeal is immediate. One listen is all it takes. Unfortunately, in Stride's aim to write perfect pop songs and hitmaker Andy Green's bid to produce tunes as tailor-made for the charts as last time, the songs on Everybody Wants to Be on TV tend to resemble one another as the album advances. Give or take novelty touches like the Auto-Tune on \"Little Miss Naughty\" or some memorably clever turns of phrase on \"Posh Girls,\" these songs are interchangeable. Their charm wears thin with each passing track, and Stride's hit-making approach becomes increasingly plain in the process. In the end, it's something of a blessing that Everybody Wants to Be on TV is over and done with in a mere 34 minutes' time. Scouting for Girls are, at their best, as a singles act."}]}
