{"album":[{"idAlbum":"2116274","idArtist":"111573","idLabel":null,"strAlbum":"The Dance","strArtist":"Faithless","intYearReleased":"2010","strStyle":"Electronic","strGenre":"Electronic","strLabel":null,"strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/the-dance-never-ends-disc-2-4e48f339ba06a.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/the-dance-4f7b7d208d0c2.png","intScore":"6.7","strDescriptionEN":"The Dance is the sixth and final studio album by dance music act Faithless on their own record label, Nates Tunes, and first for PIAS Recordings. Dido is featured on the songs \"North Star\" and \"Feelin' Good\". Actress and singer Mía Maestro performs the vocals on \"Love Is My Condition\".\nThe band's common theme for the album was a 'back to their roots' approach, with vocalist Maxi Jazz elaborating that the album was a return to the old, with an eye on the future; \"This is probably the danciest album we’ve ever created; it’s like a return to what we did before but more so.\" Sister Bliss added that the club culture was something the band members, especially her, were stuck with; \"Late-night DJing will be the death of me but I’m good at it, goddammit. I’ve always found house music deeply absorbing; it forces you to be in the moment and it’s locked into my DNA. I get riled when dance music gets undervalued as mindless nonsense because there’s a galvanising force in people getting together to do something positive. There’s nothing more joyous than people dancing and losing themselves to music.\"\n\"What’s exciting is putting The Dance into context as our sixth album,\" adds Bliss. \"After getting together to do one single, we never thought we’d reach this point. It’s mad, innit? But it’s also very rare that you find a unique voice and when Rollo and me first encountered Maxi, we didn’t want the conversation to end. Our first record, Salva Mea, was very odd for 1990s dance music. The original is like a symphony that goes into hip hop then banging house - it’s all over the bloody shop."}]}
