{"album":[{"idAlbum":"2116684","idArtist":"111766","idLabel":"43488","strAlbum":"Fallen","strArtist":"Evanescence","intYearReleased":"2003","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":"Concord Music Group, Inc.","strReleaseFormat":"Album","intSales":"8967000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/wxvquq1486472957.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/c9t25h1596625798.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/fallen-4f133f8a16d25.png","intScore":"7.5","strDescriptionEN":"Fallen is the debut studio album by American rock band Evanescence. It was released on March 4, 2003, through Wind-up Records. The album was recorded in multiple recording studios, including Conway Recording Studios in Hollywood, California. It is commercially the band's most successful album to date, selling more than 7 million copies in the United States alone, and more than 17 million worldwide. It debuted at number 7 on the Billboard 200, selling more than 141,000 copies within its first week, eventually peaking at number 3 in June 2003. Internationally, it has topped the charts in more than ten countries worldwide. It was certified Platinum seven times by the Recording Industry Association of America (RIAA), and acquired multiple certifications worldwide.\n\nUpon its release, Fallen received mixed to positive reviews from music critics. It spawned four singles: \"Bring Me to Life\", \"My Immortal\", \"Going Under\", and \"Everybody's Fool\". \"Bring Me to Life\" and \"My Immortal\" peaked within the charts of more than ten countries, including Australia, United Kingdom, and the United States. The album earned the band five nominations at the 46th Grammy Awards: Album of the Year, Best Rock Album, Best Rock Song, Best Hard Rock Performance and Grammy Award for Best New Artist, winning Best New Artist and Best Hard Rock Performance.\n\nAfter Evanescence was formed by Amy Lee and Ben Moody in 1995, the band released two extended plays (EP) and one demo CD and in January 2001 they signed with their first major label, Wind-up. The writing process for the album took a period of eight years. During an interview with MTV, Ben Moody revealed that he never wrote together with Lee adding, \"maybe two or three times in eight years did we actually sit down and write together in the same room.\"\n\nThe album was recorded at Track Record Inc. & NRG Recording Studios, Ocean Studios, Conway Recording Studios, all in California. Different tracks were recorded as demos before the album's recording sessions, while \"My Immortal\", \"Imaginary\", and \"Whisper\" appeared on the band's earlier material. The album was recorded and mixed between late August and early December, 2002. Recording work for Fallen started at Ocean Studios in Burbank, California, where most of \"Bring Me to Life\" was recorded for the Daredevil soundtrack, prior to full album production. For that song, Jay Baumgardner used a mix at his studio, NRG Recording Studios in North Hollywood, Los Angeles, on an SSL 9000 J. Drum tracks were recorded at Ocean Studios, with Josh Freese playing to click-tracks, containing stereo guitars and vocals on selected songs.\n\nOn the rest of the drums, Fortman said that he used a D112 on the inside of the kick drum, a U47 on the outside, an NS-10 speaker as an outside mic. The producer ran 414s on the ride cymbal and hi-hat. He recorded the drums onto 2-inch tape on a Studer machine and then bounced the parts into Pro Tools. The guitars (Gibson Les Paul, Gibson SG, Mesa Boogie, Marshall Amplification) for the album were cut at Mad Dog Studios, Burbank, California in an old Mesa/Boogie cabinet. Lee's vocals, pianos and background vocal by The Millennium Choir were recorded in NRG Recording Studios. The orchestra parts were arranged by David Hodges and David Campbell, except in \"My Immortal,\" which was done by composer Graeme Revell. The mixing for the album took a period of two weeks at Conway Recording Studios in North Hollywood while the album was mastered by Ted Jensen at Sterling Sound in New York City."}]}
