{"album":[{"idAlbum":"2116423","idArtist":"112131","idLabel":"46036","strAlbum":"The Fat of the Land","strArtist":"The Prodigy","intYearReleased":"1997","strStyle":"Electronic","strGenre":"Big Beat","strLabel":"XL Recordings","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/vxptvr1573381302.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/tqqutt1431711732.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/qtrtpw1573381530.png","intScore":"7.8","strDescriptionEN":"The release of \"Firestarter\" in 1996, featuring vocals for the first time courtesy of a new-look Keith Flint, helped the band break into the U.S. and other overseas markets, and reached number one on the UK Singles Chart. In this year The Prodigy also headlined the prestigious Lollapalooza festival.\n\nThe long-awaited third Prodigy album, The Fat of the Land, was released in 1997, just as the band headlined the Glastonbury Festival on its opening night. Featuring simplified melodies, sparser sampling, less rave music influences, and punk-like vocals supplied by a shockingly madeover Flint, the album nevertheless retained the bone-jarring breaks and buzzsaw synths so idiomatic of the band. The album cemented the band's position as one of the most internationally successful acts in the dance genre, entering the UK and US charts at number one.\n\nThe Prodigy were getting considerable airplay on rock stations with their controversial track \"Smack My Bitch Up\"-and also a negative backlash for the song. The National Organization for Women (NOW) criticized the song and its music video. The song's lyrics consist entirely of the repeated phrase \"Change my pitch up, smack my bitch up\", which NOW stated are a \"dangerous and offensive message advocating violence against women\". Howlett responded to the criticism by stating that the meaning of the song and its lyrics were being misinterpreted, and the phrase meant \"doing anything intensely, like being on stage - going for extreme manic energy\". The band did not actually write the lyric, but rather, sampled it from the hip hop Ultramagnetic MCs' track \"Give the Drummer Some\" which also appears on the Dirtchamber Sessions; they had also sampled another Ultramagnetic MCs song \"Critical Beatdown\" on their earlier \"Out of Space\" single. The National Organization for Women also believed that the lyrics are in reference to administering heroin (smack) to another person. Several radio stations limited the song's airplay to nighttime hours. In September 1997, The Prodigy performed \"Breathe\" at the 1997 MTV Video Music Awards, and won the Viewer's Choice Award.\n\n\"Smack My Bitch Up\" The song generated an amount of controversy, and received backlash for the repeating sample.The music video for \"Smack My Bitch Up\", directed by Jonas Åkerlund, featured a first-person point of view of someone going clubbing and indulging in large amounts of drugs and alcohol. Other content shown includes the protagonist getting into fist fights with men, abusing women, vomiting repeatedly, and picking up a lap dancer (played by British glamour model Teresa May) and having sex with her. Much of the aforementioned is depicted fairly explicitly. At the end of the video, the camera pans over to a mirror, revealing the subject to be a woman. MTV only aired the video between 1 and 5 a.m due to the offensive material. After one week, the very same television network banned the music video at NOW's request. The director got the inspiration for the contents of the video after a night of drinking and partying in Copenhagen.\n\nDuring a performance at the Reading Festival on 29 August 1998, The Prodigy and the Beastie Boys had an onstage disagreement over the track, with the Beastie Boys requesting the song should be pulled from their set as it could be considered offensive to those who had suffered domestic abuse. Choosing to ignore the Beastie Boys plea, Maxim introduced \"Smack My Bitch Up\" with the declaration \"They didn't want us to play this fucking tune. But the way things go, I do what the fuck I want\".\n\nWal-Mart and Kmart later announced they would pull The Fat of the Land off their shelves. Despite the fact that the LP had resided on their store shelves for over 20 weeks, and the fact that they had sold 150,000 copies of the album in total, the two stores found the marketing campaign for the new single release \"offensive\". At the 1998 MTV Video Music Awards in Los Angeles, \"Smack My Bitch Up\" won two awards; Best Dance Video and Breakthrough Video.\n1999 saw the release of The Prodigy's The Dirtchamber Sessions Volume One, a DJ mix album by Howlett, produced as an official record of a successful guest appearance on the British Radio 1. In June of the same year, when the band had arguably reached their commercial peak, they parted company with guitarist Gizz Butt.\n\nFollowing 1999, Thornhill departed from the group while he divorced Sara Cox due to the risk of nervous breakdown, resulting in the band's website being replaced with their logo and the words \"We will be back\" set against a black background, a stint that it'd remain until 2002."}]}
