{"album":[{"idAlbum":"2116421","idArtist":"112131","idLabel":"46036","strAlbum":"Always Outnumbered, Never Outgunned","strArtist":"The Prodigy","intYearReleased":"2004","strStyle":"Electronic","strGenre":"Big Beat","strLabel":"XL Recordings","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/always-outnumbered-never-outgunned-4f7dc7b8d75ed.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/uqwpyu1536699732.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/always-outnumbered-never-outgunned-4f1782ff8307c.png","intScore":"7","strDescriptionEN":"The Prodigy's fourth studio album, Always Outnumbered, Never Outgunned, was released on 23 August 2004, and 14 September 2004 in the USA. A precursory and experimental single, \"Memphis Bells\", was released in very limited numbers, followed by the traditional release of the single \"Girls\". The U.S. version of the studio album contained a bonus track; a remix of \"Girls\", entitled \"More Girls\". The album, which topped the UK Album Charts on its debut week, was promoted by a 2-year-long tour.\n\n5,000 digital copies of \"Memphis Bells\" were sold over the Internet. Each copy was a combination of customer-chosen instrumental, rhythmic, and melodic options, of which 39,600 choices were available. Five mixes were sold in three file formats, WAV, two audio mixes in MP3, and a 5.1 DTS surround sound mix, and all were free of digital rights management.\n\nIn 2005, they released a compilation, Their Law: The Singles 1990-2005, which spawned a single containing new remixes of the songs \"Out of Space\" (the \"Audio Bullys Remix\") and \"Voodoo People\" (the \"Pendulum Remix\"). The artwork represented drawn versions of the front covers of the \"Out of Space\" and \"Voodoo People\" single releases. The latter was also followed by a music video filmed in Romford Market, Essex, which featured on the DVD release of the compilation. Sharky, the group's only female member, is shown running and winning the race depicted in the video\n.\nThe Prodigy's first two albums, 1992's Experience and 1994's Music for the Jilted Generation, were re-released in expanded, deluxe editions on 4 August 2008. As well as being remastered, the new packages featured a bonus disc including mixes, rarities, and live tracks. The two albums also featured expanded artwork in addition to the new musical content.\n\nWhen asked about the idea, Howlett responded that they were getting ready to make a new album:\n\nNo, we're all done with that [those albums] now, all the old material. We didn't actually want to do the Greatest Hits, we were ready to start our new record-until the record company pointed out that it was in the contract. But then we got into it, and tried to be creative with it as much as [we could]. And, you know, we ended up being really proud of it. You have to have a different brain when you're doing a record like that. It's more about [saying] \"this is your achievement\"; I could hold in one hand all the records we've released, so that was cool. We're moving on now, and getting on with the new record."}]}
