{"album":[{"idAlbum":"2116425","idArtist":"112131","idLabel":"46036","strAlbum":"Music for the Jilted Generation","strArtist":"The Prodigy","intYearReleased":"1994","strStyle":"Electronic","strGenre":"Big Beat","strLabel":"XL Recordings","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/rttypy1581904323.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/wxwqqr1536698277.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/wyrsxu1581904174.png","intScore":"8.3","strDescriptionEN":"In 1993, Howlett released an anonymous white label, bearing only the title \"Earthbound I\". Its hypnotic, hard-edged sound won wide underground approval. It was officially released as \"One Love\" later that year, and went on to chart at number 8 in the UK. The following year, The Prodigy's second album, Music for the Jilted Generation, debuted in the UK Albums Chart at number one, and jettisoned into positive reactions from album critics. Adding elements of big beat and electro-industrial to the mix, the album expressed a wider spectrum of musical styles, with heavy breakbeat-based tracks complemented by the concept sequence The Narcotic Suite and a rock-oriented inclination, \"Their Law\", featuring Pop Will Eat Itself.\n\nThe album was nominated for a Mercury Music Prize, although Howlett had reaffirmed his dedication to making The Prodigy a 'hard dance band', commercially successful but without compromise. The band managed to continue to prevent over-exposure in the media by refusing to appear on Top of the Pops or other television shows in the UK. To date, their only studio appearance on British television came when they appeared on the BBC2 series Dance Energy in 1991, performing \"Everybody in the Place\". In the ensuing years, their videos received a strong level of support by MTV Europe, which boosted their popularity across the continent. Keith Flint himself hosted an episode of the MTV show 120 Minutes in 1995.\n\nFollowing the international success of Music for the Jilted Generation, the band augmented their line-up with guitarist Jim Davies (a live band member who later joined the group Pitchshifter) in 1995 for tracks such as \"Their Law\", \"Break and Enter 95\", and various live-only interludes and versions. He was soon to be replaced by Gizz Butt of the band Janus Stark, who remained with the band for the next three years."}]}
