{"album":[{"idAlbum":"2118216","idArtist":"112424","idLabel":"43851","strAlbum":"Invincible","strArtist":"Michael Jackson","intYearReleased":"2001","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"Epic","strReleaseFormat":"Album","intSales":"13000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/invincible-4ddbbb8f59b2e.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/invincible-4ed0226e7a7aa.png","intScore":"7","strDescriptionEN":"Invincible is the tenth studio album by American recording artist Michael Jackson, released October 30, 2001, on Epic Records. His last studio album, it was the first release of new Jackson material since Blood on the Dance Floor: HIStory in the Mix in 1997 and the first studio album in six years since HIStory: Past, Present and Future, Book I. Jackson, Rodney Jerkins, R. Kelly and Teddy Riley received producing and writing credits, among others. Similar to Jackson's previous material, Invincible explores themes such as love, romance, isolation, media criticism, and social issues. Invincible received generally mixed reviews from contemporary music critics. The album's singles were incomplete in their release. Jackson was able to use these conflicts as leverage to exit his contract early.\nThree singles were released from the album: \"You Rock My World\", \"Cry\" and \"Butterflies\" of which the first and second were released as physical singles internationally (except the USA) and the third one being a US-only radio-airplay single. The album's first and last singles charted within the top twenty on the Billboard Hot 100 Chart, and they peaked at number one and within the top ten in several markets worldwide; \"Cry\" was less commercially successful. Following a conflict between Jackson and his record label, Sony Music stopped promoting the album. The album was the recipient of one Grammy Award nomination for Best Pop Vocal Performance - Male, as well as being voted, by readers of Billboard magazine, the best album of the decade.\nThe album peaked at number one in eleven territories worldwide, including the United States (with sales of 363,000 units its first week), the United Kingdom, Australia, France and Switzerland. Invincible charted within the top ten in six other territories; its least successful charting area was Mexico, where the album peaked at number twenty nine. Invincible re-entered music charts several times during the decade. Despite selling 13 million copies worldwide, the album has been viewed as a commercial failure compared to Jackson's previous albums sales."}]}
