{"album":[{"idAlbum":"2118217","idArtist":"112424","idLabel":"43851","strAlbum":"Dangerous","strArtist":"Michael Jackson","intYearReleased":"1991","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"Epic","strReleaseFormat":"Album","intSales":"32000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/dangerous-4ddbbb8f5aeb6.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/dangerous-4fd386c73e8fc.png","intScore":"9.4","strDescriptionEN":"Dangerous is the eighth studio album by American recording artist and musical inventor Michael Jackson, released on November 26, 1991 on Epic Records. His first album under his new contract with Sony Music, it was also Jackson's first album to not be produced by longtime collaborator Quincy Jones, who had agreed to split after the final recording sessions for Jackson's 1987 album, Bad. Dangerous has sold over 50 million albums worldwide, 10 million albums were shipped in the United States alone, and has been cited as one of the best-selling albums of all time. The album produced four top ten singles on the Billboard Hot 100 including one number-one. Similar to the musician's previous material, the album's music features elements of R&B, pop and rock while also incorporating a newer genre, new jack swing, after the inclusion of producer Teddy Riley to the project.\nDangerous took over a year in production, starting in June of 1990 and ending in October of 1991. Lyrical themes expressed in the album included racism, poverty, paranoia, romance, the welfare of children and the world and self-improvement, topics Jackson had recorded before. Dangerous, much like Bad and Thriller, cemented Jackson's place in music history as one of the leaders of contemporary pop music. Nine singles were released from Dangerous between November 1991 and December 1993, with seven singles issued in the United States, and two others released only outside the US. The two singles released outside the United States was successful on the charts, charting within the top ten and top forty respectively. Dangerous peaked at number one in nine countries, while charting at the top ten in four other territories. The only songs not released were \"Why You Wanna Trip on Me\", \"She Drives Me Wild\", \"Keep the Faith\" and \"Dangerous\", a video and a single release for the latter song was said to have been planned but was postponed indefinitely due to the musician's tour and later personal problems.\nDangerous was the first album to be produced fully by Jackson, with additional production from his friend, Bill Bottrell and Teddy Riley, with production from the latter producer, presenting Jackson with a younger urban audience. Jackson composed on all but two tracks on the album. Dangerous won several Grammy nominations only winning one for Best Engineered Album (Non Classical) by Bruce Swedien and Riley. In addition to commercial success, the album also received critical acclaim from contemporary critics. It has been listed as the most successful album recorded under the new jack swing genre of all time."}]}
