{"album":[{"idAlbum":"2118218","idArtist":"112424","idLabel":"43851","strAlbum":"Off the Wall","strArtist":"Michael Jackson","intYearReleased":"1979","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"Epic","strReleaseFormat":"Album","intSales":"20000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/off-the-wall-4f1129a31ca7f.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/off-the-wall-4ed02484b9755.png","intScore":"7.3","strDescriptionEN":"Off the Wall is the fifth studio album by the American recording artist Michael Jackson, released August 10, 1979 on Epic Records, after Jackson's critically well received film performance in The Wiz. While working on that project, Jackson and Quincy Jones had become friends, and Jones agreed to work with Jackson on his next studio album. Recording sessions took place between December 1978 and June 1979 at Allen Zentz Recording, Westlake Recording Studios, and Cherokee Studios in Los Angeles, California. Jackson collaborated with a number of other writers and performers such as Paul McCartney, Stevie Wonder and Rod Temperton. Five singles were released from the album. Three of the singles had music videos released. Jackson wrote several of the songs himself, including the Platinum-certified lead single, \"Don't Stop 'til You Get Enough\". It was his first solo release under Epic Records, the label he would record on until his death in 2009.\nThe record was a departure from Jackson's previous work for Motown. Several critics observed that Off the Wall was crafted from funk, disco-pop, soft rock, jazz and pop ballads. Jackson received positive reviews for his vocal performance on the record. The record gained positive reviews and won the singer his first Grammy Award since the early 1970s. With Off the Wall, Jackson became the first solo artist to have four singles from the same album peak inside the top 10 of the Billboard Hot 100. The album was a commercial success; to date it is certified for 8× Multi-Platinum in the US and has sold more than 20 million copies worldwide, making it one of the best selling albums of all time.\nOn October 16, 2001, a special edition reissue of Off the Wall was released by Sony Records. Recent reviews by Allmusic and Blender have continued to praise Off the Wall for its appeal in the 21st century. In 2003, the album was ranked number 68 on Rolling Stone magazine's list of the 500 greatest albums of all time. The National Association of Recording Merchandisers listed it at number 80 of the Definitive 200 Albums of All Time. In 2008, Off the Wall was inducted into the Grammy Hall of Fame."}]}
