{"album":[{"idAlbum":"2118224","idArtist":"112424","idLabel":"43851","strAlbum":"Bad","strArtist":"Michael Jackson","intYearReleased":"1987","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"Epic","strReleaseFormat":"Album","intSales":"45000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/bad-4ddbbb8f58b8d.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/vvrxry1435147230.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/bad-4ed0218465cf2.png","intScore":"9.7","strDescriptionEN":"Bad is the seventh studio album by American recording artist Michael Jackson. The album was released on August 31, 1987 by Epic/CBS Records, nearly five years after Jackson's previous studio album, Thriller, which went on to become the world's best-selling album. Bad itself has sold between 30 to 45 million copies worldwide, shipped 8 million units in the United States alone, and has been cited as one of the best selling albums of all time. The album produced five Hot 100 number ones, the first album to do so. Similar to Jackson's previous music material, the album's music features elements of R&B, pop and rock.\n\nBad was recorded during the first half of 1987. The lyrical themes on the record relate to paranoia, romance and self-improvement. Bad is widely regarded as having cemented Jackson's status as one of the most successful artists of the 1980s, as well as enhancing his solo career and being one of the best musical projects of his career. Nine of the eleven songs on Bad were released as singles; one was a promotional single and another was released outside of the United States and Canada. Five of the singles hit number one in the United States, while a sixth charted within the top-ten, and a seventh charted within the top-twenty on the Hot 100. The single that was released outside of the United States and Canada was commercially successful, charting within the top ten and top twenty in multiple territories. Bad peaked at number one in seven countries, as well as charting within the top twenty in other territories. The only song on the album which wasn't released as a single nor had a music video for was \"Just Good Friends\".\n\nBad saw Jackson exercise even more artistic freedom than he did with his two previous Epic releases (Off the Wall and Thriller). On Bad, Jackson composed nine of the album's eleven tracks and received co-producer credit for the entire album. The album continued Jackson's commercial success in the late 1980s and garnered six Grammy Award nominations, winning two. Aside from commercial success the album also received critical acclaim from contemporary critics. Bad was ranked number 43 in the 100 Greatest Albums of All Time of the MTV Generation in 2009 by VH1 and number 202 in Rolling Stone magazine's 500 Greatest Albums of All Time. The album marked the final collaboration between Jackson and producer Quincy Jones. In addition, Jackson scored five number ones from Bad, making him the first of only two artists in the chart's history to amass five number-one singles from one album. This feat would not be equaled for 23 years when Katy Perry did the same with her album Teenage Dream."}]}
