{"album":[{"idAlbum":"2120401","idArtist":"111827","idLabel":"43473","strAlbum":"Teenage Dream","strArtist":"Katy Perry","intYearReleased":"2010","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"Columbia","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/teenage-dream-4dcc147f1e366.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/xqvpss1453808289.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/teenage-dream-4dcc2262982b3.png","intScore":"7.6","strDescriptionEN":"Teenage Dream is the third studio album by American recording artist Katy Perry. It was released on August 24, 2010, in both standard and deluxe edition through Capitol Records. On top of co-writing every song on the album, Perry worked with a multitude of producers and writers, including Dr. Luke, Max Martin, Benny Blanco, Tricky Stewart, Stargate, Ryan Tedder, Greg Kurstin, Ester Dean, and The-Dream.\n\nThe music of Teenage Dream is derived from a wide variety of pop and rock genres, while heavily incorporating different musical styles not heard on her previous releases; disco and electronic music are examples. It also encompasses a broad variety of other genres, such as funk, house, gothic rock, Hi-NRG, and hip hop. The lyrical content of the album mainly focuses of the ups and downs of teenage love, partying, self empowerment, and personal growth. The album received mixed to positive reviews from music critics; with many complimenting the production and the theme of the album, while some denounced the lyrical content. Teenage Dream and its singles have received multiple awards and nominations at the 53rd, 54th, and 55th Grammy Awards, as well as winning International Album of the Year at the Juno Awards of 2011.\n\nIn the United States, Teenage Dream debuted at number one on the Billboard 200, selling 192,000 copies in its first week. It was later certified two times platinum by the RIAA; selling more than 2.6 million copies in the United States. The album has sold more than 5.5 million copies worldwide. Six of the album's eight singles – \"California Gurls\", \"Teenage Dream\", \"Firework\", \"E.T.\", \"Last Friday Night (T.G.I.F.)\", and \"Part of Me\" – went on to reach number one on the US Billboard Hot 100. The other two singles – \"The One That Got Away\" and \"Wide Awake\" – peaked at numbers three and two, respectively on Billboard Hot 100 chart. Teenage Dream is only the second album in history to have five number ones from one album (after Michael Jackson's Bad) to do so, the first by a female to achieve this milestone, and the third album in history to produce seven top five hits. All eight of the aforementioned singles have sold over two million digital downloads each in the U.S., thus setting a new record in the digital era for the most multi-platinum singles from one album, breaking the previous record of Fergie with her album The Dutchess (five multi-platinum songs)."}]}
