{"album":[{"idAlbum":"2122843","idArtist":"112627","idLabel":null,"strAlbum":"Kiss","strArtist":"Carly Rae Jepsen","intYearReleased":"2012","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":null,"strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/kiss-5050baa6de2db.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/wpxuxw1519573185.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/kiss-505f7fe644b3e.png","intScore":"7.5","strDescriptionEN":"Kiss is the second studio album by Canadian recording artist Carly Rae Jepsen. It was released on September 14, 2012, by 604, Schoolboy and Interscope Records. After her debut, Tug of War (2008), which managed to receive success in Canada but was never released worldwide, Kiss became Jepsen's first internationally released album. Songs on the album are in the nu-disco, dance-pop, and teen pop genres, drawing inspiration from The Cars, Madonna, and Swedish performer, Robyn. Featuring production from a wide collection of producers including Dallas Austin, Josh Ramsay, and Redfoo, the album features a track with guest vocals from Justin Bieber.\n\nKiss was given mixed-to-favorable reviews by critics. Critics praised Jepsen for her vocal performance, song writing, and production. However, they deemed it as immature for her age. The album debuted at number six on the Billboard 200, selling over 46,000 copies in its opening week and debuted at five on the Canadian Albums Chart, selling over 8,000 copies in its opening week. It also charted in numerous international markets. The album and its singles earned Jepsen two Grammy Award nominations including Song of the Year, as well as winning Album of the Year and Pop Album of the Year at the Juno Awards of 2013.\n\nThe album charted across Europe and in the United States, reaching the top ten in the latter, in Canada (her native country), Australia, New Zealand, Japan, and the UK. Two singles, \"Call Me Maybe\" and \"Good Time\", were released before the album's debut. \"Call Me Maybe\" was a huge commercial success, reaching number one in over fifteen countries and garnering over 500 million views online. \"Good Time\", a collaboration with synthpop artist Owl City, peaked in the top ten also. The third single, \"This Kiss\", was released in September 2012. The fourth and final single, \"Tonight I'm Getting Over You\", was released on February 19, 2013 in the US."}]}
