{"album":[{"idAlbum":"2122844","idArtist":"113130","idLabel":null,"strAlbum":"Scoundrel Days","strArtist":"a-ha","intYearReleased":"1986","strStyle":"Rock/Pop","strGenre":"Synthpop","strLabel":null,"strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/wvxwqp1377235721.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/scoundrel-days-4fd8f8d0d073d.png","intScore":"7","strDescriptionEN":"Scoundrel Days is the second full-length album by the new wave pop/rock band A-ha. It was released on 6 October 1986 through Warner Bros. Records. A deluxe/expanded edition with additional tracks was released in 2010.\nYamaha DX7 and Roland Juno-60/106 synths used in the recording of this album—Roland Juno used on intro of the song \"Manhattan Skyline \" and Yamaha DX7 drum sound used on the intro of song called \"October\". \"Scoundrel Days\" and \"Swing of Things\" signature sounds are PPG. The drums and several other sounds are from the Fairlight.\n\"I've Been Losing You\" was the first single from the album. It reached #1 in Norway, and #8 in the UK. \"I've Been Losing You\" became the biggest hit from the album in Europe.\n\"Cry Wolf\" was the second single from the album. It was the most successful single from the Scoundrel Days album in the U.S., where it peaked at #14 on the Hot Dance Music/Club Play charts and went to #50 on the Hot 100. While it would be their last entry on that chart, the band would continue to have major pop hits from each album release throughout the rest of the world through to the present day. The single went Top 40 nearly everywhere else it was released, including Top 5 chartings in the UK, Poland and Ireland, going #2 in Norway and to the top spot in Japan. The lyrics \"Night I left the city I dreamt of a Wolf...\" are credited to Lauren Savoy whom Pål later married.\n\"Maybe, Maybe\" is the third single released from the album and was only released in Bolivia.\n\"Manhattan Skyline\" reached #13 in the UK charts. The song was co-written by keyboardist Magne Furuholmen and guitarist Paul Waaktaar-Savoy. The song starts with a calm verse in F major, before kicking into a hard rock-style chorus with a guitar riff in D minor. In the official A-ha biography, The Swing of Things, Furuholmen said it was \"perhaps one of the most inspired cut and paste-projects that Paul and I did. I wrote the quiet part. Paul wrote the rock part.\" "}]}
