{"album":[{"idAlbum":"2125930","idArtist":"111280","idLabel":null,"strAlbum":"Mirage","strArtist":"Fleetwood Mac","intYearReleased":"1982","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":null,"strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/vj6dde1605169221.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/utyqtx1590338418.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/noxvcx1605169201.png","intScore":"8","strDescriptionEN":"Mirage is the 13th studio album by Fleetwood Mac, released on June 18, 1982.\n\nFollowing a hiatus of over a year after the completion of the worldwide Tusk tour, the band temporarily relocated to Château d'Hérouville in France to record this 12-track collection. By this time Stevie Nicks and Lindsey Buckingham had each commenced a solo side-career, the former to multi-platinum #1 success with 1981's Bella Donna, the latter faring not as well with his first outing Law and Order (US Billboard #32).\n\nMirage found the band venturing further into radio-friendly soft rock than it had in any of its previous incarnations. It stood in stark contrast to its highly experimental predecessor, 1979's Tusk. Mirage yielded several hit singles: \"Hold Me\" (which peaked at #4 on the U.S. Billboard Pop Chart, remaining there for seven weeks), \"Love in Store\" (#22 US Pop Chart), \"Oh Diane\" (which reached #9 in the UK), and finally, \"Can't Go Back\" (issued on 7\" and 12\" in the UK).\n\nThe Stevie Nicks composition \"Gypsy\" (#12 Pop, #4 Rock, and a #1 hit in Canada) was the second single from the album and was accompanied by a lengthy video, the highest-budget music video ever produced at the time, directed by Russell Mulcahy, and was the very first \"World Premiere Video\" on MTV in 1982. The single and album edit of \"Gypsy\" ran for only 4:24, but a 5½-minute version had been originally recorded and it was this version used for the video. This full-length version was not made available on CD until 1992's retrospective box set 25 Years – The Chain.\n\nOf the other two compositions from Nicks on the album, \"That's Alright\" dated back to the Buckingham/Nicks days of 1974, whilst \"Straight Back\" was written in the winter of 1981 and referred to her separation from (then) lover, producer Jimmy Iovine, and the huge wrench she experienced having to leave her newly established and highly successful solo career to re-join Fleetwood Mac for the 1982 project (Nicks refers to this on the DVD commentary to her 2008 retrospective Crystal Visions – The Very Best of Stevie Nicks). \"Straight Back\" was also a US radio hit in winter 1982.\n\nThe album was certified double platinum for shipping 2,000,000 copies in the US and returned the group to the top of the U.S. charts for the first time since their 1977 hit album Rumours, spending five weeks at the top. It also reached #5 in the UK where it was certified platinum for shipping 300,000 copies, and #2 in Australia. The album entered the 'Billboard top 200 albums chart' at #50, it then climbed to #9 the following week, #3 in its third week and began its five-week run at #1 in its fourth week. After five weeks at the top, in its ninth week it fell to #2 where it stayed for eleven weeks. In its twentieth week, the album fell to #13 and dropped to #14 the next week. In its twenty-second week, 'Mirage' plummeted to #33 and fell further the next week to #53. 'Mirage' spent 35 weeks in the top 100, 22 weeks in the top 40 and 19 weeks in the top 10."}]}
