{"album":[{"idAlbum":"2126945","idArtist":"113811","idLabel":"43344","strAlbum":"Flesh & Blood","strArtist":"Poison","intYearReleased":"1990","strStyle":"Rock/Pop","strGenre":"Hard Rock","strLabel":"Capitol Records","strReleaseFormat":"Album","intSales":"7200000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/flesh--blood-4f6708751c5d0.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/flesh--blood-50ea063530ea9.png","intScore":"10","strDescriptionEN":"Flesh & Blood is the third studio album by American glam metal band Poison, released in 1990 through the Enigma label of Capitol Records. The album peaked at #2 on the Billboard charts and it sold over 7.2 million copies worldwide.\n\nThe album was recorded and mixed at Little Mountain Sound Studios, Vancouver, British Columbia, Canada, with Canadian producer Bruce Fairbairn and mixer Mike Fraser.\n\nThe front cover of the album featured the Poison logo and album title as a tattoo on Rikki Rockett's arm. The cover was originally planned to have a slightly different version of the tattoo cover that featured the tattoo after being freshly inked. This showed the skin as red and inflamed with dripping ink or blood. This cover was pulled though and instead a cleaned up tattoo was shown. The original cover was released for the initial pressing in Japan but was subsequently removed from all later pressings (including those in Japan). The record’s marketing reflected the end of the more extreme elements in Poison’s \"glam\" image, including its excessive make-up and teased, girlish hair (see Look What the Cat Dragged In), featuring a look similar to Guns N' Roses.\n\nParts of the album reflected a darker, more serious side to the band, touching themes such as hard times and overcoming them (\"Valley of Lost Souls\", \"Life Loves A Tragedy\", \"Come Hell Or High Water\"), missing loved ones (\"Life Goes On\"), long-term relationships (\"Don’t Give Up an Inch\", \"Ball and Chain\"), and disillusionment (\"Something to Believe In\"). The fun side of the band remained intact, however, in tracks dealing with sex (\"(Flesh & Blood) Sacrifice\", \"Unskinny Bop\"), exhilaration from music or motorbikes (\"Let It Play\", \"Ride the Wind\"), and tongue-in-cheek poverty (\"Poor Boy Blues\").\n\nThe meaning of \"Unskinny Bop\", one of the band's most popular songs, has always been shrouded in obscurity. DeVille later confessed that the phrase \"unskinny bop\" has no particular meaning. He invented it as a temporary measure while writing the song, before vocalist Bret Michaels had begun working on the lyrics. The phrase was used on the basis that it was phonetically suited to the music. The song was later played to producer Fairbairn, who stated that although he did not know what an \"unskinny bop\" was, the phrase was perfect.\n\nFlesh & Blood was voted Best Album in Circus magazine's 1990 Readers' Poll, while \"Something to Believe In\" was voted Best Single. The album was connected to three Metal Edge Readers' Choice Awards in 1990, when the magazine's readers voted it for Album of the Year and \"Something to Believe In\" for Song of the Year and Best Video.\n"}]}
