{"album":[{"idAlbum":"2150249","idArtist":"117645","idLabel":null,"strAlbum":"Decksandrumsandrockandroll","strArtist":"Propellerheads","intYearReleased":"1998","strStyle":"Electronic","strGenre":"Trip Hop","strLabel":null,"strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/decksandrumsandrockandroll-50745780d1787.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/decksandrumsandrockandroll-50745735a1155.png","intScore":null,"strDescriptionEN":"Decksandrumsandrockandroll is the only studio album by the British band Propellerheads, released on 26 January 1998 by Wall of Sound (UK) and DreamWorks (U.S.). The original release of Decksandrumsandrockandroll features 13 tracks.\nMost tracks are instrumental pieces of big beat, breakbeat and trip-hop, sometimes with vocal samples. The exception is \"History Repeating\", which features vocals from veteran singer Shirley Bassey.\n\"On Her Majesty's Secret Service\" is a collaboration with composer David Arnold and his orchestra. It is a remix of John Barry's theme from the James Bond film of the same name which also features a cue from his score for You Only Live Twice (beginning at 4'42\").\nAll tracks were produced by Will White and Alex Gifford. \"Take California\" was the first song to be used in an iPod advertising campaign, appearing in the first commercial for the original model and, in general, the first iPod commercial.\n\"History Repeating\" was used in a Pantene Pro-V shampoo commercial and on the 1998 Jaguar S-type commercial. An instrumental version was also the theme music to UK programme So Graham Norton broadcast on Channel 4 between July 1998 to March 2002.\n\"Bang On\" was featured in the Nintendo 64 game Wipeout 64 and the first episode, \"The Sofa,\" of sitcom 15 Storeys High. It also appeared on the soundtrack to the 1998 film Lost in Space.\n\"On Her Majesty's Secret Service\" was also featured in full on Tony Hawk's prominent skateboarding movie titled \"The End.\"\n\"Spybreak!\" was featured in The Matrix during the famous lobby shootout scene."}]}
