{"album":[{"idAlbum":"2169172","idArtist":"111284","idLabel":null,"strAlbum":"Water & Bridges","strArtist":"Kenny Rogers","intYearReleased":"2006","strStyle":"Country","strGenre":"Country","strLabel":null,"strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/water--bridges-5105ad1734234.jpg","strAlbumThumbBack":null,"strAlbumCDart":"","intScore":null,"strDescriptionEN":"If there was ever a record that sounded like a swan song, Kenny Rogers' fine, vulnerable Water & Bridges is it. The cover is a bit startling; who thought he'd ever age? He always looked like he was somewhere in his middle to late fifties. But that look is traceable if you look deep enough, while Rogers seems to wear his age proudly, like Kris Kristofferson and Willie Nelson. The disc sounds like a goodbye to all the illusions, regrettable mistakes, and foolhardiness brought by living into the wisdom brought by the golden years. Rogers' career has seen so many heights, it's dizzying to think about. And he's still hanging out on Capitol while many of his contemporaries are struggling on independent labels, if they're recording at all. Water & Bridges isn't a perfect record, but it's a sincere one, and there are many tracks here that no other singer could pull off. And to be truthful, as in his very best material, Rogers has this uncanny ability to make everything on this record sound like it came from his own pen. It's a melancholy record about passage, from one stage to the next, of life, of love, of youth, of ignorance, of spirit. The 11 tracks here are all slow, all reflective. It's that particular brand of slick, soft, modern country and pop that he does better than anyone. There is one true dud in the bunch called \"The Last Ten Years (Superman),\" which is merely a novelty song about all the famous ones who passed on in the last decade. But there are so many tracks here where one can hear the spirit of mortality railing against the dying of the light. There is the title cut, which opens the disc and charts generations of fathers hurting their sons both born and unborn, where the protagonist finds himself as guilty as anybody he's charged; \"Someone Is Me,\" about taking on civic responsibility; the killer \"Someone Somewhere Tonight,\" which finds magic in the mere presence of everyday life. Don Henley joins Rogers on \"Calling Me.\" It's a white man's country-soul tune that sounds too much like Curtis Mayfield's classic \"People Get Ready.\" (Litigants get ready, set, go!) The vocal performances are stellar. \"I Can Feel You Drifting\" is a fine pop song, and it's a true heartbreaker. In the now thinning grain of Rogers' awesome voice, all the emptiness and sorrow and confusion in the world comes to call. Water & Bridges is as good as anything out there in 2006 and a whole lot better than most of the dross Nash Vegas shovels out. Hopefully Rogers scores big one more time."}]}
