{"album":[{"idAlbum":"2181276","idArtist":"111418","idLabel":"46036","strAlbum":"In Rainbows","strArtist":"Radiohead","intYearReleased":"2007","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"XL Recordings","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/in-rainbows-4e23e3fb94942.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/in-rainbows-4ec68b7911f1c.png","intScore":"9","strDescriptionEN":"In Rainbows is the seventh studio album by the English alternative rock band Radiohead. It was self-released on 10 October 2007 as a download via a pay-what-you-want model, followed by a standard CD release in most countries in the last week of 2007. The album was released in North America on 1 January 2008 on TBD Records. In Rainbows was Radiohead's first release after the end of their contract with EMI and the end of the longest gap between studio albums in their career.\n\nRecording with producer Nigel Godrich, Radiohead worked on In Rainbows for more than two years, beginning in early 2005. In between recording, the band toured Europe and North America for three months in mid-2006. The songwriting on In Rainbows was more personal than other Radiohead albums, with singer Thom Yorke describing most tracks as his versions of \"seduction songs\". Radiohead incorporated a wide variety of musical styles and instruments, using not only electronic music and string arrangements, but also pianos, celestes, and the ondes Martenot.\n\nUpon its retail release, In Rainbows entered the UK Albums Chart and the US Billboard 200 at number one; by October 2008, it had sold more than three million copies worldwide in both digital and physical formats. The album earned widespread critical acclaim and was ranked as one of the best albums of 2007 by several publications. In 2009, it won two Grammy Awards for Best Alternative Music Album and Best Special Limited Edition Package."}]}
