{"album":[{"idAlbum":"2205903","idArtist":"111239","idLabel":"45114","strAlbum":"Ghost Stories","strArtist":"Coldplay","intYearReleased":"2014","strStyle":"Rock/Pop","strGenre":"Pop-Rock","strLabel":"Parlophone","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/ghost-stories-5338d48badacf.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/xsvvxx1429215714.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/xupxpu1429191464.png","intScore":"7.4","strDescriptionEN":"Ghost Stories is the sixth studio album by British rock band Coldplay. The album, co-produced by the band with Paul Epworth along with returning Mylo Xyloto producers Daniel Green, and Rik Simpson, was released by Parlophone on 16 May 2014. The album was released by Atlantic Records in North America on 19 May 2014. It is the first full-length release by the band in North America under Atlantic, after Coldplay were transferred from Capitol Records in 2013, following the purchase of EMI and its assets by the Universal Music Group in 2012.\nGhost Stories, partly inspired by lead singer Chris Martin's troubled relationship with Gwyneth Paltrow at the time of the album's recording, is a concept album that tells the story of a man going through a dramatic and sudden breakup, with the narrative following the man's various emotional states leading up to his eventual acceptance of the situation. The album revolves around a central theme of \"opening yourself up to love\", and accepting that love does not last forever. The album was recorded by the band throughout 2012 and 2013 at the band's purpose-built home studios in London, England, and features guest producers Avicii, Timbaland and Madeon, in addition to the band's frequent collaborator, Jon Hopkins. The album is packaged with original etchings by Mila Fürstová, created specifically for the album.\nThe album was heavily promoted by the band and Parlophone in the lead-up to its release, with an accompanying prime time TV special, a visual album and a six-date promotional tour of the album, as well as various appearances on television and radio. The album was further promoted by three singles: \"Magic\", released in March, \"Midnight\", released in April, and \"A Sky Full of Stars\", released in May 2014.\nIn 2011, Coldplay released their fifth studio album, Mylo Xyloto. Originally conceived by the band as a \"stripped-down, more acoustic collection\", it became one of Coldplay's most experimental and pop-oriented records to date, being described as \"luxuriously colourful\" where \"the choruses are bigger, the textures grander  the optimism more optimistic.\" Produced by Markus Dravs, Brian Eno, Rik Simpson and Dan Green, the album peaked at #1 on 18 national album charts and certified Platinum in 16 different countries. Mylo Xyloto had also sold 8 million copies within the first year of release. Coldplay's 2011 single, \"Paradise\", became the band's second UK #1 single after 2008's \"Viva la Vida\". Coldplay's subsequent world tour in promotion of Mylo Xyloto visited North America, Europe, Australasia and Africa, raising over 100 million in revenue.\nGoing into the creative process for their sixth studio album, the band wanted to return to the \"stripped-down, more acoustic collection\" they had stated their fifth album would be, returning to the original idea of an acoustic-oriented album, with less of the production and sound that made Mylo Xyloto."}]}
