{"album":[{"idAlbum":"2215925","idArtist":"117697","idLabel":"45768","strAlbum":"Girl","strArtist":"Pharrell Williams","intYearReleased":"2014","strStyle":"Urban/R&B","strGenre":"Hip-Hop","strLabel":"Star Trak","strReleaseFormat":"Album","intSales":"533000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/g-i-r-l-530f9737c2142.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/g-i-r-l-532b3a0545163.png","intScore":"7","strDescriptionEN":"Girl (stylized as G I R L) is the second studio album by American recording artist and record producer Pharrell Williams. The album was released on March 3, 2014, through Williams' label i Am Other and Columbia Records. Girl is Williams' first studio album in eight years, following his 2006 debut, In My Mind. The album contains appearances by Justin Timberlake, Miley Cyrus, Daft Punk and Alicia Keys.\n\nThe album received generally positive reviews from music critics. It peaked at number one in 12 countries worldwide, also charting in the top 10 of 17 other countries. The album has sold 519,521 copies in the United States as of September 17, 2014.\n\nThe album's lead single is the Academy Award-nominated song \"Happy\" (from the Despicable Me 2 soundtrack), which is a huge worldwide success, selling more than 10 million copies worldwide. Further singles \"Marilyn Monroe\", \"Come Get It Bae\" and \"Gust of Wind\" have achieved moderate success.\n\nAt the 57th Grammy Awards, the album is nominated for Album of the Year and Best Urban Contemporary Album. The track Happy was nominated for Best Pop Solo Performance and Best Music Video.\nWilliams provided vocals for French duo Daft Punk's 2013 album Random Access Memories. After returning from the Paris recording sessions, he attended a meeting with record label managers, who said that the results were \"spectacular\" and that \"Get Lucky\" would be Daft Punk's next single. They also made Williams an offer to record his own album, to which he agreed quickly, \"overwhelmed that someone wanted to know what's in my heart.\"\n\nOn December 17, 2013, it was announced that Williams had signed to Columbia Records and would release his second studio album in 2014. In a December 2013, press release Rob Stringer, Chairman of Columbia Records, said, \"When we excitedly partnered with Pharrell in January of this year, we felt it was his time again. Since then, 'Blurred Lines' and 'Get Lucky' have defined pop music in 2013, and now we are preparing to launch Pharrell as a global solo superstar in 2014. 'Happy' is just the beginning.\"\n\nOn February 18, 2014, Williams unveiled a trailer for the album. The next day, he said in a statement, \"When Columbia Records presented me with the opportunity to make an album, three things came to mind, One was the sense of overwhelming honor that I felt when I realized that they were interested in partnering with me on the album that I had always dreamt of making. Two, it would have to feel festive and urgent. And three, I instantly knew it would be called G I R L. I hope you like it.\"\nCalled a feminist \"almost-concept\" album in early reviews, Girl is Williams' attempt to \"eliminate what he sees as an understandable degree of uncertainty over what his attitude to women actually is.\" He said that he felt the need to clarify himself in the wake of \"Blurred Lines\" controversy, as with the song's \"questionable lyrics, and the nature of the aesthetic of the video, it's easy to get confused about that.\" Williams also stated, \"There's an imbalance in society, in my opinion, and it's going to change. A world where 75 percent of it is run by women – that's a different world. That's gonna happen, and I want to be on the right side of it when it does.\"\n\nInterviewed by Zane Lowe backstage at the 2014 BRIT Awards, Williams specified that the capitalization and double-spacing of the album title is deliberately designed, \"Because when you look at it, it looks a little weird... Because society is a little unbalanced.\" He also added that he wished to honor the female figures that had been part of his life by making the record.\nThe opening track on the album, \"Marilyn Monroe\", begins with an orchestral string introduction. The song's production is characterized by Williams' signature \"skittering\" beat and \"bumping\" bass line, and its lyrics discuss \"helpless romantics and the perfect lady.\"\n\nThe album's first single, \"Happy\", is a neo soul and funk song that Williams sings in a falsetto singing tone.\n\n\"Come Get It Bae\", which features uncredited guest vocals from Miley Cyrus, is a funk song with playful beat, Lyrically, the song is based around sex and the metaphor \"You want to ride my motorcycle?\" serving as a double entendre for sex."}]}
