{"album":[{"idAlbum":"2219464","idArtist":"111971","idLabel":"43287","strAlbum":"The Light Between Us","strArtist":"Scouting for Girls","intYearReleased":"2012","strStyle":"","strGenre":"Pop","strLabel":"Warner Bros. Records","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/the-light-between-us-531ba40119ef6.jpg","strAlbumThumbBack":null,"strAlbumCDart":"","intScore":null,"strDescriptionEN":"London's most successful post-Brit-pop non-innovators offer up another radio-ready set of slickly produced, imminently disposable earworms on their third studio outing, the relentlessly upbeat (except for the painfully self-aware breakup songs) The Light Between Us. Curiously mislabeled as indie rockers, Scouting for Girls are really just the English equivalent of enormously popular, yet critically maligned, mainstream U.S. hitmakers like Train, John Mayer, and even Smash Mouth. The group's detractors, and there are many, will find considerable amounts of ammunition here, though none of it new. The band's penchant for crafting big, hook-filled summer jams that pair generic melodies with painfully obvious rhymes is in full swing, but there's a workmanlike precision to The Light Between Us that demands a little respect. After all, unless you're Paul McCartney, it's hard to apply a substantial amount of passion to the middle of the road. While songs like \"Without You\" and \"Snakes and Ladders\" do feel a little like audio lessons from a Coldplay for Dummies book, the band's sheer exuberance, along with vocalist Roy Stride's versatile pipes, which can go from conversational lad-rock bravado to a soaring falsetto in a matter of seconds, helps to keep things from becoming completely submerged in a sea of mediocrity. At its best, The Light Between Us serves up its forgettable confections in a tidy wrapper, which allows standout cuts like \"Summertime in the City\" and \"Rocky Balboa\" to slide down the listener's throat without injury, but too much of anything can cause a sour stomach, especially cheese."}]}
