{"album":[{"idAlbum":"2219903","idArtist":"111233","idLabel":"45344","strAlbum":"Sonic Highways","strArtist":"Foo Fighters","intYearReleased":"2014","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"RCA","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/sonic-highways-53f7755b42c87.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/wrpupw1534798794.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/sonic-highways-54a0011ea36a2.png","intScore":"6.8","strDescriptionEN":"Sonic Highways is the eighth studio album by the American rock band Foo Fighters, scheduled for release on November 10, 2014, through RCA Records. As part of a companion HBO television series, Foo Fighters Sonic Highways, the band recorded eight songs for the album, each in a different US city: Austin, Chicago, Los Angeles, Nashville, New Orleans, New York, Seattle, and Washington, D.C. It will be available on CD, vinyl and as a digital download. The album's lead single \"Something from Nothing\" was released on October 16, 2014.\nDespite initially announcing a break after supporting Wasting Light, Grohl later stated in January 2013 that the band had started writing material for an eighth studio album. On February 20, 2013, at the Brit Awards, Grohl said he was flying back to America the following day to start work on the next album. In an August 2013 interview with XFM, Grohl announced that their next album has been slated for a 2014 release, saying:\n\n\"Well, I’ll tell you, we have been in our studio writing and in the past few weeks we’ve written an album and we are going to make this album in a way that no-one’s ever done before and we’re pretty excited about it... It’s a little ways off – it’s not ready to happen right now – but I think next year is going to be a really big year for the Foo Fighters, without question.\"\n\nAccording to lead guitarist Chris Shiflett, Grohl would finish the lyrics just before recording his vocals, the last part of each song. This time the compositions would drift away from \"love letters and confused relationships\" to deal with the feelings Grohl had regarding each city during production.\nOn September 6, 2013, lead guitarist Chris Shiflett posted a photo to his Instagram account that had indicated 13 songs were being recorded for the album. Keyboardist Rami Jaffee has recorded parts for three songs, one of which is entitled \"In The Way.\" Butch Vig, who produced the band's prior album, Wasting Light, confirmed he produced Sonic Highways as well. On July 30, 2014, Vig revealed that the band had finished recording and mixing the new album and it is slated to be released a month after the Sonic Highways TV series. In an August 2014 press release Grohl spoke about the album, saying: \"This album is instantly recognizable as a Foo Fighters record, but there's something deeper and more musical to it. I think that these cities and these people influenced us to stretch out and explore new territory, without losing our ‘sound’.\""}]}
