{"album":[{"idAlbum":"2225934","idArtist":"114415","idLabel":"44378","strAlbum":"Smoke + Mirrors","strArtist":"Imagine Dragons","intYearReleased":"2015","strStyle":"Rock/Pop","strGenre":"Indie","strLabel":"Interscope Records","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/tsywrt1418772250.jpg","strAlbumThumbBack":null,"strAlbumCDart":"","intScore":"6","strDescriptionEN":"Smoke and Mirrors (stylized Smoke + Mirrors) is the second studio album by American rock band Imagine Dragons. Self-produced by members of the band along with English hip-hop producer Alexander Grant, known by his moniker Alex Da Kid, the album is set to be released by Interscope Records and Grant's KIDinaKORNER label on February 17, 2015 in the United States. Pre-orders for the album became available on December 15, 2014.\nIn 2012, Imagine Dragons released their debut studio album Night Visions. The album, produced by the band along with Alexander Grant and Brandon Darner, launched the band into international mainstream commercial success, charting within the top ten of 14 national record charts, in addition to charting on eight others. Certified Platinum by seven national music associations, including 2xPlatinum in the United States by the RIAA and 3xPlatinum in Canada by Music Canada, the album was initially met with first week sales in excess of 83,000 copies, the highest charting for a debut rock album since 2006. The album was also nominated for the 2014 Juno Award for International Album of the Year.\n\nThe band released six singles during the Night Visions album cycle in 2012 and 2013, five of which charting on the Billboard Hot 100. \"Radioactive\", a 2013 single, sold more than six million singles in the United States, spending more than 1 year consecutively on the Billboard Hot 100. Peaking at no. 3 on the chart, it also broke the record for the longest run into the top five and is the best-selling rock single on the Nielsen SoundScan running list of best-selling rock tracks in digital history. Billboard listed the band as one of \"2012's Brightest New Stars\" and later \"The Breakout Band of 2013\".\n\nTo further promote the already-successful Night Visions, the band set out on a year-long concert tour beginning in early 2013 and ending in mid-2014, dubbed the \"Night Visions Tour\". The tour spanned for over 170 dates, and visited North America, South America, Europe and Oceania. An additional tour of North America, dubbed the \"Into the Night Tour\", was also executed. The conclusion of the Into the Night Tour signaled the end of the Night Visions album cycle, with Night Visions Live, a live album, serving as the last release in the cycle. Lead singer Dan Reynolds joked about the end of the Night Visions cycle, saying that \"We're always writing on the road,  that second album will come, unless we die at the age of 27 next year. Hopefully we don't die and there will be a second album. I don't know when it will be, but it may come\". The band were also inspired greatly by the band's experiences on the Night Visions Tour. Dan Reynolds told New Orleans-based newspaper The Times-Picayune that the world tour had \"a lot of inspiration to be drawn\", and further stating, \"You kind of realize that you’re a lot smaller than you think.\"\n\nThe idea behind the second studio album, dubbed as their \"new year's resolution\", was to create music and finish it when the band feels that their work is done. Reynolds told MTV in 2014 that the band wanted to \"put out an album that  really happy with\". He further said that \"we tend to be perfectionists, too hard on ourselves at times, and we don't want to rush anything because we know how we are with things. We don't want to put a record out until we really feel good about it, you know, and who knows how long that will take\".\nReynolds stated to music magazine Rolling Stone that the next album will be \"different\" from Night Visions, and that the band intends the album to be \"stripped back quite a bit\". He added that \"we embraced a lot of hip-hop influences with Night Visions, but I think the next record will be more rock-driven. It’s too early to say, but there is some weird stuff going on in these songs\".\n The creative process for the album began long before the conclusion of the Night Visions cycle. Since the beginning of the Night Visions Tour in 2012, the band had been writing new material for an upcoming album, and, even as early as the start of the tour, had been recording demos for the album, before entering the studio. By the time that they entered the studio to work on the album, they had amassed 50 demos to work from. The demos had been described by Reynolds as \"definitely different\", but added that \"it’s still Imagine Dragons, but we’ve got a lot of growth and maturing do do as a band. I think  is going to hopefully be a step in the right direction. We’re just trying to create and do what comes out and what feels right\". The band also were self-critical throughout the sessions, with Drummer Daniel Platzman stating that there was \"no room for external pressure\" during the recording of the album.\n\nThe band announced a rest at the end of the Night Visions Tour at Lollapalooza in Sao Paulo, Brazil and complemented saying, \"This is our last show for a while, and had no better place to end this tour\". Preparations for the album began the next day, with the band entering the Studio at the Palms to work on a new album on April 15, 2014. The band marked this occasion with various tweets including a picture of Wayne Sermon at a desk with recording software open."}]}
