{"album":[{"idAlbum":"2241680","idArtist":"111827","idLabel":"43344","strAlbum":"PRISM","strArtist":"Katy Perry","intYearReleased":"2013","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"Capitol Records","strReleaseFormat":"Album","intSales":"4000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/rvurxy1476920001.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/yxyxvu1496590822.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/utrpst1452622503.png","intScore":"7.5","strDescriptionEN":"Prism is the fourth studio album by American singer Katy Perry. It was released by Capitol Records on October 18, 2013. While the album was initially planned to be \"darker\" than her previous material, Prism ultimately became a prominently dance-inspired record. The singer worked with several past collaborators, while enlisting new producers and guest vocals. Much of Prism revolves around the themes of living in the present, relationships, and self-empowerment. Critical response to Prism was generally mixed; many reviewers deemed the lyrical content more mature while others considered the album to be more formulaic than her previous material.\n\nThe album debuted atop the US Billboard 200 with 286,000 copies sold, becoming Perry's best opening week to date. The album also peaked at number one in Australia, Canada, Ireland, New Zealand, and the United Kingdom. Prism became Perry's fastest-selling album, the second best-selling album in Australia in 2013, and the second best-selling album released by a woman in the United States in 2013. The International Federation of the Phonographic Industry (IFPI) reported that Prism was the sixth best-selling album in the world in 2013, the best-selling album in the world in 2013 released by a woman, and labeled Perry \"a global phenomenon.\" It has globally sold 4 million copies as of August 2015. The album's success continued throughout 2014, ranking within the top 10 of the annual charts for 2014 in the United States, Canada, Australia, and New Zealand, and earned Perry a Grammy Award nomination for Best Pop Vocal Album at the 57th Annual Grammy Awards.\n\nThe release of the album was preceded by the release of two singles. \"Roar\" was released on August 10, 2013 as the album's lead single. It became a commercial success and topped the Billboard Hot 100. \"Unconditionally\" debuted on October 16, 2013 as the record's second single and was a moderate commercial success worldwide. In between the release of these two tracks were the releases of promotional singles \"Dark Horse\" on September 17 and \"Walking on Air\" on September 30, 2013. \"Dark Horse\" was released as the album's third single three months later on December 17, 2013, and also reached number one on the Billboard Hot 100. \"Birthday\" and \"This Is How We Do\" were the fourth and fifth singles, respectively. Prism was further promoted through The Prismatic World Tour."}]}
