{"album":[{"idAlbum":"2256051","idArtist":"111444","idLabel":"43473","strAlbum":"★","strArtist":"David Bowie","intYearReleased":"2016","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":"Columbia","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/blackstar-56531f2e43b6c.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/yytqty1575172321.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/uyyypu1575172380.png","intScore":"9","strDescriptionEN":"Blackstar (stylised as ★) is the twenty-fifth and final studio album by English singer-songwriter David Bowie. It was released worldwide through Bowie's ISO Records label on 8 January 2016, Bowie's 69th birthday. Bowie died two days after its release. Co-producer Tony Visconti described the album as Bowie's intended swan song and a \"parting gift\" for his fans before his death.\n\nBlackstar was met with critical acclaim and commercial success, reaching the number one spot in a number of countries in the wake of Bowie's death, and becoming Bowie's first and only album to reach number one on the Billboard 200 album chart in the U.S. The album remained at the number one position in the UK charts for three weeks before being replaced by one of Bowie's compilation albums, Best of Bowie.\n\nBowie recorded the album in the midst of an ongoing battle with cancer. His illness was only known by those very close to him and that remained so until the news of his death became public, two days after the album's release. It became apparent immediately after that many lyrics seem to come from a man who knows death is near. Like The Next Day, recording of this album took place in secret at The Magic Shop and Human Worldwide Studios in New York City. Bowie began writing and making demos for songs that appear on Blackstar as soon as sessions for The Next Day concluded. Two songs that appear on Blackstar, \"Sue (Or in a Season of Crime)\" and \"'Tis a Pity She Was a Whore\", were previously released, but were re-recorded for Blackstar, including new saxophone parts played on the latter song by Donny McCaslin (replacing parts Bowie played on the original release). The title of the latter derives from the title 'Tis Pity She's a Whore, a play by John Ford, an English dramatist of the 17th century. McCaslin and the rest of the jazz group recorded their parts in the studio over a period of about one week a month from January to March 2015, and were unaware of Bowie's declining health. The song \"Lazarus\" was included in Bowie's Off-Broadway musical of the same name.\n\nThe music on Blackstar has been characterized as incorporating art rock, jazz, and experimental rock, as well as elements from industrial rock, folk-pop and hip hop. According to producer Tony Visconti, they deliberately attempted \"to avoid rock’n’roll\" while making the album, and he and Bowie had been listening to rapper Kendrick Lamar's 2015 album To Pimp a Butterfly during the recording sessions and cited it as an influence. Electronic duo Boards of Canada and experimental hip-hop trio Death Grips have also been cited as influences. Saxophone was the first instrument Bowie learned, and he was a keen listener to jazz in his youth. Both Billboard and CNN noted that Bowie's lyrics seem to revolve around his impending death, with CNN noting that the album \"reveals a man who appears to be grappling with his own mortality\"."}]}
