{"album":[{"idAlbum":"2261888","idArtist":"111493","idLabel":"46036","strAlbum":"25","strArtist":"Adele","intYearReleased":"2015","strStyle":"Rock/Pop","strGenre":"Soul","strLabel":"XL Recordings","strReleaseFormat":"Album","intSales":"25000000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/qrwyvp1521232203.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/yytpvw1513331726.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/25-5658ab9f86dbd.png","intScore":"8.8","strDescriptionEN":"25 is the third studio album by British singer and songwriter Adele. It was released on 20 November 2015, through XL Recordings. Following the release and international success of her second studio album 21 (2011), Adele considered quitting the music industry and going out on a positive note. However, she decided to take a hiatus instead and raise her son. During her sabbatical, she suffered from writer's block and rescheduled studio sessions for a new album, fearing she had lost her ability to write songs. In 2013, Adele had a breakthrough and the material that eventually became 25 manifested, with writing and recording continuing through 2015.\n\nTitled as a reflection of her life and frame of mind at 25 years old, 25 is a \"make-up record\". The album's lyrical content features themes of Adele \"yearning for her old self, her nostalgia\", and \"melancholia about the passage of time\" according to an interview with Adele by Rolling Stone, as well as themes of motherhood and regret. In contrast to Adele's previous work, the production of 25 incorporated the use of electronic elements and creative rhythmic patterns, with elements of 1980s R&B and organs. Like 21, Adele collaborated with producer and songwriter Paul Epworth and Ryan Tedder, along with new collaborations with Max Martin and Shellback, Greg Kurstin, Danger Mouse, the Smeezingtons, Samuel Dixon, and Tobias Jesso Jr.\n\n25 received generally positive reviews from music critics, who commended Adele's vocal performance. The album achieved commercial success by debuting at number one in more than 25 markets and broke first-week sales records in multiple countries, including the United Kingdom and United States; in the US, the album sold 3.38 million copies in its first week of release, marking the largest single-week sales for an album since Nielsen SoundScan began tracking point-of-sale music purchases in 1991. 25 eventually became the best-selling album of 2015 in the US and UK market and has sold over 19 million copies worldwide as of February 2016. Many journalists felt that the album impacted the music industry by encouraging the public to return to buying physical albums, instead of downloading or streaming."}]}
