{"album":[{"idAlbum":"2267730","idArtist":"112627","idLabel":"42884","strAlbum":"E•MO•TION","strArtist":"Carly Rae Jepsen","intYearReleased":"2015","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"604 Records","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/emotion-5616a345445b0.jpg","strAlbumThumbBack":null,"strAlbumCDart":"","intScore":null,"strDescriptionEN":"Emotion (stylized as E•MO•TION) is the third studio album by Canadian singer Carly Rae Jepsen. It was released on June 24, 2015 in Japan and on August 21, 2015 worldwide through 604, School Boy, and Interscope Records. Looking to transition from the \"pure pop\"-oriented nature of Kiss, Jepsen found inspiration in 1980s music and alternative styles. She enlisted a team of indie-pop collaborators including Dev Hynes, Ariel Rechtshaid and Rostam Batmanglij.\n\nEmotion received highly positive reviews from contemporary music critics, who placed the album on many year-end lists. Despite this, the album underperformed worldwide, debuting at number sixteen on the Billboard 200 with 16,153 units and number eight in Canada with 2,600 copies sold. However, Emotion was a success in Japan where it was released two months earlier, debuting at number eight with 12,189 physical copies sold and subsequently being certified Gold for shipments exceeding 100,000 copies by the RIAJ.\n\nThe album was preceded by the release of its lead single, \"I Really Like You\", which reached top five in several territories including the United Kingdom and Japan. It was followed by \"Run Away with Me\" and \"Your Type\", both singles achieved moderate chart success around the world. Jepsen embarked on the Gimmie Love Tour in support of the album in November 2015, with a second leg commencing in February 2016. In April 2016, she toured Canada in support of the album as the opening act for Hedley on their Hello World Tour.\n\nA companion EP, titled Emotion: Side B, was released on August 26, 2016 and features eight songs that were cut from Emotion."}]}
