{"album":[{"idAlbum":"2277991","idArtist":"111611","idLabel":"46413","strAlbum":"รท","strArtist":"Ed Sheeran","intYearReleased":"2017","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":"Atlantic","strReleaseFormat":"Album","intSales":"6100000","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/qxxwvy1512727762.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/yyqquv1498815656.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/wtwtwy1498815765.png","intScore":"7.3","strDescriptionEN":"รท (pronounced \"divide\") is the third studio album by English singer-songwriter Ed Sheeran. It was released on 3 March 2017 through Asylum Records and Atlantic Records. \"Castle on the Hill\" and \"Shape of You\" were released as the album's lead singles on 6 January 2017.\n\nOn 13 December 2015, Sheeran announced a self-imposed hiatus from social media, commenting that he found himself \"seeing the world through a screen and not my eyes.\" He further ensured that some of this time would be spent creating his third album, which he considered \"the best thing I have made thus far.\" Exactly one year after this announcement, on 13 December 2016, Sheeran's various social media platforms posted pictures of a blank blue square to state his imminent return to music. On 1 January 2017, Sheeran officially ended his hiatus by announcing that \"new music\" would be released on 6 January. On 12 January 2017, Sheeran revealed the track list and the release date for the album.\n\nThe album รท received mostly positive reviews from critics. Harriet Gibsone of The Guardian gave the album a negative two-star rating out of five, calling it \"no less calculating than his peers at the very top level of pop stardom\". Roisin O'Connor of The Independent gave it a four-star rating, claiming \" leans on little asides from Sheeran's own talent\" and that it was \"astonishing for its sheer ambition alone\". After commenting on the album's \"missteps,\" Mark Kennedy of the Associated Press said that it \"is certain to add listeners, subtract a few weary of his inconsistency, but definitely multiply his bank account,\" and ultimately called Sheeran \"a special talent.\"\n\nThe album sold 232,000 physical and digital copies in the UK in its first day of release without the inclusion of streaming data, more than the sales of Sheeran's previous album x in its first week. The tracks of the album also achieved a total of 56.73 million streams worldwide on Spotify in a single day, breaking the previous record of 29 million for Starboy by The Weeknd in November 2016. In total, all tracks by Sheeran were streamed 68.7 million times that day, breaking the previous record of 40.3 million streams of The Weeknd, with the single from รท \"Shape of You\" receiving 10.12 million streams, itself another record.\n\n\"Castle on the Hill\" and \"Shape of You\", the album's lead singles, were issued on 6 January 2017. Sheeran teased the tracks on social media during the week leading up to their release, posting instrumental extracts and each song's opening lyric."}]}
