{"album":[{"idAlbum":"2279758","idArtist":"111239","idLabel":"45114","strAlbum":"A Head Full of Dreams","strArtist":"Coldplay","intYearReleased":"2015","strStyle":"Rock/Pop","strGenre":"Alternative Rock","strLabel":"Parlophone","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/rfxqv51605619109.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/swrptx1534798304.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/58my141605619117.png","intScore":"6.8","strDescriptionEN":"A Head Full of Dreams is the seventh studio album by British rock band Coldplay. It was released on 4 December 2015 by Parlophone and Atlantic Records. It is the second album by the band in North America under Atlantic, after Coldplay were transferred from Capitol Records America in 2013.\n\nFor various songs on the album, Coldplay collaborated with Beyoncé, Noel Gallagher, Tove Lo, Khatia Buniatishvili and Merry Clayton. The album was produced by Rik Simpson and Stargate. Coldplay have also revealed that the album features a sample of the U.S. President Barack Obama singing \"Amazing Grace\" at Clementa C. Pinckney's funeral on the track \"Kaleidoscope\".\n\nColdplay began working on A Head Full of Dreams in the summer of 2014 while they were promoting their sixth album Ghost Stories. In an interview with Radio 2 DJ Jo Whiley in December 2014, bassist Guy Berryman and guitarist Jonny Buckland gave a hint as to the difference between A Head Full of Dreams and its predecessor – Buckland called it the \"night to the day\", comparing the style of Ghost Stories to the expected uplifting theme of A Head Full of Dreams. Frontman Chris Martin hinted at the style of the album by saying that the band was trying to make something colourful and uplifting. He also stated that it would be something to \"shuffle your feet\" to.\n\nOn 26 September 2015, the band performed at the Global Citizen Festival 2015 in New York City, playing a six-song set, including a new song called \"Amazing Day\". The band's producer Rik Simpson confirmed that the song would be on the new album.\n\nThe album has been produced by Rik Simpson (the band's longterm collaborator) and Norwegian duo Stargate (Tor Hermansen and Mikkel Eriksen). Mixing duties were carried out predominately by Rik Simpson. Stargate executive produced the album."}]}
