{"album":[{"idAlbum":"2281777","idArtist":"114415","idLabel":"44378","strAlbum":"Evolve","strArtist":"Imagine Dragons","intYearReleased":"2017","strStyle":"Rock/Pop","strGenre":"Indie","strLabel":"Interscope Records","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/uyrxtv1511168288.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/rqrxxt1533114667.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/syspvp1589140998.png","intScore":"7.3","strDescriptionEN":"Evolve (stylized as ƎVOLVE) is the upcoming third studio album by American rock band Imagine Dragons, scheduled to be released on June 23, 2017 through KIDinaKORNER and Interscope Records. The album is the band's new material follow-up to their second studio album, Smoke + Mirrors.\n\nAfter the release of Smoke + Mirrors and its respective world tour, a self-imposed hiatus for 2016 and cryptic messages from the band through their social media gained anticipation for their third album. The album was finally announced on May 9, with the initiation of the album's pre-order. In comparison to Night Visions and Smoke + Mirrors, frontman Dan Reynolds explained that the album will be an 'evolution for Imagine Dragons'.\n\nThe album was promoted by two singles: \"Believer\" and \"Thunder\" as well as an upcoming tour produced by Live Nation and supported with Grouplove and K.Flay will start in September 2017.\n\nIn February 2016, after the success of their second album Smoke + Mirrors and a ten month long world tour, the members of Imagine Dragons vowed to take time off from the band. In an interview with Billboard, lead singer Dan Reynolds stated that the group would be on hiatus for the remainder of the year, explaining \"We  haven't stopped in, like, six years, so we've forced ourselves to at least take a year off.\" Throughout 2016, the band contributed songs to the soundtracks for Me Before You, Suicide Squad and Passengers, as well as playing at several shows.\n\nThe band first began teasing their third album on September 13, 2016, with a picture of guitarist Wayne Sermon in the band's recording studio and continued releasing cryptic messages over the next four months. On January 24, 2017, the band tweeted \"goodnight +\", effectively ending the Smoke + Mirrors album cycle.\n\nReynolds had noted that the album, compared to Night Visions and Smoke + Mirrors, is \"an evolution for Imagine Dragons\"."}]}
