{"album":[{"idAlbum":"2281444","idArtist":"111827","idLabel":null,"strAlbum":"Witness","strArtist":"Katy Perry","intYearReleased":"2017","strStyle":"Rock/Pop","strGenre":"Pop","strLabel":null,"strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/vyrvpr1551020367.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/ssyyvx1562242651.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/vuxvxr1551020178.png","intScore":"6.6","strDescriptionEN":"Katy Perry achieved maturation with Prism, the 2013 album anchored on the self-empowerment anthem \"Roar\" and the club smash \"Dark Horse.\" Considering how \"Roar\" scored the closing stages of Hillary Clinton's 2016 campaign, it would've seemed like a logical move for Perry to build upon its adult alternative affirmation but she's instead chosen to use \"Dark Horse\" as a blueprint for Witness, the long-awaited 2017 successor to Prism. Perhaps Perry shifted her approach after \"Rise,\" the \"Roar\"-alike written for the 2016 Olympics that she also performed at that year's Democratic National Convention, failed to crack the Top Ten, perhaps she always planned to construct this album with electronic beats and synths, but Witness is so slick with synths it seems slippery. It also feels relentless and a shade desperate. Some of this is due to timing. Arriving on the heels of Prism, a record littered with AAA crossover ballads, the dance-heavy Witness feels like a slide backwards into adolescence, even if the album is filled with songs where Perry attempts to address big cultural issues while walking a musical cutting edge. These conflicting desires surface on a tune as effervescent as \"Chained to the Rhythm\" -- the only track here that could be called that, although \"Pendulum\" comes close -- and a song as somnolent as \"Bigger Than Me,\" the second of two ballads on the record and the one that addresses the fallout of the 2016 presidential election. Despite some sociological broad strokes, Perry generally keeps her focus personal -- and usually romantic, although \"Swish Swish\" plays like a swipe at another superstar -- a decision that, when married to aggressive EDM-pop, erodes whatever adult contemporary progress Perry made with Prism. So, Witness is a conceptual muddle but that incoherence could've been excused if there were hooks in either its grooves or melodies. Instead, Witness is populated with busy, tuneless tracks that seemed designed to pulsate in the background of a regrettable night. Perry's insistence on delving deep into electronic dance doesn't play like a pop visionary charting new directions forward; it seems anxious, as if she can sense her youth -- and perhaps more importantly, her stardom among youth -- slipping away."}]}
