{"album":[{"idAlbum":"2288208","idArtist":"111766","idLabel":"43488","strAlbum":"Synthesis","strArtist":"Evanescence","intYearReleased":"2017","strStyle":"Rock/Pop","strGenre":"Rock","strLabel":"Concord Music Group, Inc.","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/9qoozk1596629274.jpg","strAlbumThumbBack":"https://www.theaudiodb.com/images/media/album/thumbback/n5h2fe1596628831.jpg","strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/495dt41596629156.png","intScore":null,"strDescriptionEN":"Synthesis is the fourth studio album by American rock band Evanescence. It was released on November 10, 2017, by BMG Rights Management. The album includes reworked versions of the band's previous material with an orchestral arrangement and electronica music elements, in addition to two new songs, thus making it both a studio album and a compilation album. David Campbell was responsible for the arrangement, along with Amy Lee and producer William B. \"Science\" Hunt (no relation to the band's drummer, Will Hunt). In order to promote the new material, Evanescence embarked on the Synthesis Tour, which opened on October 14, 2017, in Las Vegas and will visit cities across the United States and Canada until December.\n\nSince the release of their self-titled third studio album in 2011 and the accompanying world tour (2011–2012), Evanescence took a three-year music hiatus, during which each member pursued their own projects. During that period, the band also parted ways with their long-term record label Wind-up Records. In November 2015, Evanescence made its return to stage, performing at the Ozzfest in Tokyo. At that time, Lee announced that there were no future plans for recording new material with the band and that the group would only tour and rejoin with its fans during through concerts in the following year. She further added that she focused on making music as a solo artist and exploring a side to her different from the one when she worked with Evanescence. In 2016, more dates were added to their tour with concerts taking place in the US.\n\nOn September 13, 2016, the band announced a vinyl box set titled The Ultimate Collection which included all three studio albums, the demo recorded early on in their career and new version of their song \"Even in Death\"; the set was released on February 17, 2017. In October 2016, Lee revealed during an interview with the online magazine Loudwire that \"there is Evanescence in the future\", adding that the band had reunited to re-record some of their earlier material, including tracks from their work before their first studio album Fallen (2003). On December 9, 2016, a compilation album titled Lost Whispers, consisting of B-sides and bonus tracks from the band's three studio albums, was made available for streaming and download on several music platforms.\n\nThe band's fourth studio album and its corresponding title Synthesis were revealed by Lee in a video posted on the group's Facebook page on May 10, 2017. According to her, the title came from the fact that the album is \"the synthesis, the combination, the contrast, the synergy between the organic and the synthetic, also the past and present\". She further noted how the new music would be stripped down, performed by an orchestra and would feature elements of electronica and the \"synthetic world of beats and sounds\". According to her, the process behind the album included the band going through their previous catalog and reworking some of their songs. In addition, two new songs were also recorded for Synthesis. She revealed during a video: \"This is a total passion project for me. There are so many layers in our music underneath the huge drums and guitars. I've always wanted to shine a light on some of the gorgeous David Campbell arrangements and programming elements in our songs, and that idea snowballed into completely re-doing them with full orchestra, not just strings, elaborate programming and experimentation\". Lee further added that the project \"flows like a big, dynamic soundtrack\". The rearrangement of the songs was done by David Campbell who had worked with the band during their previous projects and Evanescence members Lee and William B. Hunt.\n\nThe Synthesis version of \"Bring Me to Life\" is a stripped-down one, as it replaces the drums and the guitars from the original version with a strings arrangement. Its instrumentation is also provided by crashing cymbals, \"tension-building\" timpani drums and includes various electronic elements throughout. Several critics have described its new arrangement as \"dramatic\". Lee has described the song as \"new\" to her again due to the fact that she incorporated musical elements and vocals which she had \"heard in  head\" since its release.\n\n\"Imperfection\", one of the original songs written for the album, is an electronic-symphonic track which features Lee's \"signature belting\". According to Lee, the song was written in the perspective of a person who has lost someone due to suicide and depression and she described it as a \"plea to fight for your life\"."}]}
