{"album":[{"idAlbum":"2327635","idArtist":"111480","idLabel":"45344","strAlbum":"Fear Inoculum","strArtist":"Tool","intYearReleased":"2019","strStyle":"","strGenre":"Progressive Metal","strLabel":"RCA","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/vsryqy1567247059.jpg","strAlbumThumbBack":null,"strAlbumCDart":null,"intScore":"9","strDescriptionEN":"Fear Inoculum is the fifth studio album by American rock band Tool. It is the band's first album in thirteen years, due to creative, personal, and legal issues band members encountered since 2006's 10,000 Days. The album was released on August 30, 2019, to critical acclaim, with reviewers agreeing that the band had successfully refined their established sound.\n\nBackground\nWriting\nIn 2006, Tool released their fourth studio album, 10,000 Days. It topped the US Billboard 200 album chart and was certified platinum by the RIAA, indicating more than one million units sold, a month later. The band toured heavily in support of the album, playing more than 200 shows through 2007. After this, frontman Maynard James Keenan mentioned that he saw Tool breaking up in the near future, and focused on his side-project, Puscifer. However, by early 2008, at the 50th Grammy Awards, Keenan announced to MTV that the band would begin writing new material for their fifth studio album \"right away\".\n\nThe band was quiet over the next few years, only with Tool's website announcing that guitarist Adam Jones, bassist Justin Chancellor, and drummer Danny Carey were working on instrumental material while Keenan focused his efforts on Puscifer. The approach was consistent with what the band had done in the past, with Keenan waiting to write vocals and lyrics until instrumentals were completed. In 2012, the band's website was updated again, with the webmaster writing that they had heard instrumental material that had \"sounded like Tool…some of it reminiscent to earlier Tool stuff, with other parts pushing the envelope\" and that they estimated that the album was around half done.\n\nOutside problems slowed progress on the album over the following years. In 2013, it was reported that two separate scooter accidents injured two undisclosed members of the band, eliminating nine days of planned “jamming” time. Carey later revealed himself as one of the involved members, noting that he had been involved in a motorcycle accident that resulted in multiple cracked ribs, which caused him pain that further slowed recording. Keenan summed up the album's progress at the time in a cooking analogy, explaining that \"Basically right now it's a lot of ideas. There's no actual songs…It's still kind of noodles in a big basket. Lots of noodles, just no dishes.\" In 2014, Jones and Carey revealed that complicated legal issues and court battles stemming from a 2007 lawsuit had been slowing down the process as well. The issues stemmed from a lawsuit from a friend who claimed credit for artwork the band had used, but escalated after an insurance company involved sued the band over technicalities, leading to the band then counter-suing the insurance company. The constant court battles and delays, coupled with other life obligations, limited the band's time for working on music, and drained members of their motivation to be creative and write music. At the time, Carey stated that only one song was “pretty much done”, an untitled ten-minute track. In 2015, Jones announced that the legal issues were completely over.\n\nThe four of us are a lot of fucking work, just to get anywhere, oh my god. Everything’s a fucking committee meeting and it always gets shut down.  success. When you get successful, you think you’re right about everything and you’re pretty sure as that individual — ‘I am right and you are wrong, because I’m successful and we’re successful because of me, not because of you.’ It’s not that bad with us, but there’s a dynamic of like, ‘I want this and I’ve always gotten my way and that’s why we’re successful, because I don’t compromise on this or that.’ I’m the same way. I’m totally the same way.\nMaynard James Keenan, on the creative struggles on writing Fear Inoculum.\nWork on the album continued to progress through 2015, albeit \"slowly\", according to Keenan. Jones reported that the band had 20 different song ideas being developed. The band toured some, and debuted a new track, \"Descending\", albeit in a shortened, incomplete form, according to Jones. Jones also reported that instrumentals had been completed and passed on to Keenan to work on, though he hesitated to call any of the work \"done\". While it was reported in early 2016 by the band's webmaster that it was largely just a few shorter songs and interludes that needed finishing, by the end of the year, Chancellor described the band's status as still \"deep into the writing process”. He explained that while main themes and a loose \"skeleton\" had been established, Jones, Carey, and himself were continually creating and reworking new instrumental content. This work on the album continued throughout 2017. At the time, Carey predicted finishing and releasing in mid-2018, while Keenan countered these claims, stating it would likely take longer than that to finish. Jones, Chancellor, and Carey continued to work on the album while Keenan returned to A Perfect Circle in late 2017 to work with Billy Howerdel to record and release their fourth studio album Eat the Elephant in early 2018. By February 2018, Keenan announced that he had received rough music files from the rest of the band members containing instrumentals labeled \"FINAL\" for all but one track on the album in the prior few months, and had since started writing lyrics and vocal melodies.\n\nRecording\nOn March 10, 2018, Tool entered a major recording studio to start recording sessions with producer Joe Barresi, whom they had worked with on 10,000 Days. On May 11, it was reported that all drum parts had been tracked. In September, Keenan announced he had finished recording scratch vocals, but had not started final vocal takes. In January 2019, Keenan announced that he had finished his final vocal recording sessions \"months ago\", but that the album would still likely require lengthy mixing sessions. In the same month, Carey stated that they aimed to release the album in April 2019, though Keenan countered that this was unrealistic, instead pointing to a release between May and July. The band was in the studio with Bob Ludwig in March 2019; Ludwig had also mastered 10,000 Days.\n\nComposition and themes\nThe album consists of seven main tracks of music, and a run time just short of 80 minutes, the maximum runtime of CDs. The digital version of the album contains three short interlude tracks, stemming from Carey’s scrapped plan to have the album be entirely one long song. Jones and Carey described the songs as lengthy, but containing multiple movements within each track. The concept of seven is a recurring theme of the album both musically and conceptually; Chancellor and Jones wrote guitar riffs in unusual time signatures related to the number seven, while Keenan introduced ideas related to seven as well. Future music videos will also cover the theme. The album also explores the concept of growing \"older and wiser\". Keenan explained that the album covers the idea of \"embracing where we are right now, acknowledging where we've come from and some of the things we've gone through.\" Keenan also advised that patience and multiple listens were required in understanding the album, comparing it to a slowly developing movie. Jones described it as very different from their prior album (10,000 Days). Music critics and journalists have described the album as progressive rock, progressive metal, and alternative metal."}]}
