{"album":[{"idAlbum":"2332192","idArtist":"111239","idLabel":"45114","strAlbum":"Everyday Life","strArtist":"Coldplay","intYearReleased":"2019","strStyle":"","strGenre":"Alternative Rock","strLabel":"Parlophone","strReleaseFormat":"Album","intSales":"0","strAlbumThumb":"https://www.theaudiodb.com/images/media/album/thumb/slhr501605619206.jpg","strAlbumThumbBack":null,"strAlbumCDart":"https://www.theaudiodb.com/images/media/album/cdart/dzbb6l1605619194.png","intScore":"7.5","strDescriptionEN":"Everyday Life is the eighth studio album by Coldplay, released on 22 November 2019. It is a double album, with the first half titled Sunrise and the other Sunset.\n\nPromotion\nOn 13 October 2019, black-and-white posters featuring the band teasing the album, and the date \"22 November 1919\" appeared in various cities around the world, including São Paulo, Berlin, Hong Kong and Sydney. On 19 October, a video teaser featuring the same theme was also released. Two days later, several fans began receiving typewritten notes from the band in the mail.\n\n“\tdear friends / my typing isn't very good i'm sorry / I and we hope wherever you are you're ok / for the last 100 years or thereabouts we have been working on a thing called Everyday Life / in the classifieds you might write 'double album for sale, one very careful owner' / one half is called 'sunrise', the other 'sunset' / it comes out 22 november / it is sort of how we feel about things / we send much love to you from hibernation /سلام و حب / chris, jonny, guy and Will Champion, esq.\t”\n— Coldplay, in a typewritten note to their fans\nOn 23 October, the track listing was announced by the band in the advertising sections of several newspapers around the world. This included the North Wales Daily Post, where guitarist Jonny Buckland \"once had a holiday job\".\n\nLive performances\nDuring an online press conference on 1 November, Coldplay announced they would perform Everyday Life in two shows in Amman, Jordan on 22 November, the release date of the album. The first show will showcase the band performing the first half of the album Sunrise at 4:00 a.m. GMT, and the second show will feature the performance of Sunset at 2:00 p.m. GMT. The events, which will be livestreamed on YouTube, will mark the band's first performance in the country. Both performances are being promoted and advertised as YouTube Originals. On 18 November, the band announced a one-off show at the London Natural History Museum on 25 November, with proceeds from the show to be donated to an environmental charity. However, the band announced that they would not play a world tour to promote the album until they had addressed concerns regarding travel and the environmental impact of the shows."}]}
